[
{
    "id": 1689146,
    "title": "Field Maintenance Technician",
    "company": "blueground",
    "department": "Operations",
    "location": "New York",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.<br></p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 3,500 homes in 14 cities. We have raised more than $100m+ in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p><p>We are looking for a <strong>Field Maintenance Technician (Contract to hire) </strong>to join our <strong>New York</strong> team. The ideal candidate should be a stickler for detail, proactive, skilled in maintenance tasks and thoughtful as to ensure that the property is continuously in pristine condition for our guests. The role is primarily responsible for assisting our Operations Team in preparing new units, ensuring that existing units are perfect for our guests, and handling any issues or emergencies that arise. These issues include but are not limited to: guest lockouts, emergency relocations and communication to keep Operations Managers informed of potential repairs and actions being taken.</p><p><em>This position will require weekend and evening shifts but will not exceed a total of 40 hours/week.</em></p><p><strong>What you will mostly focus on:</strong></p><ul> <li>Assist Operations Managers in the set-up of the units with un-boxing, furniture assembly and installation of frames, sconces, and large mirrors.</li> <li>Complete maintenance tasks to ensure positive guest experience such as repairs of furniture (broken bed frames, loose legs on tables and chairs) </li> <li>Assist in delivering missing items to clients, such as glassware, lighting, small appliances, etc.</li> <li>Supervise outsourced technicians  while working on resolving an emergency in our apartments (locksmith, plumber etc.)</li> </ul><p><strong>What you may focus on:</strong></p><ul> <li>Perform messenger related duties such as collecting paperwork, delivering items, receiving mail</li> <li>Deliver keys to front desks, or placing lockboxes for client arrivals</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Willingness to get your hands dirty as needed to achieve operational excellence</li> <li>Great at handy work</li> <li>Must be comfortable using tools such as drills, hammers, mounting</li> <li>Can perform heavy lifting when needed</li> <li>Is flexible and available to work weekends and or evenings</li> <li>Problem solver, with ability to work in a fast-paced and \"get the job done\" culture</li> <li>Hard working with great attention to detail</li> <li>Ability to multitask and remain calm under pressure</li> <li>Confident user of technology (email, slack, G suite)</li> <li>A positive, upbeat and friendly personality</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Flexible paid time off</li> <li>Enhanced parental leave</li> <li>401k retirement plan</li> <li>Private life and health insurance plan</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in Greece and winter in Dubai!</li> </ul><em>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion</em>.",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/E2D0FF2F84"
},
{
    "id": 1821339,
    "title": "Account Development Manager",
    "company": "blueground",
    "department": "Enterprise Sales",
    "location": "Seattle",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning<p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p><p>We are currently seeking to recruit an <strong>Account Development Manager</strong> based in <strong>Seattle, WA</strong>. As a member of our enterprise sales team, you will develop and grow corporate accounts by conducting outbound sales to companies that would benefit from Blueground’s services. You’ll work in an exciting and collaborative environment, surrounded by talented and motivated colleagues. On top of it all, you’ll be joining a fast growing company!</p><p><strong>What you will mostly focus on:</strong></p><ul> <li>Create a sales pipeline and close new corporate accounts through proactive outreach to prospective clients utilizing a combination of email campaigns, networking and market research</li> <li>Communicate value propositions to clients that speak intimately to their needs and requirements</li> <li>Cultivate and build strong business relationships with key corporate decision makers (i.e. HR, Procurement, Travel Managers, Global Mobility, Office Managers).</li> <li>Build and strengthen relationships with existing enterprise clients</li> <li>Forecast and track key account metrics</li> </ul><p><strong>What we are looking for:</strong></p><ul><li>5+ years progressive experience in b2b sales and account management</li></ul><ul> <li>Effective and persuasive communicator (both verbal and written) with an ability to clearly summarize Blueground's value proposition</li> <li>Excellent account management skills and customer centric attitude</li> <li>Knowledge of and network in the mobility and corporate housing space is an advantage</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Flexible paid time off</li> <li>Enhanced parental leave</li> <li>401k retirement plan</li> <li>Competitive Health insurance (Medical, Dental and Vision), along with complimentary access to OneMedical and Health Advocate</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in Greece and winter in Dubai!</li> </ul><p><em>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion</em>.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/599661FEF8"
},
{
    "id": 1821065,
    "title": "Business Intelligence Analyst",
    "company": "blueground",
    "department": "Business Intelligence",
    "location": "Athens",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day easier.</p><p>We are currently looking to recruit a <strong>BI Analyst</strong> based in Athens to join our high performing BI team (remote working within Europe will be considered for this position). This role is key to supporting decision making and revenue growth by focusing on leading accurate, relevant and timely business insights. You’ll have a strong command of data, statistical and algorithmic techniques as well as a demonstrated practical ability to determine where to invest time. You’ll be able to synthesize actionable findings across diverse assignments, and present to an audience with varying levels of background in analytics. If you got excited by what you’ve read and you enjoy working in a positive and collaborative environment, surrounded by talented and motivated colleagues we would love to hear from you.</p><p><strong>What you will focus on</strong></p><ul> <li>Develop new, regular and automated reports from existing databases</li> <li>Provide end to end KPI tracking or ad hoc analysis as required by defining requirements and providing business insights</li> <li>Develop new models and tools, and communicate findings to leadership and wider team to enable informed strategic decisions</li> <li>Manage QA data, data processes, KPIs and various metrics</li> <li>Act as liaison with key business partners, ensuring full understanding of data flow, data integrity and business systems quality</li> <li>Conduct A/B testing</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>2-4 years of data analytics experience - excellent scripting skills in PostgreSQL, Tableau or similar for the purpose of data gathering, QA, analytics and modelling.</li> <li>BSc in relevant subjects (i.e. Math, Applied Computer or Data Science, Economics, Statistics and/or Business) is required, MSc will be considered a plus</li> <li>Analytical mindset and detail-oriented with ability to focus and prioritize demanding workload</li> <li>Self-motivated, self- organised individual, able to work independently</li> <li>Agile team-working experience and excellent team spirit</li> <li>Knowledge of data libraries such as sklearn and pandas, Python, and ML techniques such as Decision Trees, Regression, Clustering, SVM, Bayesian networks is a strong plus.</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Workstation of your choice</li> <li>Competitive salary</li> <li>Annual Performance Bonus</li> <li>Group Health Insurance program</li> <li>Mobile Data Plan</li> <li>Flexible paid time off</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in LA and winter in Dubai!</li> </ul><p><em>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</em></p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/C974FB4362"
},
{
    "id": 1810098,
    "title": "Real Estate Portfolio Administrator",
    "company": "blueground",
    "department": "Real Estate Partnerships/Business Development",
    "location": "Dubai",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p><p>We are looking for a<strong> Real Estate Portfolio Administrator</strong> based in Dubai, to support the growth and organization of the Real Estate Portfolio Administration team and to provide attentive support to internal parties. If you are a well organized, analytical person with exceptional communication and problem solving skills then this role may be for you!</p><p>Kindly note that the working hours for this role are 09:00 am to 18:00 pm from <strong>Sunday to Thursday.</strong></p><p><strong>What you will focus on:</strong></p><ul> <li>Assist the Real Estate Team with the administrative side of negotiations and deals: drafting contracts, data entry, reviewing ledgers, collecting landlords pending maintenance, registering Ejaris via the online platform</li> <li>Work closely with Finance and Accounting to control landlord payments received in regards to pending maintenance</li> <li>Assist with property insurance requests to ensure proper coverage and address renewal as policies expire</li> <li><strong>What we are looking for:</strong></li> </ul><ul> <li>Degree from a top-tier university</li> <li>Minimum 2 years of experience in a similar role (residential RE or Property Management company)</li> <li>Fluency in English (Fluent Arabic will be considered a plus)</li> <li>Proficiency in Microsoft Word, Excel and Powerpoint</li> <li>Self-starter with a roll up your sleeves mentality</li> <li>Entrepreneurial drive, adaptability, and focus on results</li> <li>Strong analytical skills</li> <li>Strong organizational skills with the ability to manage multiple assignments</li> <li>Excellent verbal and written communication skills</li> <li>Ability to work independently and with speed</li> <li>Attention to detail</li> </ul><p><strong>Your Benefits:</strong></p><ul> <li>Competitive salary</li> <li>Flexible paid time off</li> <li>Group Health Insurance program</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think winter in New York and summer in Greece</li> </ul><em>At Blueground we are proud to have Diversity and Inclusion at the center of everything we do. We are committed to Equal Employment Opportunity regardless of race, color, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion</em>.",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/A5373265FA"
},
{
    "id": 1747493,
    "title": "Real Estate Partnerships Associate",
    "company": "blueground",
    "department": "Real Estate Partnerships/Business Development",
    "location": "Denver",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p><p>We are currently looking for a <strong>Real Estate Partnerships Associate</strong> to join our amazing Denver team.</p><p>The Real Estate Partnerships Associate will help us find apartments according to Blueground specifications and standards. He/she will focus on visiting selected areas in the city to identify the right housing for on-boarding in order to grow further our business in the local market.</p><p>If you are a professional who possesses great interest in the hospitality and real estate sector, with strong research and strategic analysis skills then this role may be for you!</p><p><strong>What you will focus on:</strong></p><ul> <li>Research and source qualified properties via market investigation (real estate agencies, property adds, etc)</li> <li>Pipeline overall business growth through a combination of cold calling, email campaigns, networking and local market sector knowledge to increase supply</li> <li>Presentation of Blueground value proposition, the essence of our business and the benefits our product and services offer to landlords, real estate brokers and partners</li> <li>Communication with landlords and real estate partners, pricing negotiation and contract administration according to company procedures</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Bachelor's Degree</li> <li>A minimum of 3 years relevant working experience</li> <li>A Real Estate license will be considered as a plus but it is not obligatory</li> <li>Knowledge of the Denver Real Estate Market</li> <li>Strong communication skills and with an eye-to-detail approach</li> <li>Quick thinker and deal maker</li> <li>Passion for aesthetic housing and with home inspection ability</li> <li>Ability to work independently and take initiative</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Flexible paid time off</li> <li>Enhanced parental leave</li> <li>401k retirement plan</li> <li>Private life and health insurance plan</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in Greece and winter in Dubai!</li> </ul><p><em>At Blueground we are proud to have Diversity and Inclusion at the center of everything we do. We are committed to Equal Employment Opportunity regardless of race, color, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion</em>.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/C1CDACFBC2"
},
{
    "id": 1578557,
    "title": "Inbound Sales Associate (French fluent)",
    "company": "blueground",
    "department": "Inbound Sales",
    "location": "Athens",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day easier.</p><p>We are looking to recruit a <strong>Sales Associate (Native-like French Speaking)</strong> based in Athens to join our centralized <strong>Inbound Sales</strong> department and be responsible for our Sales Operations in Dubai &amp; Paris. As member of our sales team you will manage inbound sales requests concerning bookings of Blueground properties. <strong>Working days for this position are Sunday to Thursday.</strong><br></p><p><strong>What you will focus on:</strong></p><ul> <li>Respond to incoming property sales inquiries full cycle and handling requests (via phone, email, social tools etc) generated from all online sales channels offering clients the best accommodation solution based on their need</li> <li>Forecast sales activity and revenue (meeting and exceeding weekly, quarterly, and annual sales quotas and KPIs)</li> <li>Proactive daily pipeline management in our CRM</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>1-3 years experience in sales or account management in the real estate sector in a quota carrying role</li> <li>Ability to run proper exploratory/discovery calls, be an active listener and objection handling and negotiation</li> <li>Customer first mindset and hunter mentality</li> <li>Coachable individual able to implement feedback</li> <li>Ability to multitask in a fast paced environment</li> <li>Fluency in French language / Business proficiency in English</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Flexible paid time off</li> <li>Group Health Insurance program</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in LA and winter in Dubai!</li> <li>Flexible work environment through our <a target=\"_blank\" href=\"https://medium.com/blueground/blueground-nomads-program-lets-employees-optimize-their-work-setups-a641650ff35a\" rel=\"nofollow noreferrer noopener\" class=\"external\">Blueground Nomads</a> employee mobility program</li> </ul><p>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/5247A3CD83"
},
{
    "id": 1825030,
    "title": "General Manager",
    "company": "blueground",
    "department": "General Management",
    "location": "Madrid",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 14 cities. We have raised $100m+ in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time </strong>is everything, and we cherish it greatly. For us, <strong>Excellence </strong>isn’t simply a standard, but an exciting way to look at life. We <strong>Care </strong>deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency </strong>which we believe makes our day-to-day easier.</p><p>We are looking for a <strong>General Manager</strong> for our imminent launch in the city of <strong>Madrid</strong>.</p><p>The GM position is one of the most exciting and impactful roles at Blueground. As the leader of Madrid office and a member of Blueground’s global leadership team, you will own your P&amp;L and manage all business activities: from hiring your team, to on-boarding and marketing units, to building strong relationships with the local real estate industry. You will be responsible for launching, scaling and owning the Madrid market. If you like ownership, leadership and hustling, while being very strategic and analytical in your approach, this is the right role for you.</p><p><strong>What you will focus on:</strong></p><ul> <li>Owning the P&amp;L for Blueground's Madrid's business</li> <li>Building and scaling a best-in-class team for real estate, operations and sales</li> <li>Defining city priorities and goals, and managing performance on a monthly and quarterly basis by setting relevant KPIs and incentive structure</li> <li>Identifying unexplored opportunities and adapting the business model to local requirements, taking into account potential regulatory constraints</li> <li>Staying actively educated on Madrid's real estate trends to adapt and refine leasing strategy</li> <li>Shaping and sharing best practices with the rest of the network towards the constant efficiency improvement of our global operations.</li> <li>Being the face of Blueground in Madrid - local PR and networking events</li> <li>Collaborating with Product, Revenue Management, Marketing, Technology and Client Experience teams to meet the needs of local market</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Relevant experience (at least 5 years) in leadership roles and ideally managing own P&amp;L and building a high-performing team</li> <li>Entrepreneurial drive, adaptability, and focus on results</li> <li>Ability to work independently, effectively and efficiently</li> <li>Demonstrated ability to lead complex operational and strategic initiatives</li> <li>Analytical and data-driven decision making</li> <li>A team player that will fit with our <a href=\"https://www.theblueground.com/about\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">values</a> and add to our culture</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Discretionary annual bonus scheme</li> <li>Stock options plan</li> <li>Flexible paid time off</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in LA and winter in Dubai</li> </ul><p><em>At Blueground we are proud to have Diversity and Inclusion at the center of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</em></p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/CE1F827BA9"
},
{
    "id": 1825028,
    "title": "General Manager",
    "company": "blueground",
    "department": "General Management",
    "location": "Zürich",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 14 cities. We have raised $100m+ in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time </strong>is everything, and we cherish it greatly. For us, <strong>Excellence </strong>isn’t simply a standard, but an exciting way to look at life. We <strong>Care </strong>deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency </strong>which we believe makes our day-to-day easier.</p><p>We are looking for a <strong>General Manager</strong> for our imminent launch in the city of <strong>Zurich</strong>.</p><p>The GM position is one of the most exciting and impactful roles at Blueground. As the leader of Zurich office and a member of Blueground’s global leadership team, you will own your P&amp;L and manage all business activities: from hiring your team, to on-boarding and marketing units, to building strong relationships with the local real estate industry. You will be responsible for launching, scaling and owning the Zurich market. If you like ownership, leadership and hustling, while being very strategic and analytical in your approach, this is the right role for you.</p><p><strong>What you will focus on:</strong></p><ul> <li>Owning the P&amp;L for Blueground's Zurich's business</li> <li>Building and scaling a best-in-class team for real estate, operations and sales </li> <li>Defining city priorities and goals, and managing performance on a monthly and quarterly basis by setting relevant KPIs and incentive structure</li> <li>Identifying unexplored opportunities and adapting the business model to local requirements, taking into account potential regulatory constraints</li> <li>Staying actively educated on Zurich's real estate trends to adapt and refine leasing strategy</li> <li>Shaping and sharing best practices with the rest of the network towards the constant efficiency improvement of our global operations.</li> <li>Being the face of Blueground in Zurich - local PR and networking events</li> <li>Collaborating with Product, Revenue Management, Marketing, Technology and Client Experience teams to meet the needs of local market</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Relevant experience (at least 5 years) in leadership roles and ideally managing own P&amp;L and building a high-performing team</li> <li>Entrepreneurial drive, adaptability, and focus on results</li> <li>Ability to work independently, effectively and efficiently</li> <li>Demonstrated ability to lead complex operational and strategic initiatives</li> <li>Analytical and data-driven decision making</li> <li>A team player that will fit with our <a href=\"https://www.theblueground.com/about\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">values</a> and add to our culture</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Discretionary annual bonus scheme</li> <li>Stock options plan</li> <li>Flexible paid time off</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in LA and winter in Dubai</li> </ul><p><br></p><p><em>At Blueground we are proud to have Diversity and Inclusion at the center of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</em></p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/32B798E1DF"
},
{
    "id": 1678295,
    "title": "Senior Accounting Associate",
    "company": "blueground",
    "department": "Accounting",
    "location": "Athens",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time </strong>is everything, and we cherish it greatly. For us, <strong>Excellence </strong>isn’t simply a standard, but an exciting way to look at life. We <strong>Care </strong>deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency </strong>which we believe makes our day-to-day life easier.</p><p>We are looking for an ambitious <strong>Accounting Associate</strong> based in <strong>Athens</strong>, to provide support to the Accounting department of Blueground Paris by managing daily accounting tasks. The Accounting Associate will be part of a team of professionals working to maintain order and transparency of the company’s finances. By contributing to the overall efficient operation of the department and by helping the company be fully aware of its financial condition, this role can help the company make the right decisions and accomplish long term success. The ideal candidate should be able to work comfortably with numbers and have great attention to detail.</p><p><strong>What you will focus on:</strong></p><ul> <li>Post and process journal entries to ensure all business transactions are recorded</li> <li>Update accounts payable, A/P master data, and perform reconciliations</li> <li>Update accounts receivable, A/R master data, and perform reconciliations</li> <li>Ensure proper application of controls in A/P and A/R processes</li> <li>Assist in the monthly/annual preparation of the balance sheet, income statement and other financial reports according to IFRS and internal accounting guidelines</li> <li>Assist in assessing current processes in terms of efficiency</li> <li>Assist with other accounting projects and/or ad hoc projects.</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>BSc or Ba in Accounting, Finance or relevant field</li> <li>4-6 years of experience coming from a similar position within an accounting firm or in house accounting department</li> <li>Understanding of accounting principles and reporting practices</li> <li>Basic experience on establishing controls</li> <li>Fluency in English</li> <li>Fluency in French will be considered as a plus</li> <li>Excellent knowledge of MS Office</li> <li>Excellent organizational skills</li> <li>Excellent communication skills</li> <li>Attention to detail</li> <li>Numbers driven individual with analytical acumen</li> <li>Familiarity with Navision 365 accounting software will be considered as a plus</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Flexible paid time off</li> <li>Group Health Insurance program</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in LA and winter in Dubai!</li> <li>Flexible work environment through our <a target=\"_blank\" href=\"https://medium.com/blueground/blueground-nomads-program-lets-employees-optimize-their-work-setups-a641650ff35a\" rel=\"nofollow noreferrer noopener\" class=\"external\">Blueground Nomads</a> employee mobility program</li> </ul><p><br></p><p><em>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</em></p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/2EBB570520"
},
{
    "id": 1795075,
    "title": "Supply Chain Operations Intern",
    "company": "blueground",
    "department": "Design and Supply Chain",
    "location": "İstanbul",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.<br><br>We are looking for a <strong>Supply Chain Operations Intern </strong>to join our Supply Chain Operations team, based in Istanbul. This role will be the critical link between warehousing, purchasing and demand planning department. You will be responsible for ensuring on-time supplier delivery, warehouse readiness and providing inflow-outflow information to the demand planning departments. This is a great opportunity for anyone that is keen to grow their career in a fast paced, high performing team that is managing our global supply chain.</p><p><strong>What you will focus on:</strong></p><ul> <li>Tracking supply chain orders on a daily basis ensuring timely deliveries</li> <li>Ensuring the product documentation and labeling are completed according to our standards</li> <li>Analyzing supplier performance patterns and constraints and providing insights for the procurement department</li> <li>Collaborating closely with Supply Chain Finance team to take corrective actions at the supplier side</li> <li>Assisting in building monthly supply chain dashboard for the top management</li> <li>Tracking the root causes of operational problems and build infrastructure</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>University degree or current student</li> <li>Excellent analytical and problem solving skills</li> <li>Exceptional verbal and written communication skills</li> <li>Advanced excel skills</li> <li>Fluency in English is required for this role</li> <li>A good balance of being assertive and collaborative</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Flexible paid time off</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in LA and winter in Dubai!</li> </ul><p>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, color, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/FA9D5CA519"
},
{
    "id": 1652779,
    "title": "Operations Associate - Boston",
    "company": "blueground",
    "department": "Operations",
    "location": "Boston",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p><p>We are looking for an <strong>Operations Associate</strong> to join our fast growing <strong>Boston</strong> team. The ideal candidate should be a stickler for detail, proactive, skilled in general maintenance tasks and thoughtful as to ensure that the property is continuously in pristine condition for our guests. The role is primary responsible for assisting our Operations Team in preparing new units, ensuring that existing units are perfect for our guests, and handling any issues or emergencies that arise. These issues include but are not limited to handling guest lockouts, emergency relocations, as well as keeping Operations Managers informed of potential repairs and actions being taken.</p><p><em>This is a contract to hire position (first 3 months under a contract relationship - conversion to permanent - full time if performance goals are met); This position requires working on weekends (3 preferred weekdays + weekend) on a permanent basis.</em></p><p><strong>What you will mostly focus on:</strong></p><ul> <li>Assist our Operations Managers in the set-up of the units with un-boxing, furniture assembly and frames' installation</li> <li>Complete basic maintenance tasks to ensure positive guest experience</li> <li>Perform check-in/outs to our properties according to business standards</li> <li>Be the main point of contact between our guests and the customer experience team</li> <li>Supervise handyman while working on resolving an emergency in our apartments (locksmith, plumber etc.)</li> </ul><p><strong>What you may focus on:</strong></p><ul> <li>Manage viewings at Blueground properties for prospective clients or partners</li> <li>Perform messenger related duties such as collecting paperwork, delivering items, receiving mail</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Willingness to get their hands dirty as needed to achieve operational excellence</li> <li>Strong communication and interpersonal skills</li> <li>Great at handy work</li> <li>Can perform heavy lifting when needed</li> <li>Is available to work a weekend day</li> <li>Problem solver, with ability to work in a fast-paced and \"get the job done\" culture</li> <li>Hard working with great attention to detail</li> <li>Ability to multitask and remain calm under pressure</li> <li>Confident user of technology (email, slack, G suite)</li> <li>A valid driver's license and a clean driving record with no traffic violations; as well as a reliable vehicle</li> <li>A positive, confident, upbeat and friendly personality</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Market competitive salary</li> <li>Corporate cell phone plan</li> <li>Joining a fast growing start up</li> </ul><p><em>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion</em>.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/E987AA8C7F"
},
{
    "id": 1247939,
    "title": "Real Estate Business Development Associate",
    "company": "blueground",
    "department": "Real Estate Partnerships/Business Development",
    "location": "Paris",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning. What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day easier.</p><p>We are seeking a <strong>Real Estate - Business Development Associate</strong> based in our <strong>Paris, France</strong> office to help us grow our apartment portfolio in the area according to Blueground specifications and standards. You will focus on building our apartment supply in selected Viennese neighborhoods to further fuel our growth and market presence.</p><p>If you are a recent graduate or professional, that is looking for a fast-growing career within an international startup company, who possesses an interest in real estate and has strong communication, sales or business development skills, then this role may be for you!</p><p><strong>What you will focus on:</strong></p><ul> <li>Research and source qualified properties via market investigation (real estate agencies, property adds, etc)</li> <li>Establish B2B relationships with real estate developers and real estate funds to secure bulk deals</li> <li>Present Blueground's value proposition, the essence of our business and the benefits our product and services offer to landlords, real estate brokers and developers</li> <li>Communicate with landlords and real estate partners, negotiate prices and payments terms and administrate contracts according to company procedures</li> <li>Manage pipeline overall business growth through a combination of cold calling, email campaigns, networking and local market sector knowledge to increase supply</li> <li>Contribute to marketing efforts to expand our reach and relevance in landlord, real estate broker and developer communities</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>1-3 years of work experience in the real estate industry</li> <li>Customer - centric mindset</li> <li>Fluency in both French and English</li> <li>Computer literate</li> <li>Strong written and verbal communication and relationship building skills (negotiation experience is a plus)</li> <li>Entrepreneurial curiosity and can do attitude suitable in a fast-growth, startup environment</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Flexible paid time off</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in LA and winter in Dubai!</li> </ul><p>At Blueground we are proud to have Diversity and Inclusion at the center of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/CE00503FA9"
},
{
    "id": 1808641,
    "title": "Product Designer, Platform",
    "company": "blueground",
    "department": "Product Design",
    "location": "Athens",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p><p>We are looking for a talented <strong>Product Designer</strong> to join our growing Product Design team based in Athens and work on our platform team, onsite or remote.</p><p>We are a tech-enabled company currently making substantial investments in our technology products to enable our next stage of high growth. You will work on our booking platform and help us create amazing user-centered experiences, utilizing data, research, and analytics.</p><p><strong>What you will focus on:</strong></p><ul> <li> <strong>Conduct workshops</strong> to identify and understand the project’s goals, user needs and technical constraints</li> <li>Participate in <strong>product discovery</strong> work including interviews, usability tests, surveys, card sorting, rapid prototyping and tapping into our conversion funnels and data. Let the users lead your decisions :)</li> <li> <strong>Iterate</strong> based on feedback, benchmarking, A/B testing and contextual research</li> <li>Conceptualize specs into <strong>wireframes and mockups</strong> </li> <li> <strong>Collaborate</strong> with product managers, engineers, and other designers to solve design problems effectively and efficiently</li> <li>Create <strong>pixel-perfect designs and prototypes</strong> that are desktop and mobile responsive</li> <li> <strong>Support</strong> the implementation process</li> <li>Improve and maintain our <strong>internal design system</strong> </li> <li> <strong>Be part of our design chapter</strong> that aligns the visual language and user experience across products</li> <li>Participate in <strong>SCRUM</strong> ceremonies</li> </ul><p><strong>What to expect</strong></p><ul> <li>To work in agile, cross-functional teams</li> <li>To define not just how things work, but what we should be building</li> <li>To design lots of new stuff from scratch and revamp many of the existing functionalities</li> <li>A team that constantly raises its standards of work</li> <li>A rapidly growing company with top talented people</li> <li>Trust and autonomy</li> <li>To experiment, learn and have fun</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>1-3 years of experience working in UX, UI, HCI related field with a strong portfolio showcasing your best work</li> <li>Solve specific function-level problems in a similar role</li> <li>Experience working within digital product teams as a designer and contributor of design processes</li> <li>Highly proficient with industry-standard design tools (e,g. Figma, Sketch). We're using Figma!</li> <li>Solid experience with at least one interactive prototyping tool (e.g., Figma, Protopie, Marvel, Framer)</li> <li>Good understanding of Agile methodology, especially with respect to UI/UX design</li> <li>Ability to present your designs to various stakeholders</li> <li>A positive attitude and team player</li> <li>Excited about working in a fast-paced startup environment</li> </ul><ul> <li>Bonus: Having led a product design for both web and mobile applications</li> <li>Bonus: HTML and CSS not being foreign to you</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Flexible paid time off</li> <li>Group Health Insurance program</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in LA and winter in Dubai!</li> <li>Flexible work environment through our <a target=\"_blank\" href=\"https://medium.com/blueground/blueground-nomads-program-lets-employees-optimize-their-work-setups-a641650ff35a\" rel=\"nofollow noreferrer noopener\" class=\"external\">Blueground Nomads</a> employee mobility program</li> </ul><p><em>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</em></p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/709DB77108"
},
{
    "id": 1552858,
    "title": "Operations Associate",
    "company": "blueground",
    "department": "Operations",
    "location": "San Jose",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p><p>We are looking for an <strong>Operations Associate</strong> to join our fast growing<strong> San Francisco Bay Area</strong> team. This position will be based out of <strong>San Jose</strong>. The ideal candidate should be a stickler for detail, proactive, skilled in general maintenance tasks and thoughtful as to ensure that the property is continuously in pristine condition for our guests.The role is primary responsible for assisting our Operations Team in preparing new units, ensuring that existing units are perfect for our guests, and handling any issues or emergencies that arise.These issues include but are not limited to handling guest lockouts, emergency relocations, as well as keeping Operations Managers informed of potential repairs and actions being taken.</p><p><em>This position will require some weekend work; Tuesday to Saturday, or Sunday to Thursday.  </em></p><p><strong>What you will mostly focus on:</strong></p><ul> <li>Assist our Operations Managers in the set-up of the units with un-boxing, furniture assembly and frames' installation</li> <li>Complete basic maintenance tasks to ensure positive guest experience</li> <li>Perform check-in/outs to our properties according to business standards</li> <li>Be the main point of contact between our guests and the customer experience team</li> <li>Supervise handyman while working on resolving an emergency in our apartments (locksmith, plumber etc.)</li> </ul><p><strong>What you may focus on:</strong></p><ul> <li>Manage viewings at Blueground properties for prospective clients or partners</li> <li>Perform messenger related duties such as collecting paperwork, delivering items, receiving mail</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Willingness to get their hands dirty as needed to achieve operational excellence</li> <li>Strong communication and interpersonal skills</li> <li>Great at handy work</li> <li>Can perform heavy lifting when needed</li> <li>Is available to work a weekend day</li> <li>Problem solver, with ability to work in a fast-paced and \"get the job done\" culture</li> <li>Hard working with great attention to detail</li> <li>Ability to multitask and remain calm under pressure</li> <li>Confident user of technology (email, slack, G suite)</li> <li>A valid driver's license and a clean driving record with no traffic violations; as well as a reliable vehicle</li> <li>A positive, confident, upbeat and friendly personality</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Market competitive salary</li> <li>Corporate cell phone plan</li> <li>Joining a fast growing start up</li> </ul><p><em>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion</em>.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/3F21F50FE6"
},
{
    "id": 1814295,
    "title": "Talent Sourcer",
    "company": "blueground",
    "department": "People",
    "location": "Athens",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised $100m+ in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time </strong>is everything, and we cherish it greatly. For us, <strong>Excellence </strong>isn’t simply a standard, but an exciting way to look at life. We <strong>Care </strong>deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency </strong>which we believe makes our day-to-day easier.</p><p>We are looking for a talented <strong>Talent Sourcer</strong> to join our People Team based in Athens. As Blueground's talent scout, you will focus on finding amazing people that will love our culture and embrace our values. If you are a target-driven professional, who has a passion for attracting great talent and creating an exceptional candidate experience, this is an opportunity to drive your career forward! </p><p><strong>What you will focus on:</strong></p><ul> <li>Craft and send recruiting emails</li> <li>Source and build candidate pipelines for current and future key roles across the organization</li> <li>Establish strong relationships with the recruiting team, hiring managers and various stakeholders to determine position requirements and build strategies for targeting talent</li> <li>Execute talent sourcing tactics such as direct sourcing, database mining, networking, name generation, cold-calling, university relations, industry events, associations, (online) communities, external research, social media, etc.keeping D&amp;I in mind through every part of the Talent Attraction process.</li> <li>Recommend and drive improvements to enhance and scale our pipeline strategy</li> <li>Use various sourcing channels to identify qualified candidates for roles</li> <li>Communicate with past applicants regarding new job opportunities</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>BSc/MSc in Human Resources Management or relevant field</li> <li>Basic experience in recruiting coordination and actively sourcing passive talent</li> <li>Tech-savvy and familiar with our tools/systems: Workable or other Applicant Tracking System, Google Suite and Slack</li> <li>Candidate experience focused, passionate about employer branding and be creative in our approach to sourcing talent</li> <li>Excellent organizational and prioritization skills, tenacious, personable and articulate</li> <li>Positive attitude combined with a desire to make work fun</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Flexible Paid Time Off</li> <li>Discretionary annual bonus scheme</li> <li>Group Health Insurance program</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> <li>Flexible work environment through our <a href=\"https://medium.com/blueground/blueground-nomads-program-lets-employees-optimize-their-work-setups-a641650ff35a\" rel=\"nofollow noreferrer noopener\" class=\"external\">Blueground Nomads</a> employee mobility program</li> <li>Complimentary accommodations in Blueground locations! Think summer in LA and winter in Dubai!</li> </ul><p><br></p><p><em>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</em></p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/2FC54EF533"
},
{
    "id": 1602598,
    "title": "Operations Associate -Seattle",
    "company": "blueground",
    "department": "Operations",
    "location": "Seattle",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p><p>We are looking for an <strong>Operations Associate</strong> to join our fast growing <strong>Seattle team</strong>. The ideal candidate should be a stickler for detail, proactive, skilled in general maintenance tasks and thoughtful as to ensure that the property is continuously in pristine condition for our guests. The role is primarily responsible for assisting our Operations Team in preparing new units, ensuring that existing units are perfect for our guests, and handling any issues or emergencies that arise. These issues include but are not limited to handling guest lockouts, emergency relocations, as well as keeping Operations Managers informed of potential repairs and actions being taken.</p><p><br></p><p><strong>What you will mostly focus on:</strong></p><ul> <li>Assist our Operations Managers in the set-up of the units with un-boxing, furniture assembly and frames' installation</li> <li>Complete basic maintenance tasks to ensure positive guest experience</li> <li>Perform check-in/outs to our properties according to business standards</li> <li>Be the main point of contact between our guests and the customer experience team</li> <li>Supervise handyman while working on resolving an emergency in our apartments (locksmith, plumber etc.)</li> </ul><p>What you may focus on:</p><ul> <li>Manage viewings at Blueground properties for prospective clients or partners</li> <li>Perform messenger related duties such as collecting paperwork, delivering items, receiving mail</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Willingness to get their hands dirty as needed to achieve operational excellence</li> <li>Great at handy work</li> <li>Can perform heavy lifting when needed</li> <li>Is available to work weekends</li> <li>Problem solver, with ability to work in a fast-paced and \"get the job done\" culture</li> <li>Hard working with great attention to detail</li> <li>Ability to multitask and remain calm under pressure</li> <li>Confident user of technology (email, slack, G suite)</li> <li>A positive, confident, upbeat and friendly personality</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Market competitive salary</li> <li>Commuting Benefit</li> <li>Corporate cell phone plan</li> <li>Joining a fast growing start up</li> </ul><p><em>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion</em>.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/7B1ED1C4B8"
},
{
    "id": 1818575,
    "title": "Real Estate Portfolio Administrator - US (East Coast)",
    "company": "blueground",
    "department": "Real Estate Partnerships/Business Development",
    "location": "",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 3,500 homes in 14 cities. We have raised more than $100m+ in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p><p>We are looking for a <strong>Real Estate Portfolio Administrator </strong>based anywhere in the <strong>East Coas</strong>t in the <strong>US</strong>, to support the growth and organization of the Real Estate team. To succeed in the role, you should be committed to providing attentive support for internal parties and ensuring consistent, efficient operations. If you are a well organized, analytical person with exceptional communication and problem solving skills then this role may be for you!</p><p><strong>What you will focus on:</strong></p><ul> <li>Work with the Real Estate team on all related business activities to lease and on-boarding. units including contracting and developing the relationship to lease additional units</li> <li>Track and maintain lease negotiation correspondence and file</li> <li>Oversee renewals process for multiple markets including negotiation, tracking, etc.</li> <li>Maintain Blueground leasing and property files and enter information into company internal database</li> <li>Perform administrative duties and ensure all information is accurately entered into the company database system and g-sheets.</li> <li>Ensure accuracy with finance on rent statement and landlord invoicing</li> <li>Assist with Revenue Share Reporting</li> <li>Assist with Payments for Capital Efficient Units</li> <li>Utilities tracking and auditing</li> <li>Assist all markets with insurance (COI) requests to ensure proper coverage and address renewal as policies expire</li> <li>Assist the Real Estate Portfolio Administrator and Central Real Estate Team with the administrative side of negotiations and deals: payments, data entry, reviewing ledgers, landlord credential maintenance</li> </ul><ul> <li>Work closely with Operational Excellence to ensure RE processes effectiveness</li> <li>Work with the Product Team to optimise RE relevant information storage into our internal information system</li> <li>Establishing/improving processes for portfolio onboarding and management.</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Degree from a top-tier university</li> <li>Min. 1-2 years of experience in a similar role (residential RE or hospitality experience will be considered as a plus)</li> <li>Fluency in English</li> <li>Proficiency in Microsoft Word, Excel (formulation, data entry, charts, pivot tables) and Powerpoint</li> <li>Self-starter with a roll up your sleeves mentality</li> <li>Entrepreneurial drive, adaptability, and focus on results</li> <li>Strong quantitative and analytical skills</li> <li>Strong organizational skills with the ability to manage multiple assignments</li> <li>Excellent verbal and written communication skills</li> <li>Ability to work independently and with speed</li> <li>Attention to detail</li> </ul><p><strong>Your Benefits:</strong></p><ul> <li>Competitive salary</li> <li>Competitive Health insurance (Medical, Dental and Vision), along with complimentary access to OneMedical and Health Advocate</li> <li>401k retirement plan</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> <li>Flexible work environment through our <a href=\"https://medium.com/blueground/blueground-nomads-program-lets-employees-optimize-their-work-setups-a641650ff35a\" rel=\"nofollow noreferrer noopener\" class=\"external\">Blueground Nomads</a> employee mobility program</li> <li>Complimentary accommodation in Blueground locations. Think summer in LA and winter in Dubai!</li> </ul><em>At Blueground we are proud to have Diversity and Inclusion at the center of everything we do. We are committed to Equal Employment Opportunity regardless of race, color, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion</em>.",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/46A1DA696D"
},
{
    "id": 1785183,
    "title": "Channel Marketing Associate",
    "company": "blueground",
    "department": "Marketing",
    "location": "Athens",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p><p>We are looking for a highly motivated <strong>E-commerce / Channel Marketing Associate </strong>based in Athens, to join the Channel Marketing team. You will be primarily responsible for assisting the Channel Marketing team in the listing/advertising process of Blueground properties on classifieds and booking platforms, in order to maximize utilization and occupancy across cities.</p><p><strong>What you will focus on:</strong></p><ul> <li>Upload the Blueground properties in the relevant listing sites/channels using the data from our internal database</li> <li>Maintain the content of the properties’ listings/advertisements in order to make sure that all the data are always up to date</li> <li>Join team projects which include research of new channels/listing sites, monitoring the listing sites’ performance, improvement of internal processes, etc.</li> <li>Be responsible for simultaneous multiple tasks in different cities</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Degree from a top – tier university</li> <li>Fluent in written and verbal English</li> <li>Prioritization and organizational skills</li> <li>Strong attention to detail</li> <li><i>Good understanding of Microsoft Excel / Gsheets </i></li> <li><i>Keen to take on tasks with more responsibilities<br></i></li> <li>Comfortable learning how to use new software platforms</li> <li>Great team player, flexible, with strong communication skills</li> </ul><p><strong>Nice-to-haves:</strong></p><ul><li>Good communication skills in any of the following languages: Turkish, Italian, Spanish, French or German</li></ul><p><strong>Your benefits:</strong><br></p><ul> <li>Competitive salary</li> <li>Flexible paid time off</li> <li>Enhanced parental leave</li> <li>Group Health Insurance program</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in LA and winter in Dubai!</li> </ul><p><em>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</em></p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/F2EC7C15D2"
},
{
    "id": 1792785,
    "title": "Demand Planner",
    "company": "blueground",
    "department": "Design and Supply Chain",
    "location": "İstanbul",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning<p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p><p>We are looking for a <strong>Demand Planner</strong> to join our high performing <strong>Design and Supply Chain</strong> team, based in <strong>Istanbul</strong>. This role will be responsible for managing demand-supply risks and communicating effectively with stakeholders. Collaborating with city GM’s, product &amp; design team and all related parties of Supply Chain, you will ensure the required furniture are always at disposal. You will have a great understanding of the demand forecast for our markets, monitor global inventory levels and take action according to the output of this initiative. If you liked what you read and you feel you can make a difference in this role we would love to hear from you!</p><p><strong>What you will focus on:</strong></p><ul> <li>Improving demand planning systems, infrastructure, tools and methods</li> <li>Reporting, analyzing and delivering KPIs (Forecast Bias &amp; Accuracy, Supply Chain KPIs, Stock-on-hand days, overstocks)</li> <li>Managing short-term demand requests</li> <li>Identifying potential supply risks and aligning with internal customers</li> <li>Highlighting gaps in the demand planning and ensuring any required actions are on track (both within supply chain and extended Blueground team)</li> <li>Obsolete stock management, identifying risks, taking the required actions to accelerate sales and avoiding excess stock</li> <li>Managing the Supply Chain responsibilities in various projects</li> <li>Acting as a master data specialist, maintaining master data activities</li> <li>Preparing orders for export operations by analyzing forecast and stock availability</li> <li>Defining stock parameterization and improving stock level, while securing high standard service level</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>University Degree either from Engineering departments or BA</li> <li>Minimum 2 years Supply Chain Experience (demand/ supply planning or Sales Forecasting)</li> <li>Ability to manage conflicting priorities while working with tight deadlines</li> <li>Strong analytical skills including the ability to distill, synthesize, and draw conclusions on large amounts of data</li> <li>Advanced excel skills</li> <li>Fluency in English is required for this role</li> <li>Exceptional verbal and written communication skills</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Flexible paid time off</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> <li>Flexible work environment through our <a target=\"_blank\" href=\"https://medium.com/blueground/blueground-nomads-program-lets-employees-optimize-their-work-setups-a641650ff35a\" rel=\"nofollow noreferrer noopener\" class=\"external\">Blueground Nomads</a> employee mobility program</li> <li>Complimentary accommodation in Blueground locations. Think summer in LA and winter in Dubai!</li> </ul><p>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/F701A6626F"
},
{
    "id": 1790556,
    "title": "Supply Planner",
    "company": "blueground",
    "department": "Design and Supply Chain",
    "location": "İstanbul",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning<p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p><p>We are looking for a <strong>Supply Planner</strong> to join our high performing <strong>Design and Supply Chain</strong> team, based in Istanbul. This role will be responsible for managing demand-supply risks and communicating effectively with stakeholders. Collaborating with city GM’s, product &amp; design team and all related parties of Supply Chain, you will ensure the required furniture are always at disposal. You will have a great understanding of the demand forecast for our markets, monitor global inventory levels and take action according to the output of this initiative. If you liked what you read and you feel you can make a difference in this role we would love to hear from you!</p><p><strong>What you will focus on:</strong></p><ul> <li>Improving supply planning systems, infrastructure, tools and methods</li> <li>Reporting, analyzing and delivering KPIs (Forecast Bias &amp; Accuracy, Supply Chain KPIs, Supplier Evaluations)</li> <li>Working arm-to-arm with Demand Planner and Procurement Team</li> <li>Identifying potential supply risks and aligning with internal customers</li> <li>Identifying risks, taking the required actions to accelerate sales and avoiding excess stock</li> <li>Creating quick action plans regarding to internal customers’ requests and supplier status</li> <li>Close follow up forecast and sustain continuous supply</li> <li>Intelligence of geographical path and transportation methods to improve supply network</li> <li>Managing the Supply Chain responsibilities in various projects</li> <li>Defining stock parameterization and improving stock level, while securing high standard service level</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>University Degree either from Engineering departments or BA</li> <li>Minimum 2 years Supply Chain Experience (demand/ supply planning or Sales Forecasting)</li> <li>Ability to manage conflicting priorities while working with tight deadlines</li> <li>Strong analytical skills including the ability to distill, synthesize, and draw conclusions on large amounts of data</li> <li>Advanced excel skills</li> <li>Fluency in English is required for this role</li> <li>Exceptional verbal and written communication skills</li> </ul><p><strong>Your Benefits:</strong></p><ul> <li>Competitive salary</li> <li>Flexible paid time off</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> </ul><ul> <li>Flexible work environment through our <a target=\"_blank\" href=\"https://medium.com/blueground/blueground-nomads-program-lets-employees-optimize-their-work-setups-a641650ff35a\" rel=\"nofollow noreferrer noopener\" class=\"external\">Blueground Nomads</a> employee mobility program</li> <li>Complimentary accommodation in Blueground locations. Think summer in LA and winter in Dubai!</li> </ul><p>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/02851ABB22"
},
{
    "id": 1791131,
    "title": "General Manager - Austin",
    "company": "blueground",
    "department": "General Management",
    "location": "Austin",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p><p>We are currently recruiting a <strong>General Manager</strong> for the recently launched market of Austin.</p><p>The GM position is one of the most exciting and impactful roles at Blueground. As the leader of Austin office and a member of Blueground’s global leadership team, you will own your P&amp;L and manage all business activities: from hiring your team, to on-boarding and marketing units, to building strong relationships with the local real estate industry. You will be responsible for launching, scaling and owning the Austin market. If you like ownership, leadership and hustling, while being very strategic and analytical in your approach, this is the right role for you.</p><p><strong>What you will focus on:</strong></p><ul> <li>Owning the P&amp;L for Blueground's Austin business</li> <li>Building and scaling a best-in-class team for real estate, operations and sales</li> <li>Defining city priorities and goals, and managing performance on a monthly and quarterly basis by setting relevant KPIs and incentive structure</li> <li>Identifying unexplored opportunities and adapting the business model to local requirements, taking into account local regulatory constraints</li> <li>Staying actively educated on Austin real estate trends to adapt and refine leasing strategy</li> <li>Shaping and sharing best practices with the rest of the network towards the constant efficiency improvement of our global operations.</li> <li>Being the face of Blueground in Austin - local PR and networking events</li> <li>Collaborating with Product, Revenue Management, Marketing, Technology and Client Experience teams to meet the needs of local market</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Relevant experience (at least 3 years) in leading teams</li> <li>Experience in launching new markets - scaling teams in a startup setup will be considered a big plus</li> <li>Entrepreneurial drive, adaptability, and focus on results</li> <li>A combination of strategic/analytical thinking and hands on mentality</li> <li>Ability to work independently, effectively and efficiently</li> <li>P&amp;L experience</li> <li>Excellent communication skills</li> <li>Demonstrated ability to lead complex operational and strategic initiatives</li> <li>Proven record of data-driven decision making</li> </ul><p><strong>Your benefits:</strong></p><li> Competitive salary</li><li> Competitive Health insurance (Medical, Dental and Vision), along with complimentary access to OneMedical and Health Advocate</li><li> Flexible paid time off</li><li> Enhanced parental leave</li><li> Dynamic working environment with talented people</li><li> Complimentary accommodation in Blueground locations. Think summer in Greece and winter in Dubai!</li><br><p><em>At Blueground we are proud to have Diversity and Inclusion at the center of everything we do. We are committed to Equal Employment Opportunity regardless of race, color, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</em></p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/80D3F2398B"
},
{
    "id": 1506237,
    "title": "Real Estate Partnerships Associate",
    "company": "blueground",
    "department": "Real Estate Partnerships/Business Development",
    "location": "Boston",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p><p>We are currently looking for a <strong>Real Estate Partnerships Associate</strong> to join our amazing<strong> Boston, MA</strong> team.</p><p>The <strong>Real Estate Partnerships Associate </strong>will help us find apartments according to Blueground specifications and standards. He/she will focus on visiting selected areas in the city to identify the right housing for on-boarding in order to grow further our business in the local market.</p><p>If you are a professional who possesses great interest in the hospitality and real estate sector, with strong research and strategic analysis skills then this role may be for you!</p><p><strong>What you will focus on:</strong></p><ul> <li>Research and source qualified properties via market investigation (real estate agencies, property adds, etc)</li> <li>Pipeline overall business growth through a combination of cold calling, email campaigns, networking and local market sector knowledge to increase supply</li> <li>Presentation of Blueground value proposition, the essence of our business and the benefits our product and services offer to landlords, real estate brokers and partners</li> <li>Communication with landlords and real estate partners, pricing negotiation and contract administration according to company procedures</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Bachelor's Degree</li> <li>A minimum of 3 years relevant working experience</li> <li>A Real Estate license will be considered as a plus but it is not obligatory</li> <li>Knowledge of the Boston Real Estate Market</li> <li>Strong communication skills and with an eye-to-detail approach</li> <li>Quick thinker and deal maker</li> <li>Passion for aesthetic housing and with home inspection ability</li> <li>Ability to work independently and take initiative</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Flexible paid time off</li> <li>Enhanced parental leave</li> <li>401k retirement plan</li> <li>Dynamic working environment with talented people</li> <li>Flexible work environment through our <a target=\"_blank\" href=\"https://medium.com/blueground/blueground-nomads-program-lets-employees-optimize-their-work-setups-a641650ff35a\" rel=\"nofollow noreferrer noopener\" class=\"external\">Blueground Nomads</a> employee mobility program</li> <li>Complimentary accommodation in Blueground locations. Think summer in Greece and winter in Dubai!</li> </ul><p><em>At Blueground we are proud to have Diversity and Inclusion at the center of everything we do. We are committed to Equal Employment Opportunity regardless of race, color, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion</em>.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/B227C93C06"
},
{
    "id": 1799961,
    "title": "Business Development Associate - Real Estate",
    "company": "blueground",
    "department": "Real Estate Partnerships/Business Development",
    "location": "London",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p><p>We are currently looking for a <strong>Business Development Associate - Real Estate</strong> to join our amazing <strong>London</strong>, UK team. The Real Estate Associate will help us lease apartments according to Blueground specifications and standards. He/she will focus on visiting selected areas in London to identify the right housing for on-boarding in order to further grow our business in the local market.</p><p>If you are a professional who possesses great interest in the hospitality and real estate sector and has a strong network of existing contacts with strong research, strategic analysis and negotiating skills with strong research and strategic analysis skills then this role may be for you!</p><p><strong>What you will focus on:</strong></p><ul> <li>Research and source qualified properties via market investigation (landlords, developers, estate agencies etc)</li> <li>Pipeline growth through a combination of networking cold calling, email campaigns and local market sector knowledge to increase supply</li> <li>Presentation of Blueground value proposition, the essence of our business and the benefits our product and services offer to landlords, estate agents and partners</li> <li>Communication with landlords and estate agents, pricing negotiation and contract administration according to company procedures</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Bachelor's Degree</li> <li>A minimum of 2 years’ experience in an estate agency or property company</li> <li>Existing network of landlords, developers and estate agents in Central London</li> <li>Knowledge of the Central London Real Estate Market</li> <li>Strong communication skills and with an eye-to-detail approach</li> <li>Quick thinker and deal maker</li> <li>Passion for aesthetic housing and with home inspection ability</li> <li>Ability to work independently and take initiative</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Flexible paid time off</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> <li>Flexible work environment through our <a target=\"_blank\" href=\"https://medium.com/blueground/blueground-nomads-program-lets-employees-optimize-their-work-setups-a641650ff35a\" rel=\"nofollow noreferrer noopener\" class=\"external\">Blueground Nomads</a> employee mobility program</li> <li>Complimentary accommodation in Blueground locations. Think summer in Greece and winter in Dubai!</li> </ul><em>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion</em>.",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/6D9C88A6BA"
},
{
    "id": 1799859,
    "title": "Operations Manager",
    "company": "blueground",
    "department": "Operations",
    "location": "Seattle",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning. What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p><p>We are currently looking for an <strong>Operations Manager</strong> to join our <strong>Seattle team</strong>. The Operations Manager position is one of the most impactful and essential roles at Blueground. As an Operations Manager, your primary focus will be the implementation, adaptation and continuous improvement of our business systems and processes in your city. You will be responsible for getting our new properties at a ready to move-in stage in a timely fashion, managing and training third-party contractors, 3pl companies and ensuring smooth operation across the team.</p><p><strong>What you will focus on:</strong></p><ul> <li>Full operational set-up and maintenance coordination of Blueground properties (furnishing, supplies, services, etc) according to brand style and guidelines</li> <li>Work with the central design team on the implementation of large design initiatives</li> <li>Style and manage the photoshoots of the new apartments to ensure spaces look perfect based on Blueground’s photoshoot guidelines</li> <li>Drive down operational costs and constantly improve processes, while upholding Blueground’s quality standards</li> <li>Liaise, manage and negotiate with contractors, vendors and external business partners ensuring that our guests enjoy high standards of client experience</li> <li>Manage the city inventory of furniture, consumables, and linens, optimizing safety stocks and reporting furniture malfunctions to the Design and Supply Chain teams</li> <li>Partner with cross-functional support teams in improving the efficiency and effectiveness of guest experience services</li> <li>Manage timely data collection to update operational metrics to achieve productivity targets, reduce cost per unit, eliminate errors, and deliver excellent customer service</li> <li>Manage the team of Operations Associates (who will assist in the set up of the apartments), by leading their onboarding process and providing continuous feedback</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>4+ years of progressive work experience preferably in the area of business operations or services in a start-up, SME or large corporation</li> <li>Bachelor's degree</li> <li>Results-oriented go-getter; great at multitasking and managing competing priorities</li> <li>Exceptional communication and organizational skills</li> <li>Significant project management experience while working under tight deadlines</li> <li>Strong analytical and problem-solving skills put to use in a fast pace environment</li> <li>Fluent in Google Suite and MS Office; experience with inventory management systems is a plus</li> <li>Guest-centric mindset</li> <li>Team player and creative thinker</li> <li>Experience in hospitality or real estate is considered a plus</li> <li>Team management experience, optimally in field operations is considered a plus</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Competitive Health insurance (Medical, Dental and Vision), along with complimentary access to OneMedical and Health Advocate</li> <li>401k retirement plan</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in Greece and winter in Dubai!</li> </ul><p>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/271A980ADE"
},
{
    "id": 1798078,
    "title": "Quality Assurance Inspector",
    "company": "blueground",
    "department": "Quality Assurance",
    "location": "San Francisco",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p><br></p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning. What drives our success is how each of our team members applies our core values. To our team, Time is everything, and we cherish it greatly. For us, Excellence isn’t simply a standard, but an exciting way to look at life. We Care deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with Transparency which we believe makes our day-to-day easier.<p>We are currently looking for a contract based <strong>Quality Assurance Inspector</strong> to join our growing team in <strong>San Francisco (South Bay Area and Oakland), CA</strong> and take care of Blueground's Product quality. The room inspector performs scheduled audits in Blueground apartments to ensure compliance of the city in charge with Blueground standards.</p><p><strong>What you will focus on:<br></strong></p><ul> <li>Conduct initial inspection audits at a sample of newly furnished apartments and exit inspection audits at a sample of checked out apartments in order to ensure the apartment’s and furniture’s perfect condition.</li> <li>Estimate and report the level of damage that may have been occurred after guests stay at our apartment</li> <li>Check and evaluate the cleaning services conducted in our properties by cleaning partners</li> <li>Highlight the actual apartment’s condition right before tenant’s check in, through the last minute QA audit</li> <li>Cooperate with QA Team Leader, providing him/her with his/her feedback (through audit reports) regarding the performance of OMs/OAs/Technicians/GRAs/cleaning teams in initial/exit inspections and cleaning sessions</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Relevant experience in the hospitality sector or in a facilities management company would be a plus</li> <li>Experience working in a Quality Assurance related position would be a plus</li> <li>Ability to conduct technical assessments for apartments</li> <li>Ability to easily commute within the city</li> <li>B.Sc/M.Sc in Quality or Engineering would be a plus</li> <li>Attention to detail </li> <li>Very good communication skills - verbal and written </li> <li>Data collection, management and analysis experience </li> <li>Excellent Planning and organizational skills</li> <li>IT Literacy (MS Office, G-Suite)</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Dynamic working environment with talented people</li> </ul><p><em>At Blueground we are proud to have Diversity and Inclusion at the center of everything we do. We are committed to Equal Employment Opportunity regardless of race, color, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion</em></p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/E6250CD80C"
},
{
    "id": 1795108,
    "title": "Office Administrator",
    "company": "blueground",
    "department": "People",
    "location": "Athens",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p><p><br>We are looking for an energetic <strong>Office Administrator</strong> to manage the daily logistics of our <strong>Athens</strong> office. Self-drive, organizational skills, resourcefulness and efficiency are the secret combo one needs to succeed in this role. The perfect match to this role loves to complete multiple high-priority tasks efficiently and gets excited with all sorts of project management tasks. Maintaining a sense of humor while having the intuition to react with appropriate urgency to emerging situations is also important. </p><br>This individual will help guide and promote the office culture and ensure the office runs smoothly. This role is critically important to the operations of our offices and thus the person who fills it needs to be a rockstar!<p><br><strong>What you will focus on:</strong></p><ul> <li>Serve as the point of contact for vendors, facilities and team members</li> <li>Perform receptionist functions, including answering and transferring calls on a multi-line telephone system, responding to routine inquiries, as well as receiving and directing clients/visitors in a friendly and professional manner</li> <li>Assist with ongoing monthly tasks including bill payments and other administrative duties to keep things running smoothly</li> <li>Facilitate daily mail collection and delivery, including distribution of packages</li> <li>Support team members with scheduling, travel arrangements</li> <li>Assist with the onboarding process </li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Recent graduate with Bachelor’s degree</li> <li>2 years of administrative or customer/operation support experience</li> <li>Well versed in MS Office Suite (Word, Excel, PPT)</li> <li>Fluent in English</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Flexible paid time off</li> <li>Group Health Insurance program</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in LA and winter in Dubai!<br> </li> </ul><p><em>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</em></p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/4CF0CBD263"
},
{
    "id": 1797774,
    "title": "Real Estate Partnerships Manager",
    "company": "blueground",
    "department": "Real Estate Partnerships/Business Development",
    "location": "Austin",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p><p>We are currently recruiting a <strong>Real Estate Partnerships Manager</strong> for our team in <strong>Austin</strong>.</p><p>The Real Estate Partnerships Manager position is one of the most exciting and impactful roles at Blueground. As a Real Estate Partnerships Manager, your primary focus will be the growth of the business⁠—a start-up company’s raison d'être⁠—in the city of Austin. You will negotiate and partner with large developers and landlords to add new properties to Blueground’s portfolio while establishing strong relationships with the local real estate industry. You will also focus on developing and executing a property acquisition strategy and growth plan. If you like ownership, hustle, negotiating while being structured and analytical in your approach, this is the right role for you.</p><p><strong>What you will focus on:</strong></p><ul> <li>Develop relationships and pitch Blueground to landlords, developers, multifamily owners and increase the size of the portfolio in line with the growth plan</li> <li>Conduct and prepare neighborhood analysis, identify locations, building types, and unit types that would be in line with Blueground standards</li> <li>Develop and maintain a network of owners, developers, and broker partners to drive the supply pipeline and selling Blueground's leasing and partnership models</li> <li>Have a comprehensive knowledge of local public policy and short term regulations</li> <li>Negotiate leases, manage closings and properties in the Boston portfolio</li> <li>Work with cross-functional teams to ensure seamless handoff from leasing signing to onboarding to operations.</li> <li>Manage relationships with owners and developers including deal structuring, ongoing correspondence, and lease compliance.</li> <li>Negotiate with developers and landlords on multiple variables to define partnership terms, creating the best win-win situation for both parties</li> <li>Recruit, coach, mentor, and manage Real Estate Partnership Associates that join the team</li> <li>Provide local perspective and work with the GM to adapt the business model as required</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Relevant experience (at least 3 years) of leadership roles in real estate, or sales related roles.</li> <li>Entrepreneurial drive, adaptability, and focus on results</li> <li>Ability to work independently and with speed</li> <li>Analytical and data-driven decision making</li> <li>Love for negotiations</li> <li>Great attention to detail to ensure contract terms have been carefully considered and agreed</li> <li>“Always be closing” mentality</li> </ul><p><strong>Your benefits:</strong><br></p><li> Competitive salary</li><li> Competitive Health insurance (Medical, Dental and Vision), along with complimentary access to OneMedical and Health Advocate</li><li> Flexible paid time off</li><li> Enhanced parental leave</li><li> Dynamic working environment with talented people</li><li> Complimentary accommodation in Blueground locations. Think summer in Greece and winter in Dubai!</li><li>Flexible work environment through our <a target=\"_blank\" href=\"https://medium.com/blueground/blueground-nomads-program-lets-employees-optimize-their-work-setups-a641650ff35a\" rel=\"nofollow noreferrer noopener\" class=\"external\">Blueground Nomads</a> employee mobility program</li><p><br></p> <p><em>At Blueground we are proud to have Diversity and Inclusion at the center of everything we do. We are committed to Equal Employment Opportunity regardless of race, color, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</em></p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/DD7873D6AF"
},
{
    "id": 1736373,
    "title": "Assistant General Counsel, Real Estate",
    "company": "blueground",
    "department": "Legal",
    "location": "New York",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p><p>We are seeking an <strong>Assistant General Counsel, Real Estate</strong> based in our <strong>New York (Remote)</strong> office to join our legal team and report directly to our General Counsel. You will be a strategic thought partner and act as a real estate and special counsel, managing all legal aspects for Blueground's real estate and core operations. Most importantly, you’ll work in an exciting and collaborative environment, surrounded by talented and motivated colleagues.</p><p><strong>What you will focus on:</strong></p><ul> <li>Draft and negotiate sophisticated lease agreements, lease amendments, letters of intent, REA documents, consent letters and other relevant real estate legal documents.</li> <li>Provide regulatory advice regarding changes in landlord-tenant laws and law impacting intermediate term housing</li> <li>Draft high priority real estate legal documents and counsels business partners on leasing and master lease agreement, revenue sharing,  joint ventures or partnership agreements.</li> <li>Manage the flow of all such documentation from inception to execution and distribution. </li> <li>Work closely with business clients throughout stages of transaction.</li> <li>Identify and assess risk to the company, recommend courses of action and develop solutions</li> <li>Interface with business units and cross-functional teams within Blueground</li> <li>Provide guidance and training to real estate junior team members</li> <li>Process confidential data and maintain complete discretion</li> <li>Direct and oversee outside counsel, if needed</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Law degree from an American Bar Association accredited law school / Must satisfy Minimum Continuing Legal Education (MCLE) requirements to maintain active license to practice law</li> <li>Minimum 3+ years’ relevant experience with a background in commercial and or residential real estate law, including lease drafting and negotiation, commercial contracts, and corporate law </li> <li>Landlord-tenant law (in particular evictions); experience in New York and California would be considered as a plus; experience with Fair Debt Collection Practices Act would be considered a plus</li> <li>Transactional experience, such as working on mergers, venture matters and/or public company reporting, is a plus</li> <li>Excellent PC skills, including Microsoft Office and Excel</li> <li>Ability to work under pressure and identify, prioritize and resolve issues quickly and independently</li> <li>Excellent communication and project management skills, with demonstrated ability to lead cross-functional initiatives</li> <li>Detail-oriented, organized, self-motivated and exhibits flexibility when it comes to roles and responsibilities</li> <li>Ability to effectively handle shifting priorities and adapt to changing demands in a fast-paced, dynamic environment</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Competitive Health insurance (Medical, Dental and Vision), along with complimentary access to OneMedical and Health Advocate</li> <li>Flexible paid time off</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in Greece and winter in Dubai!</li> </ul><p><em>At Blueground we are proud to have Diversity and Inclusion at the center of everything we do. We are committed to Equal Employment Opportunity regardless of race, color, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</em></p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/32ED34AEDD"
},
{
    "id": 1752302,
    "title": "Account Executive",
    "company": "blueground",
    "department": "Inbound Sales",
    "location": "Los Angeles",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time </strong>is everything, and we cherish it greatly. For us, <strong>Excellence </strong>isn’t simply a standard, but an exciting way to look at life. We <strong>Care </strong>deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency </strong>which we believe makes our day-to-day life easier.</p><p>We are looking to recruit an<strong> Inbound Account Executive</strong> to join our Inbound Sales team based in Los Angeles.</p><p>As member of our US Sales team you will manage inbound sales requests concerning bookings of Blueground properties for respective markets.</p><p><strong>What you will focus on:</strong></p><ul> <li>Respond to incoming property sales inquiries full cycle and handling requests (via phone, email, social tools etc) generated from all online sales channels offering clients the best accommodation solution based on their need</li> <li>Maintain an active line of communication with assigned cities local teams (GM, RE, OPS)</li> <li>Forecast sales activity and revenue (meeting and exceeding weekly, quarterly, and annual sales quotas and KPIs)</li> <li>Consistently hit capital targets such as prepayment goals</li> <li>Proactively manage the daily pipeline in our CRM</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Bachelor's degree from a top tier University</li> <li>2-5 years experience in sales or account management in the real estate sector in a quota carrying role (experience working in a B2C environment)</li> <li>Ability to run proper exploratory/discovery calls, be an active listener, manage objections and negotiation</li> <li>Ability to use and understand CRM</li> <li>Customer first mindset and closing mindset with a sense of urgency</li> <li>Coachable individual able to implement feedback</li> <li>Highly consultative, active listener, with strong objection management and negotiation skills</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Commission based on performance</li> <li>Health Insurance (medical, dental and vision plans)</li> <li>Corporate cell phone plan</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in Greece and winter in Dubai!</li> </ul><p><em>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</em></p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/C986244B51"
},
{
    "id": 1756121,
    "title": "Product Manager, Platform",
    "company": "blueground",
    "department": "Product Management",
    "location": "Athens",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p> <p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning.</p> <p>What drives our success is how each of our team members exemplifies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p> <p>We are looking for a talented <strong>Product Manager</strong> to join our growing Product Management team and support our platform product initiatives. The platform team is responsible for providing a centralized system to organize, schedule, and manage the Bluegrounders' day-to-day workflows in order to offer a delightful customer experience. The team is building the technology to:</p><ul> <li>Support all steps of our operational process from onboarding and furnishing a new property to publishing it to our website and other channels.</li> <li>Streamline the end-to-end booking experience by incorporating all booking details like payments and customer requests.</li> <li>Connect internal systems with external tools used by our teams through seamless integrations.</li> </ul><p>You will be responsible for supporting the vision, strategy, and execution of all initiatives that ensure our teams can efficiently operate and provide an amazing customer experience to our guests. This is a highly cross-functional role that is critical for the success of the company. You will be a strategic partner to department heads from several functions that define the Blueground experience, including Sales, Customer Support, Operations, Real Estate, Finance, Accounting, etc. Your goal will be to deeply understand customer needs and craft the right solutions to address them.</p><p><br></p><p><strong>What you will focus on:</strong></p><ul> <li>Support the definition of product vision, strategy, and metrics for the platform team.</li> <li>Be a strategic partner to stakeholders across departments to ensure Blueground provides the best possible customer experience.</li> <li>Develop a product roadmap and build consensus on prioritization.</li> <li>Drive product execution, partnering with a team of world-class engineers and designers, optimally trading speed of delivery and long-term thinking.</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Experience: 2+ years of product management experience. Experience with technical products is a plus.</li> <li>Product Management Leadership: support the development of a product vision, planning, and execution.</li> <li>Customer obsession: deeply understand customer needs and design solutions that delight customers.</li> <li>Intellectual curiosity: have a deep interest about the interactions of customers with our product and dive into understanding all details of the experience.</li> <li>Deliver results: envision the right outcome and put together a plan to achieve it.</li> <li>Great analytical skills: define the key metrics for your product and understand the impact of a proposed business change.</li> <li>Excellent communication: communicate complicated concepts in simple terms. Our business is international so English fluency is a must.</li> </ul><p><strong>What to expect:</strong></p><ul> <li>Agile, cross-functional, DevOps enabled teams</li> <li>An environment that continually raises its standards of work</li> <li>A rapidly growing company with top talent</li> <li>Trust and autonomy</li> <li>A learn and have fun mentality</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Flexible paid time off</li> <li>Group Health Insurance program</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in LA and winter in Dubai!</li> <li>Flexible work environment through our <a target=\"_blank\" href=\"https://medium.com/blueground/blueground-nomads-program-lets-employees-optimize-their-work-setups-a641650ff35a\" rel=\"nofollow noreferrer noopener\" class=\"external\">Blueground Nomads</a> employee mobility program</li> </ul> <p>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/728DABE40F"
},
{
    "id": 1509246,
    "title": "Senior Product Manager, Platform",
    "company": "blueground",
    "department": "Product Management",
    "location": "Athens",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p> <p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning.</p> <p>What drives our success is how each of our team members exemplifies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p> <p>We are looking for a talented <strong>Sr. Product Manager</strong> to join our growing Product Management team and lead our platform product initiatives. The platform team is responsible for providing a centralized system to organize, schedule, and manage the Bluegrounders' day-to-day workflows in order to offer a delightful customer experience. The team is building the technology to:</p><ul> <li>Support all steps of our operational process from onboarding and furnishing a new property to publishing it to our website and other channels.</li> <li>Streamline the end-to-end booking experience by incorporating all booking details like payments and customer requests.</li> <li>Connect internal systems with external tools used by our teams through seamless integrations.</li> </ul><p>You will be responsible for the vision, strategy, and execution of all initiatives that ensure our teams can efficiently operate and provide an amazing customer experience to our guests. This is a highly cross-functional role that is critical for the success of the company. You will be a strategic partner to department heads from several functions that define the Blueground experience, including Sales, Customer Support, Operations, Real Estate, Finance, Accounting, etc. Your goal will be to deeply understand customer needs and craft the right solutions to address them.</p><p><br></p><p><strong>What you will focus on:</strong></p><ul> <li>Define product vision, strategy, and metrics for the platform team.</li> <li>Be a strategic partner to stakeholders across departments to ensure Blueground provides the best possible customer experience.</li> <li>Develop a product roadmap and build consensus on prioritization.</li> <li>Drive product execution, partnering with a team of world-class engineers and designers, optimally trading speed of delivery and long-term thinking.</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Experience: 4+ years of product management experience. Experience with technical products is a plus.</li> <li>Product Management Leadership: drive a world-class vision, strategy, planning, and execution.</li> <li>Customer obsession: deeply understand customer needs and design solutions that delight customers.</li> <li>Intellectual curiosity: have a deep interest about the interactions of customers with our product and dive into understanding all details of the experience.</li> <li>Deliver results: envision the right outcome and put together a plan to achieve it.</li> <li>Great analytical skills: define the key metrics for your product and understand the impact of a proposed business change.</li> <li>Excellent communication: communicate complicated concepts in simple terms. Our business is international so English fluency is a must.</li> </ul><p><strong>What to expect:</strong></p><ul> <li>Agile, cross-functional, DevOps enabled teams</li> <li>An environment that continually raises its standards of work</li> <li>A rapidly growing company with top talent</li> <li>Trust and autonomy</li> <li>A learn and have fun mentality</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Flexible paid time off</li> <li>Group Health Insurance program</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in LA and winter in Dubai!</li> <li>Flexible work environment through our <a target=\"_blank\" href=\"https://medium.com/blueground/blueground-nomads-program-lets-employees-optimize-their-work-setups-a641650ff35a\" rel=\"nofollow noreferrer noopener\" class=\"external\">Blueground Nomads</a> employee mobility program</li> </ul> <p><br></p> <p>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/9B322044E8"
},
{
    "id": 1760035,
    "title": "Business Operations, Senior Associate",
    "company": "blueground",
    "department": "General Management",
    "location": "New York",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care </strong>deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p><p>We are looking for an experienced individual to be the first hire of the <strong>Business Operations team (Biz Ops)</strong> for our US team, based in our New York office. As a member of the Biz Ops team, you will work directly with the Deputy Head of US, and partner with leaders across different teams to drive strategic initiatives and cross-functional projects that collectively further Blueground’s mission. You will shape both where we are going and how we are getting there, focusing on areas that fall outside the daily responsibility of our business units.</p><p>It will be a highly entrepreneurial role with lots of opportunity to define where to focus the team's efforts and learn how to drive operational decision making. We anticipate adding to the team over the coming years and we will look to you to help shape how we structure the team.</p><p>The responsibilities will change based on the most pressing needs of the business at any given point in time. There are, however, a set of baseline responsibilities that you will be expected to own regularly such as the following:</p><p><br></p><strong>What you will focus on:</strong><p><br></p> <ul> <li> Lead end-to-end execution on major, cross-functional real estate initiatives on asset selection, growth and other key areas</li> <li> Manage, update and own business vitals &amp; KPIs that the US leadership team need to be aware of</li> <li> Work across teams (e.g., real estate, finance, sales, operations) to find and implement strategic initiatives which drive P&amp;L impact for the business</li> <li> Work with the business intelligence and finance teams to create necessary reporting dashboards that drive decision making</li> <li>Provide analysis and recommendations to help evaluate new revenue growth and partnership opportunities</li> <li>Monitor our external environment (e.g., market conditions, competitive pressures, regulatory landscape) and derive implications for the business</li> <li>Serve as the connective tissue across teams to drive alignment on priorities across key business functions through the OKR and strategic planning process</li> <li> Build presentations and reports that help the executive team to make decisions without having to search for the data</li> </ul><strong>What we are looking for:</strong><p><br></p> <ul> <li>3-5+ years of experience in a high growth startup, management consulting, investment banking, private equity, or similar fast-paced environment</li> <li>Proven analytical skills with the ability to translate findings and apply to project management</li> <li>Exceptional relationship-builder who works well with people from technical and business backgrounds</li> <li>Excellent communicator with the ability to influence and manage wide-scale projects across multiple levels and functions of the organization</li> <li> Exceptional critical thinking skills, being able to solve problems with practical judgment</li> <li>Incredibly organized with impeccable attention to detail</li> <li>Ability to work under pressure and identify, prioritize and resolve issues quickly and independently</li> <li>Ability to effectively handle shifting priorities and adapt to changing demands in a fast-paced, dynamic environment</li> <li>Be willing to dive into the trenches and do whatever necessary to get the ball across the line</li> </ul><strong>Your benefits:</strong><p><br></p> <ul> <li>Competitive salary</li> <li>Competitive Health insurance (Medical, Dental and Vision), along with complimentary access to OneMedical and Health Advocate</li> <li>Flexible paid time off</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in Greece and winter in Dubai!</li> <li>Flexible work environment through our <a target=\"_blank\" href=\"https://medium.com/blueground/blueground-nomads-program-lets-employees-optimize-their-work-setups-a641650ff35a\" rel=\"nofollow noreferrer noopener\" class=\"external\">Blueground Nomads</a> employee mobility program</li> </ul><p><br></p><p>At Blueground we are proud to have Diversity and Inclusion at the center of everything we do. We are committed to Equal Employment Opportunity regardless of race, color, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/B3E8F4C21F"
},
{
    "id": 1552863,
    "title": "Maintenance Specialist",
    "company": "blueground",
    "department": "Operations",
    "location": "San Jose",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p><p>We are looking for a <strong>Maintenance Specialist </strong>to join our fast growing<strong> San Francisco Bay Area</strong> team. This position will be based out of <strong>San Jose</strong>. The ideal candidate should be a stickler for detail, proactive, skilled in general maintenance tasks and thoughtful as to ensure that the property is continuously in pristine condition for our guests. The role is primary responsible for assisting our Operations Team in preparing new units, ensuring that existing units are perfect for our guests, and handling any issues or emergencies that arise. These issues include but are not limited to handling guest lockouts, emergency relocations, as well as keeping Operations Managers informed of potential repairs and actions being taken.</p><p><em>This position will require some weekend work; Tuesday to Saturday, or Sunday to Thursday.</em><br></p><p><strong>What you will mostly focus on:</strong></p><ul> <li>Assist our Operations Managers in the set-up of the units with un-boxing, furniture assembly and frames' installation</li> <li>Complete basic maintenance tasks to ensure positive guest experience</li> <li>Perform check-in/outs to our properties according to business standards</li> <li>Be the main point of contact between our guests and the customer experience team</li> <li>Supervise handyman while working on resolving an emergency in our apartments (locksmith, plumber etc.)</li> </ul><p><strong>What you may focus on:</strong></p><ul> <li>Manage viewings at Blueground properties for prospective clients or partners</li> <li>Perform messenger related duties such as collecting paperwork, delivering items, receiving mail</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Willingness to get their hands dirty as needed to achieve operational excellence</li> <li>Strong communication and interpersonal skills</li> <li>Great at handy work</li> <li>Can perform heavy lifting when needed</li> <li>Is available to work a weekend day</li> <li>Problem solver, with ability to work in a fast-paced and \"get the job done\" culture</li> <li>Hard working with great attention to detail</li> <li>Ability to multitask and remain calm under pressure</li> <li>Confident user of technology (email, slack, G suite)</li> <li>A valid driver's license and a clean driving record with no traffic violations; as well as a reliable vehicle</li> <li>A positive, confident, upbeat and friendly personality</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Market competitive salary</li> <li>Corporate cell phone plan</li> <li>Joining a fast growing start up</li> </ul><p><em>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion</em>.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/1232A2A4FB"
},
{
    "id": 1019071,
    "title": "Field Technician",
    "company": "blueground",
    "department": "Operations",
    "location": "San Jose",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, Time is everything, and we cherish it greatly. For us, Excellence isn’t simply a standard, but an exciting way to look at life. We Care deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with Transparency which we believe makes our day-to-day life easier.</p><p>We are looking for a <strong>Field Technician</strong> to join our fast growing San Francisco Bay Area team. This position will be based out of San Jose. The ideal candidate should be a stickler for detail, proactive, skilled in general maintenance tasks and thoughtful as to ensure that the property is continuously in pristine condition for our guests. The role is primary responsible for assisting our Operations Team in preparing new units, ensuring that existing units are perfect for our guests, and handling any issues or emergencies that arise. These issues include but are not limited to handling guest lockouts, emergency relocations, as well as keeping Operations Managers informed of potential repairs and actions being taken.</p><p><em>This position will require some weekend work; Tuesday to Saturday, or Sunday to Thursday.</em><br></p><p><strong>What you will mostly focus on:</strong></p><ul> <li>Assist our Operations Managers in the set-up of the units with un-boxing, furniture assembly and frames' installation</li> <li>Complete basic maintenance tasks to ensure positive guest experience</li> <li>Perform check-in/outs to our properties according to business standards</li> <li>Be the main point of contact between our guests and the customer experience team</li> <li>Supervise handyman while working on resolving an emergency in our apartments (locksmith, plumber etc.)</li> </ul><p><strong>What you may focus on:</strong></p><ul> <li>Manage viewings at Blueground properties for prospective clients or partners</li> <li>Perform messenger related duties such as collecting paperwork, delivering items, receiving mail</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Willingness to get their hands dirty as needed to achieve operational excellence</li> <li>Strong communication and interpersonal skills</li> <li>Great at handy work</li> <li>Can perform heavy lifting when needed</li> <li>Is available to work a weekend day</li> <li>Problem solver, with ability to work in a fast-paced and \"get the job done\" culture</li> <li>Hard working with great attention to detail</li> <li>Ability to multitask and remain calm under pressure</li> <li>Confident user of technology (email, slack, G suite)</li> <li>A valid driver's license and a clean driving record with no traffic violations; as well as a reliable vehicle</li> <li>A positive, confident, upbeat and friendly personality</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Market competitive salary</li> <li>Corporate cell phone plan</li> <li>Joining a fast growing start up</li> </ul><p><em>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion</em>.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/CC9F889F45"
},
{
    "id": 1778109,
    "title": "Interior Architect - Design Operations Associate",
    "company": "blueground",
    "department": "Design and Supply Chain",
    "location": "İstanbul",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning<p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p><p>We are currently looking for a talented <strong>Interior Architect - Design Operations Associate</strong> to join our <strong>Design and Supply Chain</strong> team based in Istanbul. You will be furnishing Blueground apartments globally from our Istanbul office, ensuring that our apartments meet Blueground's brand, design, and quality high standard. If this sounds exciting we'd love to hear from you, <strong><em>kindly note that only applications including a portfolio will be considered.</em></strong><br></p><p>You will be working with global teams to implement the best practices for creating a global standard in every city we operate. This is an exciting opportunity for someone who aspires to grow their knowledge and experience in design and quality assurance within a global, high-energy team.</p><p><strong>What you will focus on:<br></strong></p><ul> <li>Work as an interior designer in a global team, owning all interior design-related components of furnishing new apartments</li> <li>Work closely with Interior Design and Operations Teams leading our apartments' layout planning</li> <li>Own the quality control process and ensure interior designs meet Blueground standards</li> <li>Support the creation of Blueground apartments and communicate visual design concepts</li> <li>Regularly check our properties to ensure that the layout of the furniture is matching the design guidelines we create</li> <li>Collaborate with cross-functional teams to improve design operations</li> <li>This role will be involved in furnishing units from a large product repository in markets and decide on the exact floor plans for each unit. Imagine decorating a Manhattan unit one day to a Los Angeles condo the next</li> </ul><p><strong>What we are looking for :<br></strong></p><ul> <li>Bachelor degree in Interior Architecture from a top tier university</li> <li>Up to 2 years of experience</li> <li>Strong and effective verbal, written, and interpersonal communication skills in English </li> <li>Fluent in Turkish </li> <li>Attention to detail </li> <li>Analytical thinker and results-oriented</li> <li>Passionate about design and very organized</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Flexible paid time off</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> <li>Flexible work environment through our <a target=\"_blank\" href=\"https://medium.com/blueground/blueground-nomads-program-lets-employees-optimize-their-work-setups-a641650ff35a\" rel=\"nofollow noreferrer noopener\" class=\"external\">Blueground Nomads</a> employee mobility program</li> <li>Complimentary accommodation in Blueground locations. Think summer in LA and winter in Dubai!</li> </ul><p>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/5E01F792ED"
},
{
    "id": 1785525,
    "title": "Client Experience Coordinator",
    "company": "blueground",
    "department": "Client Experience",
    "location": "İstanbul",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 14 cities. We have raised $100m+ in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p><p>We are looking to recruit a <strong>Client Experience Coordinator</strong> based in <strong>Istanbul </strong>to join our client experience department and be responsible for our business operations in Turkey. This role is a great opportunity for a hard-working and talented person to gain a real insight into the hospitality industry. If you're someone who possesses a genuine interest in customer service, technical teams coordination and problem-solving and you like to interact with internal and external customers across the business, then this role is for you!</p><p><strong>What you will focus on:</strong></p><ul> <li>Receiving complex inquiries from guests and then deciding the right way to resolve the issues while ensuring an excellent client experience</li> <li>Scheduling, collaborating and managing internal and external business partners to ensure operational excellence in Blueground properties</li> <li>Liaising across functions within the business to identify the origin of customer support issues and improve related processes to enhance customer experience</li> <li>Maintaining long-lasting relations with business stakeholders</li> <li>Planning the daily routes of operations associates based on the number of stops, location and type of their tasks assigned, as well as customers' needs and business priorities</li> </ul><p><strong>What we are looking for:</strong></p><ul><li>Fluency in <strong>both Turkish &amp; English </strong>languages</li></ul><ul> <li>2+ years of customer service responsibilities experience and working experience in a position including back office operations, alternatively in managing housing construction projects</li> <li>Willing to work regularly <strong>on weekends</strong>, while having some on-call evening shifts on weekdays</li> <li>Computer literacy</li> <li>Great communication skills, both written and verbal</li> <li>Ability to maintain strong professional relationships with customers and business partners</li> <li>Problem-solving attitude</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Enhanced parental leave</li> <li>Group Health Insurance program</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in LA and winter in Dubai!</li> </ul><p><strong>Please submit your CV in English</strong><br></p><p><em>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</em></p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/1F65B0E56A"
},
{
    "id": 1789719,
    "title": "Talent Specialist",
    "company": "blueground",
    "department": "People",
    "location": "Austin",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time </strong>is everything, and we cherish it greatly. For us, <strong>Excellence </strong>isn’t simply a standard, but an exciting way to look at life. We <strong>Care </strong>deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency </strong>which we believe makes our day-to-day easier.</p><p>We are currently looking to bring onboard a Talent Specialist based in Austin to join our People team. We are looking for a passionate professional to join our team and help us attract and develop top talent across cities. You will focus on bringing on-board amazing people that will love our culture and embrace our values. If you are a target-driven professional, who has a passion for attracting great talent and creating an exceptional candidate experience, this is an opportunity to drive your career forward! As a Blueground talent scout, you will manage the recruitment process from end to end and collaborate with our senior leadership team to bring on board amazing people. If you like what you read, you get excited by change and understand the needs of a fast-growing company we’d love to hear from you!</p><p><strong>What you will focus on:</strong></p><ul> <li> <strong>Sourcing </strong>– be an expert in sourcing hard-to-fill positions and finding the best talent in PropTech through using innovative sourcing methods including utilizing an agile sourcing methodology across all US Cities</li> <li> <strong>Employer Branding</strong> – support on the design and creation of exciting employer branding content globally working closely with our Digital Design &amp; Communications Team to represent Blueground as a market leading mid to long term flexible housing employer of choice</li> <li> <strong>Talent Pooling</strong> – build diverse talent pools through effective targeting and talent pipelining of both passive and active candidates. You will be responsible for actively overseeing regular and accurate updates of our global job adverts, external jobs boards, recruitment networking and the promotion of our refer a friend scheme; keeping D&amp;I in mind through every part of the Talent Attraction process.</li> <li> <strong>Be a Blueground Ambassador</strong> - Get people excited about Blueground and match great talent to great opportunities. You will often be the first person that someone talks to from Blueground, so you need to be great at understanding what motivates them and match their motivations with the many benefits of working here.</li> <li> <strong>Talent Projects</strong> - Support the talent team in various global talent enablement projects like Learning &amp; Development opportunities, Talent Management &amp; Succession, Role Design and Performance Management.</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>2+ years of experience in a recruitment environment</li> <li>Tech-savvy and familiar with our tools/systems: Workable or other Applicant Tracking System, Google Suite and Slack</li> <li>Knowledge and experience of online sourcing including social/professional networking (e.g. LinkedIn Recruiter)</li> <li>Candidate experience focused, passionate about employer branding and be creative in our approach to sourcing talent</li> <li>Excellent organizational and prioritization skills, tenacious, personable and articulate</li> <li>Ability to establish trusted relationships with management, candidates and external partners</li> <li>Positive attitude combined with a desire to make work fun</li> <li>A team player that will fit with our <a href=\"https://www.theblueground.com/about\" rel=\"nofollow noreferrer noopener\" class=\"external\">values </a>and add to our culture</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Flexible Paid Time Off</li> <li>Group Healthcare Plan</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodations in Blueground locations! Think summer in Greece and winter in Dubai!</li> </ul><p><em>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</em></p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/8BE683D05B"
},
{
    "id": 1818534,
    "title": "Real Estate Portfolio Administrator - US (West Coast)",
    "company": "blueground",
    "department": "Real Estate Partnerships/Business Development",
    "location": "",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 3,500 homes in 14 cities. We have raised more than $100m+ in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p><p>We are looking for a <strong>Real Estate Portfolio Administrator </strong>based anywhere in the <strong>West Coas</strong>t in the <strong>US</strong>, to support the growth and organization of the Real Estate team. To succeed in the role, you should be committed to providing attentive support for internal parties and ensuring consistent, efficient operations. If you are a well organized, analytical person with exceptional communication and problem solving skills then this role may be for you!</p><p><strong>What you will focus on:</strong></p><ul> <li>Work with the Real Estate team on all related business activities to lease and on-boarding. units including contracting and developing the relationship to lease additional units</li> <li>Track and maintain lease negotiation correspondence and file</li> <li>Oversee renewals process for multiple markets including negotiation, tracking, etc.</li> <li>Maintain Blueground leasing and property files and enter information into company internal database</li> <li>Perform administrative duties and ensure all information is accurately entered into the company database system and g-sheets.</li> <li>Ensure accuracy with finance on rent statement and landlord invoicing</li> <li>Assist with Revenue Share Reporting</li> <li>Assist with Payments for Capital Efficient Units</li> <li>Utilities tracking and auditing</li> <li>Assist all markets with insurance (COI) requests to ensure proper coverage and address renewal as policies expire</li> <li>Assist the Real Estate Portfolio Administrator and Central Real Estate Team with the administrative side of negotiations and deals: payments, data entry, reviewing ledgers, landlord credential maintenance</li> </ul><ul> <li>Work closely with Operational Excellence to ensure RE processes effectiveness</li> <li>Work with the Product Team to optimise RE relevant information storage into our internal information system</li> <li>Establishing/improving processes for portfolio onboarding and management.</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Degree from a top-tier university</li> <li>Min. 1-2 years of experience in a similar role (residential RE or hospitality experience will be considered as a plus)</li> <li>Fluency in English</li> <li>Proficiency in Microsoft Word, Excel (formulation, data entry, charts, pivot tables) and Powerpoint</li> <li>Self-starter with a roll up your sleeves mentality</li> <li>Entrepreneurial drive, adaptability, and focus on results</li> <li>Strong quantitative and analytical skills</li> <li>Strong organizational skills with the ability to manage multiple assignments</li> <li>Excellent verbal and written communication skills</li> <li>Ability to work independently and with speed</li> <li>Attention to detail</li> </ul><p><strong>Your Benefits:</strong></p><ul> <li>Competitive salary</li> <li>Competitive Health insurance (Medical, Dental and Vision), along with complimentary access to OneMedical and Health Advocate</li> <li>401k retirement plan</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> <li>Flexible work environment through our <a href=\"https://medium.com/blueground/blueground-nomads-program-lets-employees-optimize-their-work-setups-a641650ff35a\" rel=\"nofollow noreferrer noopener\" class=\"external\">Blueground Nomads</a> employee mobility program</li> <li>Complimentary accommodation in Blueground locations. Think summer in LA and winter in Dubai!</li> </ul><em>At Blueground we are proud to have Diversity and Inclusion at the center of everything we do. We are committed to Equal Employment Opportunity regardless of race, color, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion</em>.",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/E8B9BF3D4E"
},
{
    "id": 1672481,
    "title": "Room Inspector - Contractor",
    "company": "blueground",
    "department": "Quality Assurance",
    "location": "Chicago",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning.What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day easier.<p>We are currently looking for a contract based<strong> Room Inspector</strong> to join our growing team in Chicago, IL and take care of Blueground's Product quality. The room inspector performs scheduled audits in Blueground apartments to ensure compliance of the city in charge with Blueground standards.</p><p><strong>What you will focus on:<br></strong></p><ul> <li>Conduct initial inspection audits at a sample of newly furnished apartments and exit inspection audits at a sample of checked out apartments in order to ensure the apartment’s and furniture’s perfect condition.</li> <li>Estimate and report the level of damage that may have been occurred after guests stay at our apartment</li> <li>Check and evaluate the cleaning services conducted in our properties by cleaning partners</li> <li>Highlight the actual apartment’s condition right before tenant’s check in, through the last minute QA audit</li> <li>Cooperate with QA Team Leader, providing him/her with his/her feedback (through audit reports) regarding the performance of OMs/OAs/Technicians/GRAs/cleaning teams in initial/exit inspections and cleaning sessions</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Minimum 1 year experience in Quality Control inspections</li> <li>Relevant experience in the hospitality sector or in a facilities management company would be a plus</li> <li>Experience working in a Quality Assurance related position would be a plus</li> <li>Ability to conduct technical assessments for apartments</li> <li>Ability to easily commute within the city</li> <li>B.Sc/M.Sc in Quality or Engineering would be a plus</li> <li>Attention to detail (Problem Solving)</li> <li>Very good communication skills - verbal and written (Communication)</li> <li>Data collection, management and analysis experience (Problem Solving)</li> <li>Planning and organizational skills</li> <li>IT Literacy (MS Office, G-Suite)</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Dynamic working environment with talented people</li> </ul><p><em>At Blueground we are proud to have Diversity and Inclusion at the center of everything we do. We are committed to Equal Employment Opportunity regardless of race, color, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion</em></p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/BD8BDAACC4"
},
{
    "id": 1697648,
    "title": "Account Executive, New York",
    "company": "blueground",
    "department": "Inbound Sales",
    "location": "New York",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 3,500 homes in 14 cities. We have raised $100m+ in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time </strong>is everything, and we cherish it greatly. For us, <strong>Excellence </strong>isn’t simply a standard, but an exciting way to look at life. We <strong>Care </strong>deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency </strong>which we believe makes our day-to-day life easier.</p><p><br></p><p>We are looking to recruit an <strong>Inbound Account Executive</strong> to join our Inbound Sales team based in New York City</p><p>As member of our US Sales team you will manage inbound sales requests concerning bookings of Blueground properties for respective markets.</p><p><strong>What you will focus on:</strong></p><ul> <li>Respond to incoming property sales inquiries full cycle and handling requests (via phone, email, social tools etc) generated from all online sales channels offering clients the best accommodation solution based on their need</li> <li>Maintain an active line of communication with assigned cities local teams (GM, RE, OPS)</li> <li>Forecast sales activity and revenue (meeting and exceeding weekly, quarterly, and annual sales quotas and KPIs)</li> <li>Consistently hit capital targets such as prepayment goals</li> <li>Proactively manage the daily pipeline in our CRM</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Bachelor's degree from a top tier University</li> <li>2-5 years experience in sales or account management in the real estate sector in a quota carrying role (experience working in a B2C environment)</li> <li>Ability to run proper exploratory/discovery calls, be an active listener, manage objections and negotiation</li> <li>Ability to use and understand CRM</li> <li>Customer first mindset and closing mindset with a sense of urgency</li> <li>Coachable individual able to implement feedback</li> <li>Highly consultative, active listener, with strong objection management and negotiation skills</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Commission based on performance</li> <li>Health Insurance (medical, dental and vision plans)</li> <li>Corporate cell phone plan</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in Greece and winter in Dubai!</li> </ul><p><br></p><p><em>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</em></p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/32CA722DD7"
},
{
    "id": 1615290,
    "title": "Field Technician - Seattle",
    "company": "blueground",
    "department": "Operations",
    "location": "Seattle",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p><p>We are looking for a <strong><strong>Field Technician</strong></strong> to join our fast growing <strong>Seattle team</strong>. The ideal candidate should be a stickler for detail, proactive, skilled in general maintenance tasks and thoughtful as to ensure that the property is continuously in pristine condition for our guests. The role is primary responsible for assisting our Operations Team in preparing new units, ensuring that existing units are perfect for our guests, and handling any issues or emergencies that arise. These issues include but are not limited to handling guest lockouts, emergency relocations, as well as keeping Operations Managers informed of potential repairs and actions being taken.</p><p><br></p><p><strong>What you will mostly focus on:</strong></p><ul> <li>Assist our Operations Managers in the set-up of the units with un-boxing, furniture assembly and frames' installation</li> <li>Complete basic maintenance tasks to ensure positive guest experience</li> <li>Perform check-in/outs to our properties according to business standards</li> <li>Be the main point of contact between our guests and the customer experience team</li> <li>Supervise handyman while working on resolving an emergency in our apartments (locksmith, plumber etc.)</li> </ul><p>What you may focus on:</p><ul> <li>Manage viewings at Blueground properties for prospective clients or partners</li> <li>Perform messenger related duties such as collecting paperwork, delivering items, receiving mail</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Willingness to get their hands dirty as needed to achieve operational excellence</li> <li>Great at handy work</li> <li>Can perform heavy lifting when needed</li> <li>Is available to work weekends</li> <li>Problem solver, with ability to work in a fast-paced and \"get the job done\" culture</li> <li>Hard working with great attention to detail</li> <li>Ability to multitask and remain calm under pressure</li> <li>Confident user of technology (email, slack, G suite)</li> <li>A positive, confident, upbeat and friendly personality</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Market competitive salary</li> <li>Commuting Benefit</li> <li>Corporate cell phone plan</li> <li>Joining a fast growing start up</li> </ul><p><em>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion</em>.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/6441B4B6CD"
},
{
    "id": 1707979,
    "title": "Quality Assurance Inspector - Contractor",
    "company": "blueground",
    "department": "Quality Assurance",
    "location": "Seattle",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 3,500 homes in 14 cities. We have raised more than $100m+ in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day easier.</p><p>We are currently looking for a contract based <strong>Quality Assurance Inspector</strong> to join our growing team in <strong>Seattle,WA</strong> and take care of Blueground's Product quality. The Room inspector performs scheduled audits in Blueground apartments to ensure compliance of the city in charge with Blueground standards.</p><p><strong>What you will focus on:<br></strong></p><ul> <li>Conduct initial inspection audits at a sample of newly furnished apartments and exit inspection audits at a sample of checked out apartments in order to ensure the apartment’s and furniture’s perfect condition.</li> <li>Estimate and report the level of damage that may have been occurred after guests stay at our apartment</li> <li>Check and evaluate the cleaning services conducted in our properties by cleaning partners</li> <li>Highlight the actual apartment’s condition right before tenant’s check in, through the last minute QA audit</li> <li>Cooperate with QA Team Leader, providing him/her with his/her feedback (through audit reports) regarding the performance of OMs/OAs/Technicians/GRAs/cleaning teams in initial/exit inspections and cleaning sessions</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Minimum 1 year experience in Quality Control inspections</li> <li>Relevant experience in the hospitality sector or in a facilities management company would be a plus</li> <li>Experience working in a Quality Assurance related position would be a plus</li> <li>Ability to conduct technical assessments for apartments</li> <li>Ability to easily commute within the city</li> <li>B.Sc/M.Sc in Quality or Engineering would be a plus</li> <li>Attention to detail (Problem Solving)</li> <li>Very good communication skills - verbal and written (Communication)</li> <li>Data collection, management and analysis experience (Problem Solving)</li> <li>Planning and organizational skills</li> <li>IT Literacy (MS Office, G-Suite)</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Dynamic working environment with talented people</li> </ul><p><em>At Blueground we are proud to have Diversity and Inclusion at the center of everything we do. We are committed to Equal Employment Opportunity regardless of race, color, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion</em></p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/F4962C6CF0"
},
{
    "id": 1716985,
    "title": "Senior Real Estate Partnerships Associate",
    "company": "blueground",
    "department": "Real Estate Partnerships/Business Development",
    "location": "Washington",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning.What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.<p>We are seeking a <strong>Senior</strong> <strong>Real Estate Partnerships Associate</strong> based in our <strong>Washington,</strong> <strong>DC</strong> office to help us grow our apartment portfolio in the <strong>DC</strong> area. You will focus on building our apartment supply in selected <strong>DC</strong> neighborhoods to further fuel our growth and market presence.</p><p>If you are a recent graduate or professional, that is looking for a fast-growing career within an international startup company, who possesses an interest in real estate and has strong communication, sales or business development skills, then this role may be for you!</p><p><strong>What you will focus on:</strong></p><ul> <li>Build and nurture relationships with developers, leasing managers, real estate agents/brokers, and landlords/owners</li> <li>Achieve agreed upon apartment lease targets and outcomes within schedule</li> <li>Coordinate new apartment on-boarding effort with team members and other departments</li> <li>Analyze neighborhood and building potential, and track apartment performance and lease renewals</li> <li>Prospect, qualify, research, present and close apartment opportunities with institutional and private partners</li> <li>Negotiate and structure favorable apartment lease terms</li> <li>Grow apartment supply pipeline through a combination of cold calling, email campaigns, networking, and local market sector knowledge</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Degree from a top-tier university</li> <li>At least 3 years of work experience preferably in the area of business development (real estate or construction industry experience is a plus)</li> <li>Experience outreaching and cold calling potential clients will be considered as a plus</li> <li>Solid excel skills</li> <li> Comfortable with numbers with the ability to collect and manipulate data</li> <li>Strong communication skills and ability to negotiate deals with an eye-to-detail approach</li> <li>Advanced presentation skills </li> <li>Quick thinker and deal maker</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Competitive Health insurance (Medical, Dental and Vision), along with complimentary access to OneMedical and Health Advocate</li> <li>Flexible paid time off</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> <li>Flexible work environment through our <a target=\"_blank\" href=\"https://medium.com/blueground/blueground-nomads-program-lets-employees-optimize-their-work-setups-a641650ff35a\" rel=\"nofollow noreferrer noopener\" class=\"external\">Blueground Nomads</a> employee mobility program</li> <li>Complimentary accommodation in Blueground locations. Think summer in Greece and winter in Dubai!</li> </ul><p><em>At Blueground we are proud to have Diversity and Inclusion at the center of everything we do. We are committed to Equal Employment Opportunity regardless of race, color, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion. </em></p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/303F575CAE"
},
{
    "id": 1533284,
    "title": "Operations Manager",
    "company": "blueground",
    "department": "Operations",
    "location": "Washington",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning.What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.<p>We are currently looking for an <strong>Operations Manager </strong>to join our <strong>Washington, DC</strong> team.The Operations Manager position is one of the most impactful and essential roles at Blueground. As an Operations Manager, your primary focus will be the implementation, adaptation and continuous improvement of our business systems and processes in your city. You will be responsible for getting our new properties at a ready to move-in stage in a timely fashion, managing and training third-party contractors, 3pl companies and ensuring smooth operation across the team.</p><p><strong>What you will focus on:</strong></p><ul> <li>Full operational set-up and maintenance coordination of Blueground properties (furnishing, supplies, services, etc) according to brand style and guidelines</li> <li>Work with the central design team on the implementation of large design initiatives</li> <li>Style and manage the photoshoots of the new apartments to ensure spaces look perfect based on Blueground’s photoshoot guidelines</li> <li>Drive down operational costs and constantly improve processes, while upholding Blueground’s quality standards</li> <li>Liaise, manage and negotiate with contractors, vendors and external business partners ensuring that our guests enjoy high standards of client experience</li> <li>Manage the city inventory of furniture, consumables, and linens, optimizing safety stocks and reporting furniture malfunctions to the Design and Supply Chain teams</li> <li>Partner with cross-functional support teams in improving the efficiency and effectiveness of guest experience services</li> <li>Manage timely data collection to update operational metrics to achieve productivity targets, reduce cost per unit, eliminate errors, and deliver excellent customer service</li> <li>Manage the team of Operations Associates (who will assist in the set up of the apartments), by leading their onboarding process and providing continuous feedback</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>4+ years of progressive work experience preferably in the area of business operations or services in a start-up, SME or large corporation</li> <li>Bachelor's degree</li> <li>Results-oriented go-getter; great at multitasking and managing competing priorities</li> <li>Exceptional communication and organizational skills</li> <li>Significant project management experience while working under tight deadlines</li> <li>Strong analytical and problem-solving skills put to use in a fast pace environment</li> <li>Fluent in Google Suite and MS Office; experience with inventory management systems is a plus</li> <li>Guest-centric mindset</li> <li>Team player and creative thinker</li> <li>Experience in hospitality or real estate is considered a plus</li> <li>Team management experience, optimally in field operations is considered a plus</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Competitive Health insurance (Medical, Dental and Vision), along with complimentary access to OneMedical and Health Advocate</li> <li>401k retirement plan</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in LA and winter in Dubai!</li> </ul><p>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.<br></p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/555FE69CA7"
},
{
    "id": 1709128,
    "title": "Head of Real Estate - Business Development",
    "company": "blueground",
    "department": "Real Estate Partnerships/Business Development",
    "location": "İstanbul",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighbourhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time </strong>is everything, and we cherish it greatly. For us, <strong>Excellence </strong>isn’t simply a standard, but an exciting way to look at life. We <strong>Care </strong>deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency </strong>which we believe makes our day-to-day life easier.</p><p><br></p><p>We are looking for a <strong>Head of Real Estate - Business Development</strong> to join our team in Istanbul. You will grow our apartment portfolio and you will focus on building our apartment supply in selected Istanbul neighbourhoods to further fuel our growth and market presence.</p><p>If you are a professional, that is looking for a fast-growing career within an international startup company, who possesses an interest in real estate and has strong communication, sales or business development skills, then this role may be for you!</p><p><br></p><p><strong>What you will focus on:</strong></p><ul> <li>Business strategy development and planning for the growth of the business.</li> <li>Co-developing business and implementation plans for the business travel and vacation segment</li> <li>Managing relationship with developers, property owners and real estate agents to onboard properties</li> <li>Strategical planning and financial modelling for bidding purposes and investment decisions.</li> <li>Project managing and coordinating with Operations Department for the renovation/ furnishing/ equipping of the apartments</li> <li>Co-shaping the concept/ style/ decoration of the branded apartment concept</li> <li>Travelling around Istanbul, meeting property owners and negotiating competitive deals</li> <li>Coordinating with marketing teams to promote the apartments in the different relevant channels and social media</li> <li>For mid- and long-term, scaling up the organisation and the number of apartments</li> <li>Coaching, mentoring and recruiting the right people for the BD team. </li> </ul><p><strong>What we are looking for:</strong><br></p><ul> <li>BSc and/or MSc from a top tier university abroad or in Turkey</li> <li>10+ years of work experience in finance, hospitality management, b2b sales or real estate/construction</li> <li>Experience of leading people from various backgrounds</li> <li>Fluency in English and Turkish</li> <li>Proficiency in Google Workspace (formerly G-Suites), Slack and Microsoft office tools.</li> <li>Excellent communication skills and eye for aesthetics</li> <li>Top notch negotiation skills especially in b2b space</li> <li>Energy, be strong team player and \"can get things done” attitude</li> <li>Entrepreneurial curiosity to drive change independently</li> </ul><p><strong>Your Benefits:</strong></p><ul> <li>Competitive salary</li> <li>Flexible paid time off</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in LA and winter in Dubai!</li> </ul><p><em>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</em></p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/90B01BE5F6"
},
{
    "id": 1741461,
    "title": "Real Estate - Business Development Associate",
    "company": "blueground",
    "department": "Real Estate Partnerships/Business Development",
    "location": "Vienna",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginnin.What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day easier.<p>We are seeking a <strong>Real Estate - Business Development Associate</strong> based in our <strong>Vienna</strong>, <strong>Austria</strong> office to help us grow our apartment portfolio in the area according to Blueground specifications and standards. You will focus on building our apartment supply in selected Viennese neighborhoods to further fuel our growth and market presence.</p><p>If you are a recent graduate or professional, that is looking for a fast-growing career within an international startup company, who possesses an interest in real estate and has strong communication, sales or business development skills, then this role may be for you!</p><p><strong>What you will focus on:</strong></p><ul> <li>Research and source qualified properties via market investigation (real estate agencies, property adds, etc)</li> <li>Establish B2B relationships with real estate developers and real estate funds to secure bulk deals</li> <li>Present Blueground's value proposition, the essence of our business and the benefits our product and services offer to landlords, real estate brokers and developers</li> <li>Communicate with landlords and real estate partners, negotiate prices and payments terms and administrate contracts according to company procedures</li> <li>Manage pipeline overall business growth through a combination of cold calling, email campaigns, networking and local market sector knowledge to increase supply</li> <li>Contribute to marketing efforts to expand our reach and relevance in landlord, real estate broker and developer communities</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>At least 2 years of work experience in the real estate industry </li> <li>Customer - centric mindset</li> <li>Fluency in both German and English </li> <li>Computer literate</li> <li>Strong written and verbal communication and relationship building skills (negotiation experience is a plus)</li> <li>Entrepreneurial curiosity and can do attitude suitable in a fast-growth, startup environment</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Flexible paid time off</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> <li>Flexible work environment through our <a target=\"_blank\" href=\"https://medium.com/blueground/blueground-nomads-program-lets-employees-optimize-their-work-setups-a641650ff35a\" rel=\"nofollow noreferrer noopener\" class=\"external\">Blueground Nomads</a> employee mobility program</li> <li>Complimentary accommodation in Blueground locations. Think summer in LA and winter in Dubai!</li> </ul><p><em>At Blueground we are proud to have Diversity and Inclusion at the center of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</em></p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/A40D5AE007"
},
{
    "id": 1612198,
    "title": "Operations Associate",
    "company": "blueground",
    "department": "Operations",
    "location": "Los Angeles",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning.<p>What drives our success is how each of our team members applies our core values. To our team, Time is everything, and we cherish it greatly. For us, Excellence isn’t simply a standard, but an exciting way to look at life. We Care deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with Transparency which we believe makes our day-to-day life easier.</p><p>We are looking for an <strong>Operations Associate </strong>to join our<strong> Los Angeles</strong> team. The ideal candidate should be a stickler for detail, proactive, skilled in general maintenance tasks and thoughtful as to ensure that the property is continuously in pristine condition for our guests. The role is primarily responsible for assisting our Operations Team in preparing new units, ensuring that existing units are perfect for our guests, and handling any issues or emergencies that arise. These issues include but are not limited to: guest lockouts, emergency relocations and communication to keep Operations Managers informed of potential repairs and actions being taken.</p><p><strong>This position will require some weekend and evening shifts but will not exceed a total of 40 hours/week.</strong></p><p><strong>This position requires a reliable method of transportation, as it involves commuting to and from various properties.</strong></p><p><strong>What you will mostly focus on:</strong></p><ul> <li>Assist Operations Managers in the set-up of the units with un-boxing, furniture assembly and frames' installation</li> <li>Complete basic maintenance tasks to ensure positive guest experience</li> <li>Perform check-in/outs to our properties according to business standards</li> <li>Be the main point of contact between our guests and the customer experience team</li> <li>Supervise handyman while working on resolving an emergency in our apartments (locksmith, plumber etc.)</li> </ul><p><strong>What you may focus on:</strong></p><ul> <li>Manage viewings at Blueground properties for prospective clients or partners</li> <li>Perform messenger related duties such as collecting paperwork, delivering items, receiving mail</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Willingness to get their hands dirty as needed to achieve operational excellence</li> <li>Great at handy work</li> <li>Can perform heavy lifting when needed</li> <li>Is available to work weekends</li> <li>Problem solver, with ability to work in a fast-paced and \"get the job done\" culture</li> <li>Hard working with great attention to detail</li> <li>Ability to multitask and remain calm under pressure</li> <li>Confident user of technology (email, slack, G suite)</li> <li>A positive, confident, upbeat and friendly personality</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Flexible paid time off</li> <li>Enhanced parental leave</li> <li>401k retirement plan</li> <li>Competitive Health insurance (Medical, Dental and Vision), along with complimentary access to OneMedical and Health Advocate</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in Greece and winter in Dubai!</li> </ul><p><em>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion</em>.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/9744C6B2F5"
},
{
    "id": 1751478,
    "title": "Operations Associate",
    "company": "blueground",
    "department": "Operations",
    "location": "Washington",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning.<p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p><p>We are looking for an <strong>Operations Associate</strong> to join our <strong>Washington</strong>, <strong>DC</strong> team. The ideal candidate should be a stickler for detail, proactive, skilled in general maintenance tasks and thoughtful as to ensure that the property is continuously in pristine condition for our guests. The role is primarily responsible for assisting our Operations Team in preparing new units, ensuring that existing units are perfect for our guests, and handling any issues or emergencies that arise. These issues include but are not limited to: guest lockouts, emergency relocations and communication to keep Operations Managers informed of potential repairs and actions being taken.</p><p><strong>What you will mostly focus on:</strong><br></p><ul> <li>Assist Operations Managers in the set-up of the units with un-boxing, furniture assembly and frames' installation</li> <li>Complete basic maintenance tasks to ensure positive guest experience</li> <li>Perform check-in/outs to our properties according to business standards</li> <li>Be the main point of contact between our guests and the customer experience team</li> <li>Supervise handyman while working on resolving an emergency in our apartments (locksmith, plumber etc.)</li> </ul><p><strong>What you may focus on:</strong></p><ul> <li>Manage viewings at Blueground properties for prospective clients or partners</li> <li>Perform messenger related duties such as collecting paperwork, delivering items, receiving mail</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Willingness to get their hands dirty as needed to achieve operational excellence</li> <li>Great at handy work</li> <li>Can perform heavy lifting when needed</li> <li>Is available to work weekends or evenings if needed</li> <li>Problem solver, with ability to work in a fast-paced and \"get the job done\" culture</li> <li>Hard working with great attention to detail</li> <li>Ability to multitask and remain calm under pressure</li> <li>Confident user of technology (email, slack, G suite)</li> <li>A positive, confident, upbeat and friendly personality</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Flexible paid time off</li> <li>Enhanced parental leave</li> <li>401k retirement plan</li> <li>Competitive Health insurance (Medical, Dental and Vision), along with complimentary access to OneMedical and Health Advocate</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in Greece and winter in Dubai!</li> </ul><p><em>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion</em>.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/BBAF74DDC4"
},
{
    "id": 1483707,
    "title": "Software Engineer, Front End",
    "company": "blueground",
    "department": "Engineering",
    "location": "Athens",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day easier.</p><p>We are looking for a talented <strong>Front End Engineer</strong> to join our Engineering team in Athens and our mission to offer a world class experience to our customers on the web, office based or remote.<br></p><p>We are a tech enabled company, currently making substantial investments in our technology platform, from our booking website and mobile app to our key business internal software, to enable our next stage of high growth.The person in this role will work on our web products with some of the latest tech goodies, solid engineering practices and demanding requirements on UX, analytics and performance.<br></p><p><br></p><p><strong>Our Stack</strong></p><ul> <li>ES2015+</li> <li>Node.js | Express | Koa</li> <li>MongoDB | Postgres | Redis</li> <li>RabbitMQ</li> <li>Vue.js | Angular | Vanilla.js</li> <li>Jest | WebDriver.io | Cypress.io</li> <li>RESTful APIs | gRPC </li> <li>Serverless</li> <li>GraphQL on Prisma up next</li> </ul><p>Our code sits on Github, is integrated through Jenkins pipelines and runs on AWS EKS &amp; Lambda.  We do project management on JIRA, our prototypes and mockups on Figma and monitor our systems and performance on Datadog and New Relic.</p><p><br></p><p><strong>What you'll focus on</strong></p><ul> <li>Architect, design and build product features on Blueground’s web products</li> <li>Deliver rich, responsive, mobile first experiences on the browser</li> <li>Participate in SCRUM ceremonies</li> <li>Code in Vue.js</li> <li>Write your unit tests</li> <li>Write your e2e tests</li> <li>Sometimes write your HTML &amp; CSS</li> <li>Automate stuff</li> <li>Depend on a CI pipeline</li> <li>Experiment and create rapid prototypes</li> </ul><p><br></p><p><strong>What to expect</strong></p><ul> <li>Your opinion to matter</li> <li>To work in an agile, cross functional, devops enabled team</li> <li>To work with a product designer, a product manager and an engineer in test</li> <li>To work on functional and non functional testing</li> <li>To build lots of stuff from scratch and rewrite quite as many</li> <li>To work on performance and SEO</li> <li>To move beyond frameworks and take advantage of modern browser tech</li> <li>To enjoy some quality engineering</li> <li>To get your hands on latest goodies - we’re open-minded geeks</li> <li>A rapidly growing company</li> <li>Cool colleagues :)</li> </ul><p><br></p><p><strong>Interview process</strong></p><ul> <li>Video call dialogue with People Team</li> <li>Introductory video call dialogue with one of our senior engineers</li> <li>Coding assignment (3+ working days)</li> <li>Technical Interview, 2+ hours long</li> <li>Interview with Head of engineering</li> </ul><p><em>What to expect at the technical interview?</em></p><p>You will be called to have a long discussion with your future team members. This discussion will cover many things from CS fundamentals to latest web and Javascript tech. So we encourage you to do a quick refresh on topics like data structures, algos and runtime complexity as well as core Javascript and web fundamentals. We will also try to tackle some real-world software design problems together as we do every other day. It may sound scary but it's really not. We want you to succeed.</p>",
    "requirements": "<ul> <li>2+ years of full-time industry experience working with web technologies</li> <li>Strong web fundamentals and solid understanding of the 2020's web ecosystem</li> <li>Strong Javascript skills (ES2015+)</li> <li>Strong HTML &amp; CSS skills</li> <li>An eye for good UX</li> <li>Core Web APIs like DOM, Storage, Fetch etc should not be strange to you</li> <li>Really comfortable with Git</li> <li>Excellent communication in English</li> <li>BS/MS degree in Computer Science or a related subject</li> <li>Bonus: experience doing fullstack development on Node.js</li> <li>Bonus: knowing your way around *nix shell</li> <li>Bonus: experience in software testing</li> </ul>",
    "link": "https://apply.workable.com/blueground/j/A2DD1AC3EC"
},
{
    "id": 811540,
    "title": "Software Engineer, Backend",
    "company": "blueground",
    "department": "Engineering",
    "location": "Athens",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day easier.</p><p>We are looking for a talented <strong>Backend</strong> <strong>Software Engineer </strong>to join our Engineering team in Athens and work on our business critical backend services.</p><p>We are a tech enabled company, currently making substantial investments in our technology platform, from our booking website and mobile app to our key business internal software, to enable our next stage of high growth.The person in this role will work on our backend services with a well established development methodology, a robust CI pipeline, solid engineering practices and challenging requirements (you won't get bored).</p><p><br></p><p><strong>Our Stack</strong></p><ul> <li>Kotlin  | Javascript | Typescript</li> <li>Spring Boot</li> <li>Node</li> <li>Postgres | MongoDB | Redis</li> <li>RabbitMq</li> <li>Spock | Jest | Cypress.io</li> <li>Rest | GraphQL</li> <li>Docker | AWS | k8s on EKS</li> <li>Serverless</li> </ul><p>Our code sits on Github, is integrated through Jenkins pipelines and runs on AWS EKS &amp; Lambda. We do project management on JIRA, our prototypes and mockups on Figma and monitor our systems and performance on Datadog and New Relic.</p><p><br></p><p><strong>What you'll do</strong></p><ul> <li>Architect, design and build our internal platform and tools</li> <li>Participate in SCRUM ceremonies</li> <li>Code services and APIs</li> <li>Write your unit tests</li> <li>Write your e2e tests (functional &amp; performance)</li> <li>Automate stuff. Like a lot.</li> <li>Be religious with Git</li> <li>Depend on a CI pipeline</li> <li>Experiment, learn and have fun</li> </ul><p><br></p><p><strong>What to expect</strong></p><ul> <li>To work in agile, cross functional, DevOps enabled teams</li> <li>To work with a product manager and an engineer in test</li> <li>To work on functional and non functional testing</li> <li>To work on performance</li> <li>To get your head around a quite big problem domain</li> <li>To solve hard problems</li> <li>To enjoy some quality engineering</li> <li>A rapidly growing company</li> <li>Opportunities to do full stack or go polyglot if interested (e.g. Python or Go)</li> <li>Cool colleagues :)</li> </ul><p><br></p><p><strong>Interview process</strong></p><ul> <li>Video call dialogue with People Team</li> <li>Introductory video call dialogue with one of our senior engineers</li> <li>Coding assignment (3+ working days)</li> <li>Technical Interview, 2+ hours long</li> <li>Interview with Head of engineering</li> </ul><p>What to expect at the technical interview?</p><p>You will be called to have a long discussion with your future team members. This discussion will cover many things from CS fundamentals to latest coding trends. So we encourage you to do a quick refresh on topics like data structures, algos and runtime complexity as well as core concepts of your primary language (e.g. Java or Python). We will also try to tackle some real-world software design problems together as we do every other day. It may sound scary but it's really not. We want you to succeed.</p>",
    "requirements": "<ul> <li> <strong>Industry experience</strong> in software development</li> <li>Strong <strong>CS background</strong> </li> <li>Strong skills in one of Kotlin, Java, Python, Ruby, Javascript</li> <li>Strong background in relational databases and<strong> SQL</strong> </li> <li>Good knowledge of the <strong>Spring framework</strong> &amp; the <strong>JEE</strong> platform is a plus</li> <li>Experience in designing <strong>REST</strong> APIs</li> <li> <strong>Testing</strong> mindset and an eye for<strong> clean code</strong> </li> <li>Really comfortable with <strong>Git</strong> </li> <li>Excellent communication in English</li> <li>BS/MS degree in Computer Science or a related subject</li> <li>Bonus: experience with other JVM languages like <strong>Groovy</strong> or <strong>Kotlin</strong> </li> <li>Bonus: knowing your way around the <strong>*nix shell</strong> </li> <li>Bonus: experience with <strong>NoSQL </strong>storage (Redis, Elastic, MongoDB)</li> <li>Bonus: experience with<strong> binary APIs </strong>(Protocol Buffers, Avro etc)</li> </ul>",
    "link": "https://apply.workable.com/blueground/j/C28D606B1E"
},
{
    "id": 1675181,
    "title": "Account Executive - Portal Partnerships (REMOTE)",
    "company": "blueground",
    "department": "Inbound Sales",
    "location": "Los Angeles",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time </strong>is everything, and we cherish it greatly. For us, <strong>Excellence </strong>isn’t simply a standard, but an exciting way to look at life. We <strong>Care </strong>deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency </strong>which we believe makes our day-to-day life easier.</p><p><br></p><p>We are looking to recruit an <strong>Account Executive - Portal Partnerships</strong> to work remotely on the west coast and join our Inbound Sales function. As member of our US Sales team you will manage inbound sales requests concerning bookings of Blueground properties for all US markets.</p><p><strong>What you will focus on:</strong></p><ul> <li>Respond and handle sales inquiries full cycle (via Portal Partnerships such as Airbnb/VRBO, phone, email, social tools, etc.) offering clients the best accommodation solution based on their need</li> <li>Maintain an active line of communication with assigned cities local teams (General Manager, Real Estate, Operations)</li> <li>Forecast sales activity and revenue (meeting and exceeding weekly, quarterly, and annual sales quotas and KPIs)</li> <li>Proactively manage your sales pipeline in our CRM (SalesForce)</li> <li>Weekends are required</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Bachelor's degree</li> <li>1-3 years experience in sales or account management in a quota carrying role (experience working in a B2C environment)</li> <li>Ability to run proper exploratory/discovery calls, be an active listener, manage objections and negotiation</li> <li>Customer first mindset and closing mindset with a sense of urgency</li> <li>Comfortable woking in a fast paced environment</li> <li>Use and understand our CRM</li> <li>Coachable individual able to implement feedback</li> <li>Highly consultative, active listener, with strong objection management and negotiation skills</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>401K plan</li> <li>Health Insurance (medical, dental and vision plans)</li> <li>Corporate cell phone plan</li> <li>Parental leave</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in Greece and winter in Dubai!</li> </ul><p><br></p><p><br></p><p><em>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</em></p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/EFBFE63659"
},
{
    "id": 1825026,
    "title": "General Manager",
    "company": "blueground",
    "department": "General Management",
    "location": "Berlin",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 14 cities. We have raised $100m+ in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time </strong>is everything, and we cherish it greatly. For us, <strong>Excellence </strong>isn’t simply a standard, but an exciting way to look at life. We <strong>Care </strong>deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency </strong>which we believe makes our day-to-day easier.</p><p>We are looking for a <strong>General Manager</strong> for our imminent launch in the city of <strong>Berlin</strong>.</p><p>The GM position is one of the most exciting and impactful roles at Blueground. As the leader of Berlin office and a member of Blueground’s global leadership team, you will own your P&amp;L and manage all business activities: from hiring your team, to on-boarding and marketing units, to building strong relationships with the local real estate industry. You will be responsible for launching, scaling and owning the Berlin market. If you like ownership, leadership and hustling, while being very strategic and analytical in your approach, this is the right role for you.</p><p><strong>What you will focus on:</strong></p><ul> <li>Owning the P&amp;L for Blueground's Berlin's business</li> <li>Building and scaling a best-in-class team for real estate, operations and sales</li> <li>Defining city priorities and goals, and managing performance on a monthly and quarterly basis by setting relevant KPIs and incentive structure</li> <li>Identifying unexplored opportunities and adapting the business model to local requirements, taking into account potential regulatory constraints</li> <li>Staying actively educated on Berlin's real estate trends to adapt and refine leasing strategy</li> <li>Shaping and sharing best practices with the rest of the network towards the constant efficiency improvement of our global operations.</li> <li>Being the face of Blueground in Berlin - local PR and networking events</li> <li>Collaborating with Product, Revenue Management, Marketing, Technology and Client Experience teams to meet the needs of local market</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Relevant experience (at least 5 years) in leadership roles and ideally managing own P&amp;L and building a high-performing team</li> <li>Entrepreneurial drive, adaptability, and focus on results</li> <li>Ability to work independently, effectively and efficiently</li> <li>Demonstrated ability to lead complex operational and strategic initiatives</li> <li>Analytical and data-driven decision making</li> <li>A team player that will fit with our <a href=\"https://www.theblueground.com/about\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">values</a> and add to our culture</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Discretionary annual bonus scheme</li> <li>Stock options plan</li> <li>Flexible paid time off</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in LA and winter in Dubai</li> </ul><p><em>At Blueground we are proud to have Diversity and Inclusion at the center of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</em></p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/BA09586CA8"
},
{
    "id": 1812259,
    "title": "Photographer",
    "company": "blueground",
    "department": "Photography",
    "location": "Boston",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 4,000 homes in 15 cities. We have raised more than $100m+ in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p><p>We are looking to recruit a talented <strong>Photographer</strong> to join our Photography function. As a member of our Photography team, you will be responsible for all our apartment photo shoots and other relative tasks, happening in <strong>Boston and Washington D.C </strong>. This position is an exciting opportunity for someone who’s highly ambitious and passionate about interior photography while being on the forefront of tech and advertising.</p><p><strong>Main responsibilities include:</strong></p><ul> <li>Shoot  photos and 3d tour scans on our apartments in Boston and Washington D.C.  to meet the Blueground standards.</li> <li>Organize the shootings along with the operations team for the two cities in a time efficient way.</li> <li>Plan and shoot the common areas of the buildings &amp; neighborhoods </li> <li>Get involved in creative projects for marketing campaigns</li> <li>Assist in the pre-photo shooting apartment setup Continuously find ways to improve shooting methods &amp; team processes through workshops etc.</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Excellent photography skills with at least 1-year photography experience</li> <li>Excellent communication skills and a team player</li> <li>Very good in prioritizing tasks and organizing your work</li> <li>Eager to learn new techniques and provide feedback</li> <li>Self - motivated with attention to detail</li> <li>Basic understanding of Microsoft Excel/Gsheets</li> <li>Real estate photography experience will be considered as a plus</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Flexible paid time off</li> <li>Enhanced parental leave</li> <li>On the job training</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in Greece and winter in Dubai!</li> </ul><p><em>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, color, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</em></p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/A63CC0C003"
}
]