[
{
    "id": 1612198,
    "title": "Operations Associate",
    "company": "blueground",
    "department": "Operations",
    "location": "Los Angeles",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 3,500 homes in 12 cities. We have raised more than $80m in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, Time is everything, and we cherish it greatly. For us, Excellence isn’t simply a standard, but an exciting way to look at life. We Care deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with Transparency which we believe makes our day-to-day life easier.</p><p>We are looking for an <strong>Operations Associate</strong> to join our<strong> Los Angeles</strong> team. The ideal candidate should be a stickler for detail, proactive, skilled in general maintenance tasks and thoughtful as to ensure that the property is continuously in pristine condition for our guests. The role is primary responsible for assisting our Operations Team in preparing new units, ensuring that existing units are perfect for our guests, and handling any issues or emergencies that arise. These issues include but are not limited to: guest lockouts, emergency relocations and communication to keep Operations Managers informed of potential repairs and actions being taken.</p><p><strong>This position will require some weekend and evening shifts but will not exceed a total of 40 hours/week.</strong></p><p><strong>This position requires a reliable method of transportation, as it involves commuting to and from various properties.</strong></p><p><strong>What you will mostly focus on:</strong></p><ul> <li>Assist Operations Managers in the set-up of the units with un-boxing, furniture assembly and frames' installation</li> <li>Complete basic maintenance tasks to ensure positive guest experience</li> <li>Perform check-in/outs to our properties according to business standards</li> <li>Be the main point of contact between our guests and the customer experience team</li> <li>Supervise handyman while working on resolving an emergency in our apartments (locksmith, plumber etc.)</li> </ul><p><strong>What you may focus on:</strong></p><ul> <li>Manage viewings at Blueground properties for prospective clients or partners</li> <li>Perform messenger related duties such as collecting paperwork, delivering items, receiving mail</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Willingness to get their hands dirty as needed to achieve operational excellence</li> <li>Great at handy work</li> <li>Can perform heavy lifting when needed</li> <li>Is available to work weekends</li> <li>Problem solver, with ability to work in a fast-paced and \"get the job done\" culture</li> <li>Hard working with great attention to detail</li> <li>Ability to multitask and remain calm under pressure</li> <li>Confident user of technology (email, slack, G suite)</li> <li>A positive, confident, upbeat and friendly personality</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Flexible paid time off</li> <li>Enhanced parental leave</li> <li>401k retirement plan</li> <li>Private life and health insurance plan</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in Greece and winter in Dubai!</li> </ul><p><em>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion</em>.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/9744C6B2F5"
},
{
    "id": 1615290,
    "title": "Maintenance Technician - Seattle",
    "company": "blueground",
    "department": "Operations",
    "location": "Seattle",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 3,500 homes in 13 cities. We have raised more than $80m in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p><p>We are looking for a <strong><strong>Maintenance Technician</strong></strong> to join our fast growing <strong>Seattle team</strong>. The ideal candidate should be a stickler for detail, proactive, skilled in general maintenance tasks and thoughtful as to ensure that the property is continuously in pristine condition for our guests. The role is primary responsible for assisting our Operations Team in preparing new units, ensuring that existing units are perfect for our guests, and handling any issues or emergencies that arise. These issues include but are not limited to handling guest lockouts, emergency relocations, as well as keeping Operations Managers informed of potential repairs and actions being taken.</p><p><br></p><p><strong>What you will mostly focus on:</strong></p><ul> <li>Assist our Operations Managers in the set-up of the units with un-boxing, furniture assembly and frames' installation</li> <li>Complete basic maintenance tasks to ensure positive guest experience</li> <li>Perform check-in/outs to our properties according to business standards</li> <li>Be the main point of contact between our guests and the customer experience team</li> <li>Supervise handyman while working on resolving an emergency in our apartments (locksmith, plumber etc.)</li> </ul><p>What you may focus on:</p><ul> <li>Manage viewings at Blueground properties for prospective clients or partners</li> <li>Perform messenger related duties such as collecting paperwork, delivering items, receiving mail</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Willingness to get their hands dirty as needed to achieve operational excellence</li> <li>Great at handy work</li> <li>Can perform heavy lifting when needed</li> <li>Is available to work weekends</li> <li>Problem solver, with ability to work in a fast-paced and \"get the job done\" culture</li> <li>Hard working with great attention to detail</li> <li>Ability to multitask and remain calm under pressure</li> <li>Confident user of technology (email, slack, G suite)</li> <li>A positive, confident, upbeat and friendly personality</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Market competitive salary</li> <li>Commuting Benefit</li> <li>Corporate cell phone plan</li> <li>Joining a fast growing start up</li> </ul><p><em>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion</em>.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/6441B4B6CD"
},
{
    "id": 1614575,
    "title": "Senior Tax Manager",
    "company": "blueground",
    "department": "Finance",
    "location": "Athens",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p> <p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 3,500 homes in 13 cities. We have raised $100m+ in funding to date and that’s just the beginning. But enough of the numbers.</p> <p>What drives our success is how each of our team members exemplifies our core values. To our team, <strong>Time </strong>is everything, and we cherish it greatly. For us, <strong>Excellence </strong>isn’t simply a standard, but an exciting way to look at life. We <strong>Care </strong>deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency </strong>which we believe makes our day-to-day easier.</p><p><br></p><p>We are looking for an independent and result-oriented <strong>Senior Tax Manager</strong> who will report to the CFO. Ideally, you will have experience working in international tax and transfer pricing within a fast-paced environment. You will ensure the Tax function at Blueground is structured to enable the company to continue growing in a fast but controlled and tax-optimized manner. Leading the build up of the Tax team you will provide vision and ideas, and will tackle any problem that may arise as well as have the ability to roll your sleeves up and get involved.</p><p><strong>What you will focus on:</strong></p><ul> <li>Ensuring the effective operation of the tax function across all locations</li> <li>Identifying ongoing and emerging tax risks, mitigating where possible</li> <li>Managing the overall effective tax rate / loss of the group</li> <li>Provide / manage provision of accurate tax advice to key stakeholders</li> <li>Implement appropriate control frameworks and policies</li> <li>Implement and manage the groups transfer pricing policy and methodology</li> <li>Ensure compliance with all regulations and filing requirements</li> <li>Building relationships with appropriate tax authorities</li> <li>Build and evelop the tax team, including recruitment, setting goals and managing individuals and team performance</li> <li>Build relationships with the various functional business heads, overseas offices, tax offices and professional advisory firms to ensure a cohesive approach to managing tax issues</li> <li>Provide advisory and tax input to group wide projects</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Qualified tax professional, at least 5 years senior experience</li> <li>Extensive technical knowledge of corporate, payroll, indirect and international tax</li> <li>Solid analytical skills and a ‘hands on’ attitude</li> <li>Strong people skills and ability to coordinate project teams</li> <li>Experience within a fast-growing organization</li> <li>Highly motivated, focused on delivery</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Opportunity to add your own signature to the success of Blueground</li> <li>Competitive salary and bonus package</li> <li>Dynamic working environment with talented people</li> <li>Flexible paid time off</li> <li>Group Health Insurance program</li> <li>Complimentary accommodation in Blueground locations. Think summer in LA and winter in Dubai!</li> </ul><p><br></p><p><em>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</em></p> <p><br></p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/B73EE49C83"
},
{
    "id": 1626847,
    "title": "SEO Manager",
    "company": "blueground",
    "department": "SEO",
    "location": "Athens",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 3,500 homes in 13 cities. We have raised more than $80m in funding to date and that’s just the beginning. But enough of the numbers.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day easier.</p><p>We are looking for a bright, highly motivated, strategic <strong>SEO Manager</strong> to join our growing Marketing team. This is a highly visible role that requires you to be resourceful, creative and persistent to make Blueground an SEO-first marketing organization.</p><p>This role will be responsible for crafting and executing our SEO roadmap. Working to identify key opportunities, ensure strong performance, and oversee all technical SEO programs and requirements. </p><p>This is a position for someone who is obsessed with SEO and wants to reshape the definition of “industry best practices.”  The right candidate thrives in a fast-paced dynamic environment, possesses strong communication skills and is quick to take initiative.</p><p><strong>What you will focus on:</strong></p><ul> <li>Use on-page &amp; off-page strategies to drive high-volume organic traffic and related conversions against monthly targets for each of our markets </li> <li>Pro-actively seek opportunities to improve site architecture, content and navigation based on SEO analytics insights as well as industry best practices </li> <li>Lead technical SEO initiatives and own related technical requirements for product and marketing initiatives</li> <li>Oversee SEO best practices and adoption by core cross-functional teams, including content marketing, engineering, creative, Product Marketing teams</li> <li>Work closely with the social and content teams to ensure SEO considerations are being taken into account and maximized</li> <li>Work closely with the PPC team to understand the relationship between SEO and PPC and advise on the best strategy for driving incremental search traffic and revenue</li> <li>Stay up-to-date with developments and generate new ideas to draw audience’s attention across online marketing. (ie. search, social, blogging)</li> <li>Utilize analytics and other tools to track the effectiveness of web content for search engine optimization and user engagement</li> <li>Collaborate with the broader SEO team to elevate the practice and be seen as industry best-in-class</li> <li>Provide thought leadership on search technology and search industry changes, gaining a deep knowledge of desktop, mobile and social search</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>6+ years of professional experience overall</li> <li>3+ years of professional experience in SEO (preferably in-house SEO in e-commerce / online retail), with a proven track record of successfully developing and implementing SEO programs and significantly improving Organic Search performance for online businesses</li> <li>Extensive knowledge of SEO best practices (technical, content optimization and link building), search engine algorithms and ranking strategies, and passion to stay abreast of news and trends in SEO and online marketing</li> <li>Experience implementing successful large-scale SEO initiatives, including external link acquisition, site architecture, and international localization</li> <li>Ability to work cross-functionally with content, design, communications and product teams to drive SEO programs forward in a highly-effective manner</li> <li>Understanding of critical SEO analytics and research platforms </li> <li>Bachelor's degree in a related field</li> </ul><p>Nice to have:</p><ul> <li>Experience in popular CMS and web frameworks and their strengths and weaknesses</li> <li>Understanding of dynamic content – query strings, client-side serving</li> <li>Experience in server side language (PHP)</li> <li>Experience working with JavaScript and Ajax single page web applications (e.g. Angular JS, React JS)</li> <li>Familiar with server behaviour and HTTP protocols (e.g. server response codes, redirects)</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Flexible paid time off</li> <li>Group Health Insurance program</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in LA and winter in Dubai!</li> </ul><p>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</p><p></p><p><br></p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/68358170CD"
},
{
    "id": 1552863,
    "title": "Maintenance Specialist (Contract to Hire)",
    "company": "blueground",
    "department": "Operations",
    "location": "San Jose",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 3,500 homes in 14 cities. We have raised more than $80m in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p><p>We are looking for a <strong>Maintenance Specialist </strong>to join our fast growing<strong> San Francisco Bay Area</strong> team. This position will be based out of <strong>San Jose</strong>. The ideal candidate should be a stickler for detail, proactive, skilled in general maintenance tasks and thoughtful as to ensure that the property is continuously in pristine condition for our guests. The role is primary responsible for assisting our Operations Team in preparing new units, ensuring that existing units are perfect for our guests, and handling any issues or emergencies that arise. These issues include but are not limited to handling guest lockouts, emergency relocations, as well as keeping Operations Managers informed of potential repairs and actions being taken.</p><p><em>This is a contract to hire position. This position will require some weekend work; Tuesday to Saturday, or Sunday to Thursday.</em><br></p><p><strong>What you will mostly focus on:</strong></p><ul> <li>Assist our Operations Managers in the set-up of the units with un-boxing, furniture assembly and frames' installation</li> <li>Complete basic maintenance tasks to ensure positive guest experience</li> <li>Perform check-in/outs to our properties according to business standards</li> <li>Be the main point of contact between our guests and the customer experience team</li> <li>Supervise handyman while working on resolving an emergency in our apartments (locksmith, plumber etc.)</li> </ul><p><strong>What you may focus on:</strong></p><ul> <li>Manage viewings at Blueground properties for prospective clients or partners</li> <li>Perform messenger related duties such as collecting paperwork, delivering items, receiving mail</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Willingness to get their hands dirty as needed to achieve operational excellence</li> <li>Strong communication and interpersonal skills</li> <li>Great at handy work</li> <li>Can perform heavy lifting when needed</li> <li>Is available to work a weekend day</li> <li>Problem solver, with ability to work in a fast-paced and \"get the job done\" culture</li> <li>Hard working with great attention to detail</li> <li>Ability to multitask and remain calm under pressure</li> <li>Confident user of technology (email, slack, G suite)</li> <li>A valid driver's license and a clean driving record with no traffic violations; as well as a reliable vehicle</li> <li>A positive, confident, upbeat and friendly personality</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Market competitive salary</li> <li>Corporate cell phone plan</li> <li>Joining a fast growing start up</li> </ul><p><em>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion</em>.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/1232A2A4FB"
},
{
    "id": 1552858,
    "title": "Operations Associate (Contract to hire)",
    "company": "blueground",
    "department": "Operations",
    "location": "San Jose",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 3,500 homes in 14 cities. We have raised more than $80m in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p><p>We are looking for an <strong>Operations Associate</strong> to join our fast growing<strong> San Francisco Bay Area</strong> team. This position will be based out of <strong>San Jose</strong>. The ideal candidate should be a stickler for detail, proactive, skilled in general maintenance tasks and thoughtful as to ensure that the property is continuously in pristine condition for our guests.The role is primary responsible for assisting our Operations Team in preparing new units, ensuring that existing units are perfect for our guests, and handling any issues or emergencies that arise.These issues include but are not limited to handling guest lockouts, emergency relocations, as well as keeping Operations Managers informed of potential repairs and actions being taken.</p><p><em>This is a contract to hire position. This position will require some weekend work; Tuesday to Saturday, or Sunday to Thursday.  </em></p><p><strong>What you will mostly focus on:</strong></p><ul> <li>Assist our Operations Managers in the set-up of the units with un-boxing, furniture assembly and frames' installation</li> <li>Complete basic maintenance tasks to ensure positive guest experience</li> <li>Perform check-in/outs to our properties according to business standards</li> <li>Be the main point of contact between our guests and the customer experience team</li> <li>Supervise handyman while working on resolving an emergency in our apartments (locksmith, plumber etc.)</li> </ul><p><strong>What you may focus on:</strong></p><ul> <li>Manage viewings at Blueground properties for prospective clients or partners</li> <li>Perform messenger related duties such as collecting paperwork, delivering items, receiving mail</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Willingness to get their hands dirty as needed to achieve operational excellence</li> <li>Strong communication and interpersonal skills</li> <li>Great at handy work</li> <li>Can perform heavy lifting when needed</li> <li>Is available to work a weekend day</li> <li>Problem solver, with ability to work in a fast-paced and \"get the job done\" culture</li> <li>Hard working with great attention to detail</li> <li>Ability to multitask and remain calm under pressure</li> <li>Confident user of technology (email, slack, G suite)</li> <li>A valid driver's license and a clean driving record with no traffic violations; as well as a reliable vehicle</li> <li>A positive, confident, upbeat and friendly personality</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Market competitive salary</li> <li>Corporate cell phone plan</li> <li>Joining a fast growing start up</li> </ul><p><em>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion</em>.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/3F21F50FE6"
},
{
    "id": 1019071,
    "title": "Maintenance Technician (contract to hire)",
    "company": "blueground",
    "department": "Operations",
    "location": "San Jose",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 3,500 homes in 14 cities. We have raised more than $80m in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, Time is everything, and we cherish it greatly. For us, Excellence isn’t simply a standard, but an exciting way to look at life. We Care deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with Transparency which we believe makes our day-to-day life easier.</p><p>We are looking for a <strong>Maintenance Technician</strong> to join our fast growing San Francisco Bay Area team. This position will be based out of San Jose. The ideal candidate should be a stickler for detail, proactive, skilled in general maintenance tasks and thoughtful as to ensure that the property is continuously in pristine condition for our guests. The role is primary responsible for assisting our Operations Team in preparing new units, ensuring that existing units are perfect for our guests, and handling any issues or emergencies that arise. These issues include but are not limited to handling guest lockouts, emergency relocations, as well as keeping Operations Managers informed of potential repairs and actions being taken.</p><p><em>This is a contract to hire position. This position will require some weekend work; Tuesday to Saturday, or Sunday to Thursday.</em><br></p><p><strong>What you will mostly focus on:</strong></p><ul> <li>Assist our Operations Managers in the set-up of the units with un-boxing, furniture assembly and frames' installation</li> <li>Complete basic maintenance tasks to ensure positive guest experience</li> <li>Perform check-in/outs to our properties according to business standards</li> <li>Be the main point of contact between our guests and the customer experience team</li> <li>Supervise handyman while working on resolving an emergency in our apartments (locksmith, plumber etc.)</li> </ul><p><strong>What you may focus on:</strong></p><ul> <li>Manage viewings at Blueground properties for prospective clients or partners</li> <li>Perform messenger related duties such as collecting paperwork, delivering items, receiving mail</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Willingness to get their hands dirty as needed to achieve operational excellence</li> <li>Strong communication and interpersonal skills</li> <li>Great at handy work</li> <li>Can perform heavy lifting when needed</li> <li>Is available to work a weekend day</li> <li>Problem solver, with ability to work in a fast-paced and \"get the job done\" culture</li> <li>Hard working with great attention to detail</li> <li>Ability to multitask and remain calm under pressure</li> <li>Confident user of technology (email, slack, G suite)</li> <li>A valid driver's license and a clean driving record with no traffic violations; as well as a reliable vehicle</li> <li>A positive, confident, upbeat and friendly personality</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Market competitive salary</li> <li>Corporate cell phone plan</li> <li>Joining a fast growing start up</li> </ul><p><em>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion</em>.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/CC9F889F45"
},
{
    "id": 1634753,
    "title": "Accounting Associate",
    "company": "blueground",
    "department": "Accounting",
    "location": "Athens",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 3,500 homes in 14 cities. We have raised more than $80m in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p><p>We are looking for an ambitious <strong>Accounting Associate</strong> based in <strong>Athens</strong>, to provide support to the Accounting department of Blueground US by managing daily accounting tasks. The Accounting Associate will be part of a team of professionals working to maintain order and transparency of the company’s finances. By contributing to the overall efficient operation of the department and by helping the company be fully aware of its financial condition, this role can help the company make the right decisions and accomplish long term success. The ideal candidate should be able to work comfortably with numbers and have great attention to detail.</p><p><strong>What you will focus on:</strong></p><ul> <li>Post and process journal entries to ensure all business transactions are recorded</li> <li>Update accounts payable, A/P master data, and perform reconciliations</li> <li>Ensure proper application of controls in A/P processes </li> <li>Assist in the monthly/annual preparation of the balance sheet, income statement and other financial reports according to IFRS and internal accounting guidelines</li> <li>Assist in assessing current processes in terms of efficiency</li> <li>Assist with other accounting projects and/or ad hoc projects.</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>BSc or Ba in Accounting, Finance or relevant field</li> <li>Successful basic experience coming from a similar position within an accounting firm or in house accounting department</li> <li>Understanding of accounting principles and reporting practices</li> <li>Basic experience on establishing controls </li> <li>Fluency in English</li> <li>Excellent knowledge of MS Office</li> <li>Excellent organisational skills</li> <li>Excellent communication skills</li> <li>Attention to detail</li> <li>Numbers driven individual with analytical acumen</li> <li>Familiarity with Navision 365 accounting software will be considered as a plus</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Flexible paid time off</li> <li>Group Health Insurance program</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in LA and winter in Dubai!</li> </ul><p>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/1D254F9D90"
},
{
    "id": 1618754,
    "title": "Digital Design Intern",
    "company": "blueground",
    "department": "Marketing",
    "location": "Athens",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p> <p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 3,500 homes in 14 cities. We have raised more than $80m in funding to date and that’s just the beginning. But enough of the numbers.</p> <p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day easier.</p> <p>We are looking for a <strong>Digital Design Intern</strong> to join our Athens Design team for at least 3 months. </p> <ul> <li>Main responsibilities include but are not limited to: </li> <li>Design digital marketing material, such as digital campaigns and web pages</li> <li>Design print material for both marketing and internal use, such as brochures, presentations, brand collateral etc.</li> <li>Design social media content as well as the company’s blogs</li> <li>Assist a growing team of creative professionals to achieve excellence in designing the company’s digital products, such as the corporate website and mobile application</li> </ul> <p>What we are looking for:</p><ul> <li>Recent graduate/final year digital, graphic or UI/UX design student </li> <li>Fluent in English </li> <li>Attention to Detail</li> <li>Basic Knowledge of Figma, Adobe Photoshop,Illustrator or Indesign will be considered a plus</li> </ul> <p>Your benefits:</p><ul> <li>Paid Internship</li> <li>Flexible working hours and opportunity to manage own schedule</li> <li>Dynamic working environment with talented people</li> <li>A strong coaching and mentoring culture supporting fast paced professional self-development</li> <li>Opportunity to take initiative and define own priorities</li> <li>Opportunity to grow alongside the company </li> </ul> <p>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/B97E460852"
},
{
    "id": 1577893,
    "title": "Global Social Media & Influencer Marketing Manager - USA Remote",
    "company": "blueground",
    "department": "Marketing",
    "location": "Chicago",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 3,500 homes in 14 cities. We have raised more than $80m in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p><p>Love winning at social media and working with influencers? Are you a stellar communicator with experience across multiple countries? Does your love language consist of Instagram stories and trending hashtags? Then this is the opportunity for you to not only enhance the public face of the Blueground brand, but also lead the home category on a world level. </p><p>We are looking for a <strong>Global Social Media &amp; Influencer Marketing Manager</strong> to be based <strong>anywhere in the USA (remotely) </strong>to take advantage of one of the most exciting opportunities under our expanding Brand Strategy team! The pandemic has put the spotlight on home &amp; flexible living -- and so the storytelling opportunities have never been richer. Digitally savvy and an experienced marketing mind, you will be tasked with developing and executing our social media marketing strategies and campaigns while working cross-functionally with key teams (e.g., CX, Interior Design, Content, Creative Design) to champion a high level social strategy across touchpoints. Additionally you will lead in the development and execution of a compelling, forward-thinking influencer strategy. Your technical expertise in the social media space along with your creativity in communication will help to strategically tell our story and engage our customers across the world! </p><p><strong>What you will focus on:</strong></p><ul> <li>Lead the strategy for social storytelling, overseeing ideation sessions through to calendaring for content development and social campaigns that grow, promote and elevate the visibility of Blueground with relevant audiences.</li> <li>Create strategies to maximize reach, resonance and results of Social that deliver on the full funnel from awareness, branding &amp; acquisition to conversion &amp; retention</li> <li>Develop targeted strategies for each of our platforms (e.g., Instagram; Twitter, Facebook, LinkedIn, YouTube, Pinterest) that focus on current and potential customers in the B2C and enterprise spaces, inclusive of thought-leaders &amp; investors in tech, real estate, and adjacent premium categories</li> <li>Undertake digital media, audience, messaging &amp; journey mapping to ensure optimal segmentation and behavior trigger campaigns</li> </ul><ul> <li>Test &amp; analyze the success of programs/campaigns, creative executions, ad formats and copy treatments to discover learnings; discover learnings to share back to the business to support recommendations for future program/test &amp; learn and asset optimizations</li> <li>Create and manage an online review funnel for building online reviews and reputation</li> </ul><ul> <li>Identify influencers that will propel our brand vision, drive growth, and add unique brand-centric ambassadors  to the Blueground community </li> <li>Own all influencer outreach &amp; communications - from initial pitch to support requests - in order to seed new relationships and foster long-term collaborations</li> <li>Push forward our key performance metric agenda, leveraging data and insights to evaluate relationships and opportunities for growth while developing appropriate reporting to articulate impact</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>This is a remote role and so the candidate can be based <em>anywhere in the USA</em> </li> <li>Ambitious marketeer with minimum 5 years professional experience in integrated or content marketing, social media, influencer marketing &amp; communications from a B2C perspective</li> <li>A stellar social media \"voice\" when it comes to social media copywriting (flaire for writing winning posts &amp; captions based on the platform)</li> <li>Demonstrable experience scaling a premium consumer-tech/lifestyle/hospitality brand on social and running best-in-class social media campaigns</li> <li>Exhibits the ability to jump from the creative side of marketing to analytical side, able to demonstrate why their ideas are analytically sound</li> <li>Displays ability to effectively communicate information and ideas in written/video format</li> </ul><ul> <li>Proven leadership skills in managing/influencing teams/implementing business initiatives across a part of the business that a lot of stakeholders have opinions on</li> <li>Self-motivated and doesn't wait to be told what to do; able to relentlessly follow up</li> <li>Strong attention to detail and high organizational and project management skills</li> <li>Ability to adapt to new situations, solve problems on the fly, and communicate with those around you. Teamwork and scrappiness required</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Flexible paid time off</li> <li>Enhanced parental leave</li> <li>401k retirement plan</li> <li>Competitive Health insurance (Medical, Dental and Vision), along with complimentary access to OneMedical and Health Advocate</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in Greece and winter in Dubai!</li> </ul><p><em>At Blueground we are proud to have Diversity and Inclusion at the center of everything we do. We are committed to Equal Employment Opportunity regardless of race, color, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion</em>.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/9D5F0C675F"
},
{
    "id": 1575006,
    "title": "Senior Business Analyst",
    "company": "blueground",
    "department": "Pricing - Revenue Management",
    "location": "Athens",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p> <p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 3,500 homes in 14 cities. We have raised more than $80m in funding to date and that’s just the beginning. But enough of the numbers.</p> <p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day easier.</p> <p>We are looking for a <strong>Senior Business Analyst</strong> to join our high performing <strong>Pricing Team</strong> based in Athens. Senior Pricing Analysts are responsible for monitoring performance and pricing a portfolio of cities to ensure the cities meet their utilization and gross margin goals. In addition, they lead analyses that feed into improving the Blueground pricing methodology, identify new areas of opportunity, and support quarterly planning. They partner with GMs to define and implement city level pricing strategy, drive communications with internal stakeholders and the executive team, and mentor other team members.</p><p><br><br></p><p><strong>What you will focus on:</strong></p> <ul> <li>Synthesize data and stakeholder inputs to come up with strategy proposals</li> <li>Influence pricing strategy at the company level</li> <li>Own impactful analyses, combining several datasets and perspectives</li> <li>Identify automation opportunities to improve efficiencies across the team</li> <li>Identify and drive new initiatives</li> <li>Collaborate with GMs and Sales teams on city performance and pricing next steps</li> <li>Drive communications with internal stakeholders like sales or marketing and the executive team</li> </ul><p><strong>What we are looking for:</strong></p> <ul> <li>Bachelor’s degree from a top-tier university</li> <li>Excellent analytical and communication skills</li> <li>4-7 years of progressive work experience in business analysis-oriented roles</li> <li>Ability to work cross functionally, drive alignment, and deliver results in a fast paced environment</li> <li>Ability to own projects and deliverables end to end</li> <li>Proficiency in excel and/or google sheets</li> <li>Advanced business acumen</li> <li>Ability to understand financials and product economics</li> </ul> <p>Nice to have:</p> <ul> <li>Experience in pricing/revenue management preferably in the real estate or hospitality industry</li> <li>MBA or Master in Quantitative discipline</li> <li>Working knowledge of SQL or Tableau</li> </ul> <p><strong>Your benefits:</strong></p> <ul> <li>Competitive salary</li> <li>Flexible paid time off</li> <li>Group Health Insurance program</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in LA and winter in Dubai!</li> </ul> <p>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/81176C44C3"
},
{
    "id": 1155970,
    "title": "Software Product Designer (Remote Possible)",
    "company": "blueground",
    "department": "Software Product Design",
    "location": "Kifisia",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 3,500 homes in 13 cities. We have raised more than $80m in funding to date and that’s just the beginning. But enough of the numbers.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day easier.</p><p>We are looking for a talented <strong>Software</strong> <strong>Product Designer</strong> to join our growing Product Design team based in Athens and work on our core product, onsite or remote.</p><p>We are a tech-enabled company currently making substantial investments in our technology products to enable our next stage of high growth. You will work on our booking platform and help us create amazing user-centered experiences, utilizing data, research, and analytics. </p><p><strong>What you’ll do</strong></p><ul> <li> <strong>Conduct workshops </strong>to identify and understand the project’s goals, user needs and technical constraints</li> <li>Participate in <strong>user resear</strong><strong>ch</strong> work including interviews, usability tests, surveys, personas and tapping into our conversion funnels and data. <strong>Let the users lead your decisions :)</strong> </li> <li> <strong>Iterate</strong> based on feedback, benchmarking, A/B testing and contextual research</li> <li>Conceptualize specs into <strong>wireframes and mockups</strong> </li> <li> <strong>Collaborate</strong> with product managers, engineers, and other designers to solve design problems effectively and efficiently</li> <li>Create <strong>pixel-perfect designs and prototypes</strong> that are desktop and mobile responsive</li> <li> <strong>Support</strong> the implementation process</li> <li>Improve and maintain our <strong>internal design system</strong> </li> <li> <strong>Be part of our design chapte</strong>r that aligns the visual language and user experience across products</li> <li>Participate in <strong>SCRUM</strong> ceremonies</li> </ul><p><strong>What to expect</strong></p><ul> <li>To work in agile, cross-functional teams</li> <li>To define not just how things work, but what we should be building</li> <li>To design lots of new stuff from scratch and revamp many of the existing functionalities</li> <li>A team that constantly raises its standards of work</li> <li>A rapidly growing company with top talented people</li> <li>Trust and autonomy</li> <li>To experiment, learn and have fun</li> </ul>",
    "requirements": "<ul> <li>3+ years of experience working in UX, UI, HCI related field with a strong portfolio showcasing your best work</li> <li>Demonstrated experience shipping many products over the years</li> <li>Highly proficient with industry-standard design tools (e,g. Figma, Sketch). We're using Figma!</li> <li>Solid experience  with at least one interactive prototyping tool (e.g., Figma, Protopie, Marvel, Framer)</li> <li>Good understanding of Agile methodology, especially with respect to UI/UX design</li> <li>Ability to present your designs to various stakeholders</li> <li>A positive attitude and team player</li> <li>Excited about working in a fast-paced startup environment</li> </ul><p><br></p> <ul> <li>Bonus: Having led a product design for both web and mobile applications</li> <li>Bonus: HTML and CSS not being foreign to you</li> <li>Bonus: Active member of a design community</li> </ul>",
    "link": "https://apply.workable.com/blueground/j/A45FB1CE13"
},
{
    "id": 1253122,
    "title": "Head of Accounting & Tax",
    "company": "blueground",
    "department": "Accounting",
    "location": "İstanbul",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 3,500 homes in 14 cities and we have raised more than $80m in funding to date.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time </strong>is everything, and we cherish it greatly. For us, <strong>Excellence </strong>isn’t simply a standard, but an exciting way to look at life. We <strong>Care </strong>deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency </strong>which we believe makes our day-to-day life easier.</p><p>We are looking for a<strong> Head of Accounting and Tax </strong>to coordinate all the general procedures of our Turkish accounting department based in Istanbul. The position is reporting to the global CFO with the responsibility of providing support to the General Manager. He/She will be the ultimate responsible for all accounting and statutory reporting related topics of Turkish Business Unit and support strategic planning, operational execution, and financial controllership. The person is also accountable for the collection of tax-related information, reporting to taxation authorities and advising management on the tax impact of corporate decision making.</p><p><strong><br>What we you will focus on:</strong><br>• Lead the preparation of monthly, quarterly and annual financial statements<br>• Calculate, prepare and submit accounts and tax returns<br>• Coordinate the outsourced accounting compliance and manage the relations with banks, tax and regulatory bodies<br>• Make sure appropriate documentation and approval processes are in place for any financial transaction<br>• Respond to and resolve all vendor inquiries in a timely manner<br>• Manage accounts payable transactions and ad hoc reporting<br>• Support future fund raising rounds</p><p>• Support forecasting efforts for business planning purposes<br>• Support the analysis of monthly financials and performance metrics in pursuit of improving cash flow and business efficiency<br></p><p><br><strong>What we are looking for:</strong></p><p>• Hold a degree in Accounting, Finance or Business Administration from a top-tier university</p><p>• Post graduate studies and professional qualification will be considered an asset<br>• At least 8 years of progressive accounting &amp; finance experience (in a Big 4 and/or start up or hospitality industry is a plus)<br>• Fluent in English and computer literate<br>• Be highly analytical, detail oriented and problem solver<br>• Feel comfortable working in a fast-growth, entrepreneurial environment</p><p><br><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Flexible paid time off</li> <li>Group healthcare plan</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in Los Angeles and winter in Dubai!</li> </ul><p><br></p><p><em>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</em></p><p><br></p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/CFB32FF32A"
},
{
    "id": 1596196,
    "title": "Senior People Generalist",
    "company": "blueground",
    "department": "People",
    "location": "Athens",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighbourhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 3,500 homes in 13 cities. We have raised more than $80m in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, Time is everything, and we cherish it greatly. For us, Excellence isn’t simply a standard, but an exciting way to look at life. We care deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with Transparency which we believe makes our day-to-day easier.</p><p><br></p><p>We are currently looking for an experienced Generalist to join our People Partnering team based in Athens. A passionate People professional to join our team and help us deliver excellent employee experience across EMEA. You will have the opportunity to work with colleagues across the EMEA region, understand employment trends across and get involved in the launch of new markets from a generalist standpoint. You will be the subject market expert in all people-related issues and the go-to person for advice. A trusted partner for all EMEA team members. </p>",
    "requirements": "<p><br><strong>What you will focus on:</strong></p><ul> <li>Support in people-related initiatives with developing communication, coaching and influencing skills, and offer thought-leadership regarding organizational/people-related strategy and execution</li> <li>Address and manage a broad spectrum of employee relations matters, and work to resolve them through a systematic approach, adhering to company policies, local employment laws and best practices</li> <li>Responsible for all compliance, labour-related and day to day operations across EMEA</li> <li>Own all people policies, processes and best practices for the region</li> <li>Manage all business as usual from performance reviews to employee relations</li> <li>Be a People ambassador</li> <li>Support People Partner where needed</li> </ul><p><br></p><p><strong>What we are looking for:</strong></p><ul> <li>4 plus years of experience in People functions</li> <li>Degree in Human Resources</li> <li>Knowledge of HRIS systems</li> <li>A knack for creating an amazing experience for our people</li> <li>An interest in driving teams forward while building strong relationships</li> <li>In-depth knowledge of labour law and the ability to build credibility in your area</li> <li>Great communication skills both written and verbal</li> <li>Ambition to find the right answer for each team</li> <li>Passion for creating diverse &amp; inclusive working environments </li> <li>Positive attitude with a desire to make work fun</li> </ul>",
    "link": "https://apply.workable.com/blueground/j/C6B9F4EF73"
},
{
    "id": 1602598,
    "title": "Operations Associate -Seattle",
    "company": "blueground",
    "department": "Operations",
    "location": "Seattle",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 3,500 homes in 13 cities. We have raised more than $80m in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p><p>We are looking for an <strong>Operations Associate</strong> to join our fast growing <strong>Seattle team</strong>. The ideal candidate should be a stickler for detail, proactive, skilled in general maintenance tasks and thoughtful as to ensure that the property is continuously in pristine condition for our guests. The role is primary responsible for assisting our Operations Team in preparing new units, ensuring that existing units are perfect for our guests, and handling any issues or emergencies that arise. These issues include but are not limited to handling guest lockouts, emergency relocations, as well as keeping Operations Managers informed of potential repairs and actions being taken.</p><p><br></p><p><strong>What you will mostly focus on:</strong></p><ul> <li>Assist our Operations Managers in the set-up of the units with un-boxing, furniture assembly and frames' installation</li> <li>Complete basic maintenance tasks to ensure positive guest experience</li> <li>Perform check-in/outs to our properties according to business standards</li> <li>Be the main point of contact between our guests and the customer experience team</li> <li>Supervise handyman while working on resolving an emergency in our apartments (locksmith, plumber etc.)</li> </ul><p>What you may focus on:</p><ul> <li>Manage viewings at Blueground properties for prospective clients or partners</li> <li>Perform messenger related duties such as collecting paperwork, delivering items, receiving mail</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Willingness to get their hands dirty as needed to achieve operational excellence</li> <li>Great at handy work</li> <li>Can perform heavy lifting when needed</li> <li>Is available to work weekends</li> <li>Problem solver, with ability to work in a fast-paced and \"get the job done\" culture</li> <li>Hard working with great attention to detail</li> <li>Ability to multitask and remain calm under pressure</li> <li>Confident user of technology (email, slack, G suite)</li> <li>A positive, confident, upbeat and friendly personality</li> </ul><p><strong>Your benefits:</strong></p><p></p><ul> <li>Market competitive salary</li> <li>Commuting Benefit</li> <li>Corporate cell phone plan</li> <li>Joining a fast growing start up</li> </ul><p><em>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion</em>.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/7B1ED1C4B8"
},
{
    "id": 1509329,
    "title": "Operations Associate - Contractor",
    "company": "blueground",
    "department": "Operations",
    "location": "New York",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 3,500 homes in 14 cities. We have raised more than $80m in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p><p>We are looking for an <strong>Operations Associate</strong> to join our fast growing <strong>New York</strong> team. The ideal candidate should be a stickler for detail, proactive, skilled in general maintenance tasks and thoughtful as to ensure that the property is continuously in pristine condition for our guests.The role is primary responsible for assisting our Operations Team in preparing new units, ensuring that existing units are perfect for our guests, and handling any issues or emergencies that arise.These issues include but are not limited to handling guest lockouts, emergency relocations, as well as keeping Operations Managers informed of potential repairs and actions being taken.</p><p>This position will require some weekend work but will not exceed 40 hours/week.</p><p><strong>What you will mostly focus on:</strong></p><ul> <li>Assist our Operations Managers in the set-up of the units with un-boxing, furniture assembly and frames' installation</li> <li>Complete basic maintenance tasks to ensure positive guest experience</li> <li>Perform check-in/outs to our properties according to business standards</li> <li>Be the main point of contact between our guests and the customer experience team</li> <li>Supervise handyman while working on resolving an emergency in our apartments (locksmith, plumber etc.)</li> </ul><p><strong>What you may focus on:</strong></p><ul> <li>Manage viewings at Blueground properties for prospective clients or partners</li> <li>Perform messenger related duties such as collecting paperwork, delivering items, receiving mail</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Willingness to get their hands dirty as needed to achieve operational excellence</li> <li>Great at handy work</li> <li>Can perform heavy lifting when needed</li> <li>Is available to work weekends</li> <li>Problem solver, with ability to work in a fast-paced and \"get the job done\" culture</li> <li>Hard working with great attention to detail</li> <li>Ability to multitask and remain calm under pressure</li> <li>Confident user of technology (email, slack, G suite)</li> <li>A positive, confident, upbeat and friendly personality</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Market competitive salary</li> <li>Commuting Benefit</li> <li>Corporate cell phone plan</li> <li>Joining a fast growing start up</li> </ul><p><em>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion</em>.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/93C57783BD"
},
{
    "id": 1606183,
    "title": "Collections Specialist",
    "company": "blueground",
    "department": "Accounts Receivable",
    "location": "Chicago",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 3,500 homes in 12 cities. We have raised more than $80m in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core <strong>values</strong>. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p><p>We are looking for a <strong>Senior Collections Specialist</strong> to join our <strong>Chicago</strong> team. The incumbent will work for the collection of outstanding accounts receivable from existing clients across Blueground in the US aiming at reducing accounts receivable delinquency. The role will focus on developing an effective credit risk assessment process, anticipating and resolving receivables issues and monitoring ageing accounts. The role will also ensure that all collection activity is handled professionally, timely, and in accordance with all company policies, procedures and state and federal guidelines.</p><p><strong>What you will focus on:</strong></p><ul> <li>Partner with business executives, legal counsel and fellow colleagues from collections department to build an end to end credit risk assessment and collections process</li> <li>Handle outbound collection calls in a professional manner while keeping and improving customer relations</li> <li>Collect customer payments in accordance with payment due dates</li> <li>Initiate eviction proceedings by providing necessary documentation to the relevant authority, in partnership with legal counsel</li> <li>Review and resolve client-billing problems and reduce accounts receivable delinquency according to collection plans</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>3-5 years of prior high volume collection/accounts receivable experience</li> <li>B2C experience will be considered as a plus </li> <li>Strong team player </li> <li>Attention to detail with excellent customer service attitude</li> <li>Solid skills in Microsoft Excel, &amp; Word</li> <li>Ability to effectively multitask and work with multiple accounts</li> <li>Working knowledge of regulatory requirements pertaining to collection activities</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Flexible paid time off</li> <li>Enhanced parental leave</li> <li>401k retirement plan</li> <li>Private life and health insurance plan</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in Greece and winter in Dubai!</li> </ul><p><br>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.<br><br></p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/25E9361FA2"
},
{
    "id": 1250549,
    "title": "E-commerce / Channel Management Associate",
    "company": "blueground",
    "department": "Channel Management",
    "location": "Athens",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 3,500 homes in 14 cities. We have raised more than $80m in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, Time is everything, and we cherish it greatly. For us, Excellence isn’t simply a standard, but an exciting way to look at life. We Care deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with Transparency which we believe makes our day-to-day life easier.</p><p>We are looking for a highly motivated <strong>E-commerce / Channel Management Associate</strong> based in our <strong>Athens</strong> HQs, to join the <strong>Channel Management team</strong>. As an E-commerce/ Channel Associate, you will be primarily responsible for assisting the Channel Management team in the listing/advertising process of Blueground properties on classifieds and booking platforms, in order to maximize utilization and occupancy across cities.</p><p><strong><strong>What you will focus on: </strong></strong></p><ul> <li> Upload the Blueground properties in the relevant listing sites/channels using the data from our internal database</li> <li>Maintain the content of the properties’ listings/advertisements in order to make sure that all the data are always up to date</li> <li>Join team projects which include research of new channels/listing sites, monitoring the listing sites’ performance, improvement of internal processes, etc.</li> <li>Be responsible for simultaneous multiple tasks in different cities</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Degree from a top – tier university</li> <li>Fluent in written and verbal English</li> <li>Prioritization and organizational skills</li> <li>Strong attention to detail</li> <li>Comfortable learning how to use new software platforms</li> <li>Great team player, flexible, with strong communication skills</li> </ul><p><strong>Your benefits:<br></strong></p><ul> <li>Competitive salary</li> <li>Flexible paid time off</li> <li>Enhanced parental leave</li> <li>Group Health Insurance program</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in LA and winter in Dubai!</li> </ul><p>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/C452963BC9"
},
{
    "id": 1610109,
    "title": "Real Estate Portfolio Administrator",
    "company": "blueground",
    "department": "Real Estate",
    "location": "Athens",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 3,500 homes in 13 cities. We have raised more than $80m in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p><p>We are looking for a <strong>Real Estate Portfolio Administrator</strong> based in <strong>Athens</strong>, to support the growth and organisation of the <strong>US</strong> Real Estate Portfolio Administration <strong>team</strong> and to provide attentive support to internal parties. If you are a well organized, analytical person with exceptional communication and problem solving skills then this role may be for you!</p><p>Kindly note that the working hours for this role are 1pm to 9:30pm EEST including a 30 min. break.</p><p><strong>What you will focus on:</strong></p><ul> <li>Assist the Real Estate Portfolio Administrator and Central Real Estate Team with the administrative side of negotiations and deals: payments, data entry, reviewing ledgers, landlord credential maintenance</li> <li>Coordinate all US payments to landlords and RE related vendors</li> <li>Work closely with Finance and Accounting to control landlord payments</li> <li>Assist with Revenue Share Reporting</li> <li>Assist with Payments for Marked to Market/Capital Efficient Units</li> <li>Work closely with Operational Excellence to ensure RE processes effectiveness</li> <li>Assist all markets with insurance (COI) requests to ensure proper coverage and address renewal as policies expire</li> </ul><ul> <li>Utilities tracking, auditing and payments</li> <li>Distribute proof of payments and ledgers for monthly payments and portfolio deals</li> <li>Work with the Product Team to optimise RE relevant information storage into our internal information system</li> <li>Work with the local RE Teams on marketing efforts to reach and onboard more landlords under our new revenue share model</li> <li>Establishing/improving processes for portfolio onboarding and management.</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Degree from a top-tier university</li> <li>Min. 1-2 years of experience in a similar role (residential RE or hospitality experience will be considered as a plus)</li> <li>Fluency in English</li> <li>Proficiency in Microsoft Word, Excel (formulation, data entry, charts, pivot tables) and Powerpoint</li> <li>Self-starter with a roll up your sleeves mentality</li> <li>Entrepreneurial drive, adaptability, and focus on results</li> <li>Strong quantitative and analytical skills</li> <li>Strong organizational skills with the ability to manage multiple assignments</li> <li>Excellent verbal and written communication skills</li> <li>Ability to work independently and with speed</li> <li>Attention to detail</li> </ul><p><strong>Your Benefits:</strong></p><ul> <li>Competitive salary</li> <li>Flexible paid time off</li> <li>Group Health Insurance program</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in LA and winter in Dubai!</li> </ul><em>At Blueground we are proud to have Diversity and Inclusion at the center of everything we do. We are committed to Equal Employment Opportunity regardless of race, color, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion</em>.",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/78C442EB16"
},
{
    "id": 1611741,
    "title": "Talent Specialist",
    "company": "blueground",
    "department": "People",
    "location": "Athens",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighbourhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 3,500 homes in 13 cities. We have raised more than $80m in funding to date and that’s just the beginning. </p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time </strong>is everything, and we cherish it greatly. For us, <strong>Excellence </strong>isn’t simply a standard, but an exciting way to look at life. We <strong>care </strong>deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency </strong>which we believe makes our day-to-day easier.<br><br>We are currently looking to recruit a <strong>Talent Specialist</strong> based in Athens to join our People team. We are looking for a passionate professional to join our team and help us attract and develop top talent across cities. You will focus on bringing on-board amazing people that will love our culture and embrace our values. If you are a target-driven professional, who has a passion for attracting great talent and creating an exceptional candidate experience, this is an opportunity to drive your career forward! As a Blueground talent scout, you will manage the recruitment process from end to end and collaborate with our senior leadership team to bring on board amazing people. If you like what you read, you get excited by change and understand the needs of a fast-growing company we’d love to hear from you!</p><p><strong>What you will focus on:</strong></p><ul> <li> <strong>Global Sourcing </strong>– be an expert in sourcing hard-to-fill positions and finding the best talent in proptech through using innovative sourcing methods including utilizing an agile sourcing methodology across all business units, geographies and role functions (Europe &amp; Middle East, North America).</li> <li> <strong>Employer Branding </strong>– support on the design and creation of exciting employer branding content globally working closely with our Digital Design &amp; Communications Team to represent Blueground as a market leading mid to long term flexible housing employer of choice</li> <li> <strong>Talent Pooling</strong> – build diverse talent pools through effective targeting and talent pipelining of both passive and active candidates. You will be responsible for actively overseeing regular and accurate updates of our global job adverts, external jobs boards, recruitment networking and the promotion of our refer a friend scheme; keeping D&amp;I in mind through every part of the Talent Attraction process.</li> <li> <strong>Be a Blueground Ambassador</strong> - Get people excited about Blueground and match great talent to great opportunities. You will often be the first person that someone talks to from Blueground, so you need to be great at understanding what motivates them and match their motivations with the many benefits of working here.</li> <li> <strong>Talent Projects </strong>- Support the talent team in various global talent enablement projects like Learning &amp; Development opportunities, Talent Management &amp; Succession, Role Design and Performance Management. <br> </li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>3+ years of experience in a recruitment/talent environment</li> <li>Tech-savvy and familiar with our tools/systems: Workable or other Applicant Tracking System, Google Suite and Slack</li> <li>Knowledge and experience of online sourcing including social/professional networking (e.g. LinkedIn Recruiter)</li> <li>Candidate experience focused, passionate about employer branding and be creative in our approach to sourcing talent</li> <li>Excellent organizational and prioritization skills, tenacious, personable and articulate</li> <li>Ability to establish trusted relationships with management, candidates and external partners</li> <li>Positive attitude combined with a desire to make work fun</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Flexible Paid Time Off</li> <li>Group Healthcare Plan</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodations in Blueground locations! Think summer in LA and winter in Dubai!</li> </ul><p><br></p><p><br></p><p><em>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</em></p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/D89F811591"
},
{
    "id": 1483707,
    "title": "Software Engineer, Front End",
    "company": "blueground",
    "department": "Engineering",
    "location": "Athens",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 3,500 homes in 12 cities. We have raised $78m in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day easier.</p><p>We are looking for a talented <strong>Front End Engineer</strong> to join our Engineering team in Athens and our mission to offer a world class experience to our customers on the web, office based or remote.<br></p><p>We are a tech enabled company, currently making substantial investments in our technology platform, from our booking website and mobile app to our key business internal software, to enable our next stage of high growth.The person in this role will work on our web products with some of the latest tech goodies, solid engineering practices and demanding requirements on UX, analytics and performance.<br></p><p><br></p><p><strong>Our Stack</strong></p><ul> <li>ES2015+</li> <li>Node.js | Express | Koa</li> <li>MongoDB | Postgres | Redis</li> <li>RabbitMQ</li> <li>Vue.js | Angular | Vanilla.js</li> <li>Jest | WebDriver.io | Cypress.io</li> <li>RESTful APIs | gRPC </li> <li>Serverless</li> <li>GraphQL on Prisma up next</li> </ul><p>Our code sits on Github, is integrated through Jenkins pipelines and runs on AWS EKS &amp; Lambda.  We do project management on JIRA, our prototypes and mockups on Figma and monitor our systems and performance on Datadog and New Relic.</p><p><br></p><p><strong>What you'll focus on</strong></p><ul> <li>Architect, design and build product features on Blueground’s web products</li> <li>Deliver rich, responsive, mobile first experiences on the browser</li> <li>Participate in SCRUM ceremonies</li> <li>Code in Vue.js</li> <li>Write your unit tests</li> <li>Write your e2e tests</li> <li>Sometimes write your HTML &amp; CSS</li> <li>Automate stuff</li> <li>Depend on a CI pipeline</li> <li>Experiment and create rapid prototypes</li> </ul><p><br></p><p><strong>What to expect</strong></p><ul> <li>Your opinion to matter</li> <li>To work in an agile, cross functional, devops enabled team</li> <li>To work with a product designer, a product manager and an engineer in test</li> <li>To work on functional and non functional testing</li> <li>To build lots of stuff from scratch and rewrite quite as many</li> <li>To work on performance and SEO</li> <li>To move beyond frameworks and take advantage of modern browser tech</li> <li>To enjoy some quality engineering</li> <li>To get your hands on latest goodies - we’re open-minded geeks</li> <li>A rapidly growing company</li> <li>Cool colleagues :)</li> </ul><p><br></p><p><strong>Interview process</strong></p><ul> <li>Video call dialogue with People Team</li> <li>Coding assignment (3+ working days)</li> <li>Technical Interview, 2+ hours long</li> <li>Interview with Head of engineering</li> </ul><p><em>What to expect at the technical interview?</em></p><p>You will be called to have a long discussion with your future team members. This discussion will cover many things from CS fundamentals to latest web and Javascript tech. So we encourage you to do a quick refresh on topics like data structures, algos and runtime complexity as well as core Javascript and web fundamentals. We will also try to tackle some real-world software design problems together as we do every other day. It may sound scary but it's really not. We want you to succeed.</p>",
    "requirements": "<ul> <li>2+ years of full-time industry experience working with web technologies</li> <li>Strong web fundamentals and solid understanding of the 2020's web ecosystem</li> <li>Strong Javascript skills (ES2015+)</li> <li>Strong HTML &amp; CSS skills</li> <li>An eye for good UX</li> <li>Core Web APIs like DOM, Storage, Fetch etc should not be strange to you</li> <li>Really comfortable with Git</li> <li>Excellent communication in English</li> <li>BS/MS degree in Computer Science or a related subject</li> <li>Bonus: experience doing fullstack development on Node.js</li> <li>Bonus: knowing your way around *nix shell</li> <li>Bonus: experience in software testing</li> </ul>",
    "link": "https://apply.workable.com/blueground/j/A2DD1AC3EC"
},
{
    "id": 1143248,
    "title": "Business Analyst",
    "company": "blueground",
    "department": "Pricing - Revenue Management",
    "location": "Athens",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 3,500 homes in 14 cities. We have raised more than $80m in funding to date and that’s just the beginning. But enough of the numbers.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day easier.</p><p>We are looking for a <strong>Business Analyst</strong> to join our high performing team based in Athens. Business Analysts at Blueground focus on identifying opportunities, conducting rigorous analyses, defining metrics, and generating insights to provide actionable recommendations. As a Business Analyst you will work cross-functionally with Marketing, Sales, and city General Managers across multiple markets. This is a great opportunity to develop your career in a fast growing global organisation. </p> <p><strong>What you will focus on:</strong></p><ul> <li>Define market level strategy and support pricing operations</li> <li>Develop dashboards and reports to assess the performance and impact of pricing decisions</li> <li>Communicate data analyses and recommendations to leadership and relevant stakeholders</li> <li>Collaborate with the Business Intelligence team to develop demand and pricing forecasting models</li> <li>Research market trends and competitor data to identify revenue optimization opportunities</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Bachelor’s degree from a top-tier university</li> <li>Strong analytical and communication skills</li> <li>Advanced excel skills</li> <li>Fluency in English</li> </ul><ul><li>Working knowledge of SQL, Tableau, and/or Google Sheets will be considered a plus</li></ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Flexible paid time off</li> <li>Group Health Insurance program</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in LA and winter in Dubai!</li> </ul><p>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/65CCD17AA6"
},
{
    "id": 1545393,
    "title": "Room Inspector - Contractor, NY",
    "company": "blueground",
    "department": "Quality Assurance",
    "location": "New York",
    "description": "<p>At <strong>Blueground</strong>, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 3,500 homes in 14 cities. We have raised more than $80m in funding to date and that’s just the beginning. But enough of the numbers.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day easier.</p><p>We are currently looking for a contract based <strong>Quality Assurance Inspector</strong> to join our growing team in <strong>New York</strong> and take care of Blueground's Product quality. The QA inspector performs scheduled audits in Blueground apartments to ensure compliance of the city in charge with Blueground standards.</p><p><strong>What you will focus on:</strong><br></p><ul> <li>Conduct initial inspection audits at a sample of  newly furnished apartments and exit inspection audits at a sample of checked out apartments in order to ensure the apartment’s and furniture’s perfect condition.</li> <li>Estimate and report the level of damage that may have been occurred after guests stay at our apartment</li> <li>Check and evaluate the cleaning services conducted in our properties by cleaning partners</li> <li>Highlight the actual apartment’s condition right before tenant’s check in, through the last minute QA audit</li> <li>Cooperate with QA Team Leader, providing him/her with his/her feedback (through audit reports) regarding the performance of OMs/OAs/Technicians/GRAs/cleaning teams in initial/exit inspections and cleaning sessions</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Minimum 1 year experience in Quality Control inspections</li> <li>Relevant experience in the hospitality sector or in a facilities management company would be a plus</li> <li>Experience working in a Quality Assurance related position would be a plus</li> <li>Ability to conduct  technical assessments for apartments</li> <li>Ability to easily commute within the city</li> <li>B.Sc/M.Sc in Quality or Engineering would be a plus</li> <li>Attention to detail (Problem Solving)</li> <li>Very good communication skills - verbal and written (Communication)</li> <li>Data collection, management and analysis experience (Problem Solving)</li> <li>Planning and organizational skills</li> <li>IT Literacy (MS Office, G-Suite)</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Dynamic working environment with talented people</li> </ul><p><em>At Blueground we are proud to have Diversity and Inclusion at the center of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</em></p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/006C850A2C"
},
{
    "id": 1563533,
    "title": "Real Estate Partnerships Associate",
    "company": "blueground",
    "department": "Real Estate Partnerships/Business Development",
    "location": "Los Angeles",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 3,500 homes in 14 cities. We have raised more than $80m in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day life easier.</p><p>We are seeking a <strong>Real Estate Partnerships Associate</strong> based in our <strong>Culver City, CA </strong>office, to help us grow our apartment portfolio in the <strong>Los Angeles</strong> area. You will focus on building our apartment supply in selected Los Angeles neighborhoods to further fuel our growth and market presence.</p><p>If you are a recent graduate or professional, that is looking for a fast-growing career within an international startup company, who possesses an interest in real estate and has strong communication, sales or business development skills, then this role may be for you!</p><p><strong>What you will focus on:</strong></p><ul> <li>Grow apartment supply pipeline through a combination of cold calling, email campaigns, networking, and local market sector knowledge</li> <li>Prospect, qualify, research, present and close apartment opportunities with institutional and private partners</li> <li>Developing the business by building and nurturing relationships with leasing managers, real estate agents/brokers, landlords/owners and developers.</li> <li>Negotiate and structure favorable apartment lease terms</li> <li>Achieve agreed upon apartment lease targets and outcomes within schedule</li> <li>Analyze neighborhood and building potential, and track apartment performance and lease renewals</li> <li>Coordinate new apartment on-boarding effort with team members and other departments</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Degree from a top-tier university</li> <li>Min. 2 years of experience in a business development or sales role (residential RE or hospitality experience will be considered as a plus)</li> <li>Real Estate license will be considered a plus</li> <li>Negotiation experience</li> <li>Proficiency with G-suite</li> <li>Strong communication skills and with an eye-to-detail approach</li> <li>Quick thinker and deal maker</li> </ul><p><strong>Your benefits:</strong></p><ul> <li>Competitive salary</li> <li>Flexible paid time off</li> <li>Enhanced parental leave</li> <li>401k retirement plan</li> <li>Competitive Health insurance (Medical, Dental and Vision), along with complimentary access to OneMedical and Health Advocate</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in Greece and winter in Dubai!</li> </ul><p><em>At Blueground we are proud to have Diversity and Inclusion at the center of everything we do. We are committed to Equal Employment Opportunity regardless of race, color, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion</em>.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/4BD92A1AEC"
},
{
    "id": 1563687,
    "title": "Supply Chain Director",
    "company": "blueground",
    "department": "Design and Supply Chain",
    "location": "İstanbul",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 3,500 homes in 13 cities and we have raised more than $80m in funding to date.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time </strong>is everything, and we cherish it greatly. For us, <strong>Excellence </strong>isn’t simply a standard, but an exciting way to look at life. We <strong>Care </strong>deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency </strong>which we believe makes our day-to-day life easier.<br><br>We are looking for a <strong>Supply Chain Director</strong> to join our supply chain team based in <strong>Istanbul</strong>. The role will act as an entrepreneurial leader, taking responsibility for all aspects of our supply chain operations globally. Will be responsible for implementing new supply chain processes across the value chain, including vendor management, inventory management, procurement, logistics, and warehouse operations. Leading the strategy and execution of Blueground’s Supply Chain network, in order to drive end-to-end supply chain efficiency, build scale and improve performance.</p><p>This a global leadership role, reporting to Chief Product Officer and managing Purchasing, Strategic Sourcing &amp; Logistics and Supply Chain Operations functions.</p><p><strong>What you will focus on:</strong><br></p><ul> <li>Establishing and implementing a sourcing strategy for all product categories based on quantitative data</li> <li>Managing suppliers around the globe and communicate performance metrics to key stakeholders throughout the organization</li> <li>Building and managing supply chain budget (Full P&amp;L responsibility)</li> <li>Leading and growing a team of purchasing, logistics, demand planning professionals</li> <li>Overseeing supply planning and inventory management to ensure accurate and efficient inventory levels</li> <li>Managing and scaling all aspects of 3PL warehouse operations and optimizing current supply chain operations strategy for long-term success</li> <li>Overseeing transportation including international Logistics and Freight Forwarding operations and local market warehouses in the US, Europe and MENA</li> <li>Developing and implementing network optimization models to evaluate strategic scenarios as the company scales</li> <li>Evaluating current and potential suppliers and ensuring partner alignment/support of strategic initiatives</li> <li>Collaborating with business partners across the global business to tackle macro and micro-level issues</li> </ul><p><strong>What we are looking for:</strong><br></p><ul> <li>Very high energy, strong sense of ownership and collaborative work-style</li> <li>Minimum 10 years of overall experience in supply chain and logistics roles including vendor management, procurement and demand planning</li> <li>At least 5 years of experience in a leadership role</li> <li>Bachelor’s degree in Engineering or relevant studies from a top-tier university</li> <li>Experience in building sourcing strategies for a global brand or a successful startup (international experience will be considered a plus)</li> <li>Experience in implementing ERP systems, WMS and other supply chain tools</li> <li>Extremely data-driven, with deep analytical and problem-solving skills</li> <li>Entrepreneurial attitude able to translate complex situations into simplified initiatives an build things from scratch</li> <li>Fluent in English</li> </ul><p><strong>Your benefits:</strong><br></p><ul> <li>Competitive salary </li> <li>Flexible paid time off</li> <li>Enhanced parental leave</li> <li>Dynamic working environment with talented people</li> <li>Complimentary accommodation in Blueground locations. Think summer in LA and winter in Dubai!</li> </ul><p><br></p><p><br></p><p><em>At Blueground we are proud to have Diversity and Inclusion at the centre of everything we do. We are committed to Equal Employment Opportunity regardless of race, colour, national origin, ethnicity, gender, age, disability, sexual orientation, gender identity or religion.</em></p>",
    "requirements": "",
    "link": "https://apply.workable.com/blueground/j/4EFCED39AE"
},
{
    "id": 811540,
    "title": "Software Engineer, Backend",
    "company": "blueground",
    "department": "Engineering",
    "location": "Athens",
    "description": "<p>At Blueground, we are guided by a vision to make people feel at home wherever they choose to live. By offering fully-furnished apartments that are move-in ready in the world’s most vibrant neighborhoods, we provide our guests with the opportunity to simply #ShowUpStartLiving. Behind the scenes, we strive for a tech-powered living experience that guests love, homed in an organization where great people are proud to work.</p><p>We’ve grown a lot since our founding in 2013. We are now hosting guests in more than 3,500 homes in 14 cities. We have raised $78m in funding to date and that’s just the beginning.</p><p>What drives our success is how each of our team members applies our core values. To our team, <strong>Time</strong> is everything, and we cherish it greatly. For us, <strong>Excellence</strong> isn’t simply a standard, but an exciting way to look at life. We <strong>Care</strong> deeply about our clients and colleagues and never lose sight of the human element, which goes hand-in-hand with <strong>Transparency</strong> which we believe makes our day-to-day easier.</p><p>We are looking for a talented <strong>Backend</strong> <strong>Software Engineer </strong>to join our Engineering team in Athens and work on our business critical backend services.</p><p>We are a tech enabled company, currently making substantial investments in our technology platform, from our booking website and mobile app to our key business internal software, to enable our next stage of high growth.The person in this role will work on our backend services with a well established development methodology, a robust CI pipeline, solid engineering practices and challenging requirements (you won't get bored).</p><p><br></p><p><strong>Our Stack</strong></p><ul> <li>Kotlin  | Javascript | Typescript</li> <li>Spring Boot</li> <li>Node</li> <li>Postgres | MongoDB | Redis</li> <li>RabbitMq</li> <li>Spock | Jest | Cypress.io</li> <li>Rest | GraphQL</li> <li>Docker | AWS | k8s on EKS</li> <li>Serverless</li> </ul><p>Our code sits on Github, is integrated through Jenkins pipelines and runs on AWS EKS &amp; Lambda. We do project management on JIRA, our prototypes and mockups on Figma and monitor our systems and performance on Datadog and New Relic.</p><p><br></p><p><strong>What you'll do</strong></p><ul> <li>Architect, design and build our internal platform and tools</li> <li>Participate in SCRUM ceremonies</li> <li>Code services and APIs</li> <li>Write your unit tests</li> <li>Write your e2e tests (functional &amp; performance)</li> <li>Automate stuff. Like a lot.</li> <li>Be religious with Git</li> <li>Depend on a CI pipeline</li> <li>Experiment, learn and have fun</li> </ul><p><br></p><p><strong>What to expect</strong></p><ul> <li>To work in agile, cross functional, DevOps enabled teams</li> <li>To work with a product manager and an engineer in test</li> <li>To work on functional and non functional testing</li> <li>To work on performance</li> <li>To get your head around a quite big problem domain</li> <li>To solve hard problems</li> <li>To enjoy some quality engineering</li> <li>A rapidly growing company</li> <li>Opportunities to do full stack or go polyglot if interested (e.g. Python or Go)</li> <li>Cool colleagues :)</li> </ul><p><br></p><p><strong>Interview process</strong></p><ul> <li>Video call dialogue with People Team</li> <li>Coding assignment</li> <li>Technical Interview, 2+ hours long</li> <li>Interview with Head of engineering</li> </ul><p>What to expect at the technical interview?</p><p>You will be called to have a long discussion with your future team members. This discussion will cover many things from CS fundamentals to latest coding trends. So we encourage you to do a quick refresh on topics like data structures, algos and runtime complexity as well as core concepts of your primary language (e.g. Java or Python). We will also try to tackle some real-world software design problems together as we do every other day. It may sound scary but it's really not. We want you to succeed.</p>",
    "requirements": "<ul> <li> <strong>Industry experience</strong> in software development</li> <li>Strong <strong>CS background</strong> </li> <li>Strong skills in one of Kotlin, Java, Python, Ruby, Javascript</li> <li>Strong background in relational databases and<strong> SQL</strong> </li> <li>Good knowledge of the <strong>Spring framework</strong> &amp; the <strong>JEE</strong> platform is a plus</li> <li>Experience in designing <strong>REST</strong> APIs</li> <li> <strong>Testing</strong> mindset and an eye for<strong> clean code</strong> </li> <li>Really comfortable with <strong>Git</strong> </li> <li>Excellent communication in English</li> <li>BS/MS degree in Computer Science or a related subject</li> <li>Bonus: experience with other JVM languages like <strong>Groovy</strong> or <strong>Kotlin</strong> </li> <li>Bonus: knowing your way around the <strong>*nix shell</strong> </li> <li>Bonus: experience with <strong>NoSQL </strong>storage (Redis, Elastic, MongoDB)</li> <li>Bonus: experience with<strong> binary APIs </strong>(Protocol Buffers, Avro etc)</li> </ul>",
    "link": "https://apply.workable.com/blueground/j/C28D606B1E"
}
]