[
{
    "id": 1536187,
    "title": "Account Manager - Rhodes",
    "company": "e-food",
    "department": "Sales",
    "location": "Rhodes",
    "description": "<p>efood is looking to hire an experienced <strong>Account Manager</strong> to build and maintain solid relationships with partner restaurants. The Account Manager's responsibility is to identify opportunities for them and help them grow their business using efood’s services, features and campaigns. A successful Account Manager should be able to analyze and use data to support clients in decision making. Ability to manage multiple accounts without compromising the quality of services provided is also a must.</p><p><br></p><h3>Responsibilities :</h3><ul> <li>Negotiating with clients and selling services for the fulfilment of each client's long-term goals</li> <li>Developing a thorough understanding of clients' needs and requirements and preparing customized solutions to meet their objectives.</li> <li>Compiling and monitoring reports on account progress, goals, and forecasts for account teams and stakeholders<br> </li> </ul> <h3> <br>Requirements :</h3><ul> <li>Proven experience in Sales &amp; Account Management </li> <li>Proficient in all Microsoft Office applications as well as CRM software</li> <li>Strong negotiation and leadership skills</li> <li>Exceptional customer service skills</li> <li>Excellent communication skills</li> <li>Problem-solving attitude </li> <li>Ability to work independently without supervision<br><br> </li> </ul> <p><strong>Nice to have :</strong></p> <ul> <li>Bachelor's degree in Business Administration,Management, Sales, or related field</li> <li>Understanding of marketing fundamentals</li> <li>Interest in topics related to business and/or technology</li> </ul><p><br></p><p><strong>We offer :</strong></p><ul> <li>Competitive remuneration scheme</li> <li>Great Place to Work award winner working environment</li> <li>Private Medical &amp; Life Insurance</li> <li>Meal coupons</li> <li>Career development opportunities</li> <li>Free remote fitness courses<br> </li> </ul><p><strong><br>Your life @efood :</strong></p><ul> <li>You will be a part of a fast-growing multinational company, member of the Delivery Hero holding, with the opportunity to acquire new skills and grow professionally.</li> <li>Moreover, you will have the opportunity to function in an established, yet creative and fun working environment with people who are genuine, ambitious and participate in a team that its highest goal is to maintain efood the ideal workplace.</li> </ul>",
    "requirements": "",
    "link": "https://apply.workable.com/e-food/j/14CEFA67C9"
},
{
    "id": 1515471,
    "title": "Quality Assurance Coach - Training Team",
    "company": "e-food",
    "department": "Operations",
    "location": "Athens",
    "description": "<p>We are looking for a talented and enthusiastic contestant to join our <strong>Training and Quality Team</strong> and contribute in all aspects of our Quality Assurance practices and processes. Your goal will be to promote corporate values and enhance the company’s quality processes and strategies.</p><p><br></p><p><strong>What you'll do</strong></p><ul> <li>Monitor closely and evaluate work quality and efficiency for our company's staff performance (incoming calls, live chat, incoming emails)</li> <li>Coach our company's staff to fully understand the customer’s expectations and the way to achieve the highest level of customer experience and translate it to goals and objectives for the customer care agents</li> <li>Coach new hires and existing company staff on raising their confidence levels and overall skillset, and ensure that they can fully implement change, complete the desired goals, and model of excellence</li> <li>Identify areas for improvement based on feedback, make recommendations and propose solutions</li> <li>Contribute to the overall success of our company by ensuring our team meets the department's goals and objectives</li> <li>Maintain positive, consistent and effective communication with staff, peers and management</li> </ul><p><br></p><p><strong>What you have</strong><br></p><ul> <li>At least 1 year’s experience in Coaching/ Teaching experience is essential</li> <li>Bachelor degree</li> <li>Strong computer skills including Microsoft Office, QA applications and databases</li> <li>Excellent verbal and written communication skills in both Greek and English is a must</li> <li>Previous work experience in a customer care or educational environment is a plus</li> <li>Strong understanding of customer expectations with a focus on quality driven support</li> <li>Attention to details, multitasking, accuracy, critical thinking and problem-solving powers</li> <li>Ability to coach professionally, courteously and consistently</li> <li>Good sense of responsibility, commitment to confidentiality and high levels of integrity</li> <li>Team mentality, adaptability and solid time-management skills</li> </ul><p><br></p><p><strong>We offer</strong></p><ul> <li>Competitive remuneration scheme</li> <li>Meal coupons</li> <li>Private Medical &amp; Life Insurance</li> <li>Career development opportunities</li> </ul><p><br></p><p><strong>Your life @efood</strong></p><ul> <li>You will be a part of a fast-growing multinational company, member of the Delivery Hero holding, with the opportunity to acquire new skills and grow professionally.</li> <li>Υou will have the opportunity to function in an established, yet creative and fun working environment with genuine and ambitious people whose ultimate goal is to maintain efood as the ideal workplace. [In our maiden participation in 2020, we were awarded with a 5th place award from the Great Place to Work® Institute]</li> <li>Daily routine will be a thing of the past, as no day will be the same day as the one before</li> </ul>",
    "requirements": "",
    "link": "https://apply.workable.com/e-food/j/80D09F2149"
},
{
    "id": 1501592,
    "title": "Customer Care Agent - Part Time",
    "company": "e-food",
    "department": "Customer Care",
    "location": "Athens",
    "description": "<p>We are looking for someone who is customer oriented to deliver happiness to our customers (<strong>shifts: including evening &amp; night</strong>)! Are you enthusiastic? Energetic? Do you enjoy helping people and providing solutions? We are here to end world hunger and generate awesome brand love, thus we need someone with your skills to join our -great- cause! <br></p><p><br>You will be responsible for the communication with, both, our end users and partners, making sure that they receive the best customer experience.</p><p><br></p><p><strong>Apply if:</strong></p><ul> <li>You understand the difference between hungry and HANGRY</li> <li>You can meditate even with the most hardcore rock music playing in the background</li> <li>You will go straight to the restaurant and deliver the food yourself to our customers if you need to</li> <li>The term \"agent\" doesn't only mean you're part of the FBI, CIA etc.</li> <li>\"Call Center\" sounds like a \"Happiest Land Ever Created\" to you</li> </ul><p><br><strong>Seriously though, apply if:</strong></p><ul> <li>You have strong verbal and written communication skills in order to handle all our 3 channels: incoming calls, live chat and email.</li> <li>You are problem solving oriented and you have the ability to find the best solution to every customer related issue.</li> <li>You are a team player! Team spirit is necessary as you will be part of a highly interactive and dynamic team of customer care agents.</li> <li>Multitasking and critical thinking are required in order to prioritize and handle both incoming and outgoing contact.</li> <li>Strong understanding of customer expectations with a focus on quality driven support.</li> <li>Fluency in Greek and English is a must.</li> <li>Prior experience in customer service will be considered as a plus.</li> <li>Bachelor's degree will be considered as a plus.</li> <li>Part time work, 5 days a week, including weekends and national holidays.</li> </ul><p><br></p><p><strong>Your life @efood :</strong><br></p><ul> <li>You will be a part of a fast-growing multinational company, member of the Delivery Hero holding, with the opportunity to acquire new skills and grow professionally.</li> <li>Υou will have the opportunity to function in an established, yet creative and fun working environment with genuine and ambitious people whose ultimate goal is to maintain efood as the ideal workplace. [In our maiden participation in 2020, we were honoured with a 5th place award from the Great Place to Work® Institute]</li> <li>Daily routine will be a thing of the past, as no day will be the same day as the one before.</li> </ul>",
    "requirements": "",
    "link": "https://apply.workable.com/e-food/j/E19729ADC9"
},
{
    "id": 1564871,
    "title": "Dispatcher - Part Time",
    "company": "e-food",
    "department": "Operations",
    "location": "Athens",
    "description": "<p>Are you a multitasker that loves coordinating operational tasks?</p><p>Our Dispatch team is growing and we are looking for our new superstars that will take our Logistics operations above and beyond. </p><p>As a Dispatcher you will monitor \"delivered by efood\" orders in real-time, making sure all works immaculately. You will lift any blockers on our riders' way to the PERFECT delivery!<br><br></p><p>Join us and be part of the new era in logistics!!<br><br></p><p><strong>Responsibilities</strong></p><ul> <li>Monitor orders and handle issues from the watchlist</li> <li>Ensure that delivery zone performance and delays are on track.</li> <li>Make corrective actions whenever needed (even before needed)</li> <li>Handle incoming contact from vendors and riders through chat</li> <li>Monitor order routing and make adjustments</li> <li>Inform customers for their order status if and when needed.<br> </li> </ul><p><strong>Requirements</strong></p><ul> <li>High level of multitasking</li> <li>Problem-solving mindset</li> <li>Attention to detail</li> <li>Great communication skills</li> <li>Excellent computer skills</li> <li>Bachelor degree will be a plus</li> <li>Experience in a similar industry or customer care field will be a plus</li> <li>Excellent English verbal and written communication is a must</li> <li>Ability to work in a rotating weekly schedule of evening &amp; night shifts from Wednesday - Saturday including national holidays<br> </li> </ul><p><strong>We offer</strong></p><ul> <li>Competitive remuneration scheme</li> <li>Private Medical &amp; Life Insurance</li> <li>Meal coupons</li> <li>Career development opportunities<br> </li> </ul><p><strong>Your life @efood</strong><br></p><ul> <li>You will be a part of a fast-growing multinational company, member of the Delivery Hero holding, with the opportunity to acquire new skills and grow professionally.</li> <li>Υou will have the opportunity to function in an established, yet creative and fun working environment with genuine and ambitious people whose ultimate goal is to maintain efood as the ideal workplace. [In our maiden participation in 2020, we were honoured with a 5th place award from the Great Place to Work® Institute]</li> <li>Daily routine will be a thing of the past, as no day will be the same day as the one before.</li> </ul>",
    "requirements": "",
    "link": "https://apply.workable.com/e-food/j/F51AEE20E4"
},
{
    "id": 1563744,
    "title": "Talent Development Associate",
    "company": "e-food",
    "department": "HR",
    "location": "Athens",
    "description": "<p>We are looking for an experienced and passionate Talent Development Associate to join our Human Resources department to support the development, launch, and continued delivery of training programs that will advance the company’s performance and strengthen our culture. This role is critical to the execution and expansion of organization-wide learning programs as we rapidly scale.</p><p>If you think that knowledge shared is knowledge squared, we want to meet you!</p><p><br></p><p><strong>What you'll do</strong></p><ul> <li>Support the design, development and delivery of class and online trainings for the whole company.</li> <li>Manage scheduling and communications for our learning programs to deliver polished and professional experiences.</li> <li>Provide operational and technical support during virtual sessions, leveraging digital tools to engage learners.</li> <li>Consistently brainstorm ways we can improve the quality, efficiency, and scalability of our trainings (e.g., automating processes, templetizing communications, etc.)</li> <li>Assist in the creation of  processes and procedures required to launch and maintain new trainings.</li> <li>Partner with stakeholders to inspire advocacy of the training content and ensure high participation rates.</li> <li>Support team operations by proactively tracking, monitoring, and reporting on projects.</li> <li>Assist in the development and execution of company-wide learning initiatives that help us recruit, develop, and retain top talent.</li> </ul><p><strong>What you have</strong><br></p><ul> <li>At least 2 years of professional experience in HR, L&amp;D, Talent Development, or a related field.</li> <li>Strong project management skills and sharp attention to detail.</li> <li>Experience owning projects with multiple collaborators and stakeholders.</li> <li>Demonstrated ability to build and maintain relationships with individuals across all levels, departments.</li> <li>BSc in Human Resources Management, Organizational Psychology or relevant field. Additional education and certification on training will be a plus.</li> <li>Strong and confident communicator with excellent verbal and written skills.</li> <li>Ability to analyze data and present in a cohesive and concise manner.</li> <li>Proficiency in MS Office applications.</li> <li>Ownership and Team spirit.</li> </ul><p><strong>We offer</strong></p><ul> <li>Competitive remuneration scheme</li> <li>Meal coupons</li> <li>Private Medical &amp; Life Insurance</li> <li>Career development opportunities</li> </ul><p><strong>Your life @efood</strong><br></p><ul> <li>You will be a part of a fast-growing multinational company, member of the Delivery Hero holding, with the opportunity to acquire new skills and grow professionally.</li> <li>Υou will have the opportunity to function in an established, yet creative and fun working environment with genuine and ambitious people whose ultimate goal is to maintain efood as the ideal workplace. [In our maiden participation in 2020, we were honoured with a 5th place award from the Great Place to Work® Institute]</li> <li>Daily routine will be a thing of the past, as no day will be the same day as the one before.</li> </ul>",
    "requirements": "",
    "link": "https://apply.workable.com/e-food/j/194715FF4F"
},
{
    "id": 1563034,
    "title": "HR Generalist / Business Partner",
    "company": "e-food",
    "department": "Human Resources",
    "location": "Athens",
    "description": "<p><br></p><p>We are looking for an experienced and passionate <strong>HR Generalist / Business Partner</strong> to join our Human Resources department to contribute in the planning of the overall HR strategy and assist in creating and implementing HR policies and procedures. </p><p>If you are a creative problem solver who thrives when presented with a challenge, we want to meet you!</p><p><br></p><p><strong>What you'll do</strong></p><ul> <li>Consulting with line management and provide daily HR guidance</li> <li>Analyzing trends and metrics with the HR department</li> <li>Resolving complex employee relations issues and address grievances</li> <li>Work closely with line management and employees to improve work relationships, build morale and increase productivity and retention</li> <li>Monitor, guide and report on workforce, onboarding, employee engagement, succession planning, learning &amp; development.</li> <li>Identify training needs for teams and individuals</li> <li>Evaluate training programs</li> <li>Suggest new HR strategies</li> <li>Contribute in the development and implementation of human resource policies &amp; procedures and provide relevant counseling.</li> <li>Assist in performance management and employee evaluation.</li> <li>Support the development and implementation of HR initiatives and systems.</li> <li>Participate in the development and support of learning and development programs.</li> </ul><p><br></p><p><strong>What you have</strong></p><ul> <li>Proven work experience as an HR business partner, HR Generalist or HR Officer or similar role for at least 5 years.</li> <li>Excellent knowledge of various HR functions such as payroll &amp; benefits, reporting &amp; data analysis, onboarding, performance management, employee engagement, training &amp; development etc</li> <li>Degree in Human Resources Management</li> <li>Excellent people management and communication (verbal &amp; written) skills</li> <li>Analytical and goal oriented</li> <li>Demonstrable experience with HR metrics</li> <li>Thorough knowledge of labor legislation</li> <li>Full understanding of all HR functions and best practices</li> <li>Experience in Workday will be considered a plus.</li> <li>Proficiency in MS Office applications.</li> <li>Outstanding organisational, coordination and time-management skills.</li>    <li>Problem-solving and decision-making skills.</li> <li>Team spirit.</li> </ul><p></p><p></p><p><strong>We offer</strong></p><ul> <li>Competitive remuneration scheme</li> <li>Meal coupons</li> <li>Private Medical &amp; Life Insurance</li> <li>Career development opportunities</li> </ul><p><br></p><p><strong>Your life @efood</strong><br></p><ul> <li>You will be a part of a fast-growing multinational company, member of the Delivery Hero holding, with the opportunity to acquire new skills and grow professionally.</li> <li>Υou will have the opportunity to function in an established, yet creative and fun working environment with genuine and ambitious people whose ultimate goal is to maintain efood as the ideal workplace. [In our maiden participation in 2020, we were honoured with a 5th place award from the Great Place to Work® Institute]</li> <li>Daily routine will be a thing of the past, as no day will be the same day as the one before.</li> </ul>",
    "requirements": "",
    "link": "https://apply.workable.com/e-food/j/8145ABB490"
},
{
    "id": 1573387,
    "title": "Talent Acquisition Associate",
    "company": "e-food",
    "department": "Human Resources",
    "location": "Athens",
    "description": "<p>We are looking for a bright and energetic <strong>Talent Acquisition Associate </strong>to join our Human Resources department and help with our full-cycle recruiting.<br></p><p>You are the one for our team if you can seek and spot talent, can organize and handle massive recruitment, challenge yourself and know what it actually means to build relationships with your candidates. In Talent Acquisition, the responsibilities include sourcing candidates through various channels, planning interview and selection, supporting hiring managers, reporting and hosting or participating in career events.</p><p>At the end of the day, you will have strong talent pipelines for our company’s current and future hiring needs and be responsible for hiring qualified people while maintaining efood's great candidate experience.</p><p><br></p><p><strong>For this role you 'll have to :</strong></p><ul> <li>Coordinate with hiring managers to identify staffing needs and determine selection criteria</li> <li>Source potential candidates through online channels (e.g. social platforms and professional networks) / create and publish job ads in various portals</li> <li>Plan interview and selection procedures, including screening calls, assessments and in-person or video call interviews for high volume recruitment roles</li> <li>Assess candidate information, including resumes and contact details, using our Applicant Tracking System</li> <li>Design job descriptions and interview questions that reflect each position’s requirements</li> <li>Follow up with candidates and hiring teams throughout the hiring process</li> <li>Foster long-term relationships with past applicants and potential candidates</li> <li>Track hiring metrics including time-to-hire, time-to-fill and source of hire</li> </ul><p><br></p><p><strong>Qualifications for this role include :</strong></p><ul> <li>BSc in Human Resources Management, Organizational Psychology, Business Administration or relevant field</li> <li>Proven work experience as a Talent Acquisition Associate or similar role for at least 2 years</li> <li>Experience in high volume recruitment is a plus</li> <li>Familiarity with social media, ATSs and professional networks</li> <li>Hands-on experience with full-cycle recruiting using various interview techniques and evaluation methods</li> <li>Good reporting skills</li> <li>Strong interpersonal skills</li> <li>Excellent verbal and written communication skills</li> <li>A keen understanding of the differences between various roles within organizations</li> <li>Team spirit</li> </ul><p><br></p><p><strong>We offer :</strong></p><ul> <li>Competitive remuneration scheme</li> <li>Great Place to Work award winner working environment</li> <li>Private Medical &amp; Life Insurance</li> <li>Meal coupons</li> <li>Career development opportunities</li> <li>Free remote fitness courses</li> </ul><p><br></p><p><strong>Your life @efood :</strong></p><ul> <li>You will be a part of a fast-growing multinational company, member of the Delivery Hero holding, with the opportunity to acquire new skills and grow professionally.</li> <li>Moreover, you will have the opportunity to function in an established, yet creative and fun working environment with people who are genuine, ambitious and participate in a team that its highest goal is to maintain efood the ideal workplace.</li> </ul><p><br></p><p><br></p>",
    "requirements": "",
    "link": "https://apply.workable.com/e-food/j/D0A1AC3B55"
},
{
    "id": 1573257,
    "title": "Food Stylist",
    "company": "e-food",
    "department": "Business Development",
    "location": "Athens",
    "description": "<p>efood is looking for a <strong>Food Stylist</strong> who loves creating photos and videos, and can’t live without - well - food! If you are ready to work for the #1 online delivery service in Greece and contribute to communicating efood’s awesomeness, then you should definitely aim to join our rockstar team!<br></p><p><br></p><p><strong>What you'll do :</strong></p><ul> <li>Responsible for creating visually appealing food compositions for photos and videos</li> <li>Responsible for helping photographers set up equipment &amp; dishes</li> <li>Knows how to best utilize props such as silverware, plates and fabric to stylize the food</li> <li>Knows how to style to create the most delicious, shareable, mouthwatering looking food photo assets </li> <li>Understands and maintains consistency with brand guidelines</li> <li>Works well with others and can collaborate with people across company on different projects</li> </ul><p><br></p><p><strong>What you have:</strong></p><ul> <li>Creativity - it is the most essential asset after all </li> <li>Strong knowledge of industry styling trends</li> <li>Knowledge of digital photography, composition, color quality, and aesthetics.</li> <li>Sense of what will appeal to the customers</li> <li>Excellent communication skills in order to interface with photographer and clients/restaurants</li> <li>Attention to detail and strong organizational skills to ensure their work is efficient, timely, and meets all necessary specifications.</li> <li>Ability to juggle several projects in a timely manner with minimal supervision</li> <li>Adaptability to last-minute changes in schedules and be able to be flexible with planning</li> <li>Problem solving and critical thinking abilities</li> <li>Examples of your work from your Instagram or personal website</li> </ul><p><br></p><p><strong>Nice to have:</strong></p>  <ul> <li>further knowledge of Photo Editing </li> <li>Expertise in camera, lighting, and other professional photography equipment</li> <li>2+ years of experience</li> </ul><p><br></p><p><strong>We offer :</strong></p><ul> <li>Competitive remuneration scheme</li> <li>Great Place to Work award winner working environment</li> <li>Private Medical &amp; Life Insurance</li> <li>Meal coupons</li> <li>Career development opportunities</li> <li>Free remote fitness courses</li> </ul><p><br><strong>Your life @efood :</strong></p><ul> <li>You will be a part of a fast-growing multinational company, member of the Delivery Hero holding, with the opportunity to acquire new skills and grow professionally.</li> <li>Moreover, you will have the opportunity to function in an established, yet creative and fun working environment with people who are genuine, ambitious and participate in a team that its highest goal is to maintain efood the ideal workplace.</li> </ul>",
    "requirements": "",
    "link": "https://apply.workable.com/e-food/j/819B9E28D0"
},
{
    "id": 1573251,
    "title": "Food Photographer",
    "company": "e-food",
    "department": "Business Development",
    "location": "Athens",
    "description": "<p>efood is looking for a Food Photographer who loves -well- food! If you are ready to make the burger shine, the pizza roll, and the cookies crumble - and to work for the #1 online delivery service in Greece and contribute to communicating efood’s awesomeness, then you should definitely aim to join our rockstar team!</p><p><br></p> <p><strong>Job Description :</strong></p><ul><li>Photograph cover images and beautiful food compositions for partner shops</li></ul><ul> <li>Photograph meals and other related products weekly (5 shoots per week on average)</li> <li>Oversee lighting setup and image quality</li> <li>Execute standard photography operation procedures including tools, processes</li> <li>Maintain consistency with efood’s brand standards and guidelines</li> <li>Learn the products inside and out to be able to translate them into meaningful visual content</li> <li>Collaboration with food stylist, photo editor and other team members</li> </ul><p><strong><br>Requirements :</strong></p><ul> <li>Proven work experience as a food photographer (please attach portfolio of real experience)</li> <li>Excellent communication skills when dealing with shop owners and kitchen staff</li> <li>Ability to collaborate well with others and follow feedback</li> <li>Immaculate eye for detail &amp; a perfectionist nature</li> <li>Creative mind and critical thinking</li> <li>Keep track of the deadlines &amp; time sensitive procedures</li> <li>Time-management skills</li> <li>Thorough knowledge of computer imaging, photographic techniques and color composition</li> <li>Keep equipment up to date, organized, and maintained</li> <li>Stay up to date with new food photography, product, consumer buying trends</li> <li>Willingness to travel</li> <li>Degree in photography, visual arts, digital media or related field</li> </ul> <p><strong><br>Nice to have :</strong></p><ul> <li>Experience with digital technology and photo editing software packages (e.g. Photoshop, Pixlr and Affinity Photo)</li> <li>Food styling techniques knowledge<br> </li> </ul><p><strong><br>We offer :</strong></p><ul> <li>Competitive remuneration scheme</li> <li>Great Place to Work award winner working environment</li> <li>Private Medical &amp; Life Insurance</li> <li>Meal coupons</li> <li>Career development opportunities</li> <li>Free remote fitness courses</li> </ul><p><br><strong>Your life @efood :</strong></p><ul> <li>You will be a part of a fast-growing multinational company, member of the Delivery Hero holding, with the opportunity to acquire new skills and grow professionally.</li> <li>Moreover, you will have the opportunity to function in an established, yet creative and fun working environment with people who are genuine, ambitious and participate in a team that its highest goal is to maintain efood the ideal workplace.</li> </ul>",
    "requirements": "",
    "link": "https://apply.workable.com/e-food/j/3ECBAC26A0"
},
{
    "id": 1411214,
    "title": "Paid Social Campaign Manager",
    "company": "e-food",
    "department": "Marketing",
    "location": "Athens",
    "description": "<p>efood’s Performance Marketing team is looking for a passionate Paid Social campaign manager that will focus on Facebook &amp; Display advertising. If you are an A-player, want to get your hands dirty, wish to implement strategies that drive growth and always willing to learn, then efood is the right place for you!<br><br></p><p><br></p><p><strong>What you’ll do: </strong></p><ul> <li>End-to End-Campaign management: Set-up, launch, measure and optimize advertising campaigns on Facebook, Instagram, GDN, YouTube</li> <li>Researching and testing new features, trends and ideas. Constantly challenging the status quo by identifying both new and improved execution strategies that will increase overall performance and efficiency, in turn leading to higher user satisfaction and retention.</li> <li>Strategic Planning &amp; Execution: Assist in the media strategy development with complete control of tactical execution of campaign.</li> <li>Monitoring and challenging acquisition and order funnels in order to improve CVRs and performance of marketing campaigns.</li> <li>Understanding of a creative’s impact in performance marketing and constantly working in a feedback loop with the design team.</li> <li>Develop processes, best practices and automation that will help elevate campaign reach to the next level</li> </ul><p><br></p> <p><strong>What you have:<br></strong></p> <ul> <li>Deep expertise on Facebook ads with usage of both hard sell and soft sell objectives</li> <li>Experience on Google ads, mostly with Display, Video and App advertising</li> <li>Educated around User acquisition and Growth strategies in the digital world</li> <li>Good understanding of CRM and email marketing fundamentals and their potential synergies with rest performance marketing channels</li> <li>Experience with A/B Testing. Testing mindset: Test everything that matters</li> <li>Deep knowledge of Analytics fundamentals and past experience with Google Analytics and Tag Manager</li> <li>Understanding of how tracking works across platforms</li> <li>A strong disposition for data-driven decision making; you like to play around with data and cut it in many different ways to find interesting insights that can help the business</li> <li>Excel skills : know your way around pivot tables </li> <li>Ability to manage and prioritize multiple projects at once</li> <li>Team spirit that can work with multiple people from different backgrounds and expertise<br> </li> </ul><p><br></p> <p><strong>Nice to have:<br></strong></p> <ul> <li>Bachelor/MSc in Computer Science, Statistics, Mathematics, Physics or Engineering</li> <li>SQL / Python hands-on experience</li> <li>Experience with Programmatic advertising</li> <li>HTML / CSS basic understanding </li> </ul><p><br><br></p><p><strong>We offer:</strong></p><ul> <li>Competitive remuneration scheme</li> <li>Meal coupons</li> <li>Medical &amp; Life Insurance</li> <li>Career development opportunities<br><br><br> </li> </ul><p><strong>Your life @efood :</strong></p><ul> <li>You will be a part of a fast-growing multinational company, member of the Delivery Hero holding, with the opportunity to acquire new skills and grow professionally.</li> <li>Υou will have the opportunity to function in an established, yet creative and fun working environment with genuine and ambitious people whose ultimate goal is to maintain efood as the ideal workplace. [In our maiden participation in 2020, we were honoured with a 5th place award from the Great Place to Work® Institute]</li> <li>Daily routine will be a thing of the past, as no day will be the same day as the one before.</li> </ul>",
    "requirements": "",
    "link": "https://apply.workable.com/e-food/j/4132560A60"
},
{
    "id": 1508454,
    "title": "IT General Controls Specialist",
    "company": "e-food",
    "department": "Finance",
    "location": "Athens",
    "description": "<p>We are looking for an <strong>IT General Controls Specialist</strong> to join our Governance team in direct cooperation with our central Delivery Hero SE GRC team.</p><p>This is a chance to be part of a rapidly growing team in a company that is changing the food delivery landscape.</p><p><strong>Will you join us?</strong><br></p><p><br></p><p><strong>Main duties:</strong></p><ul> <li>Identify, assess, manage, mitigate, and monitor IT risks, in IT processes and company systems of our entities in Greece, Cyprus &amp; Balkans</li> <li>Design, update and broadcast IT general controls for the IT risks to be mitigated</li> <li>Proactively plan and manage global ITGC rollouts/re-assessment, and issue reports to management</li> <li>Drive Internal control system forward by analyzing and improving existing processes and frameworks</li> <li>Implement control framework designed by Parent company,</li> <li>Support IT related projects or stakeholders providing input to ensure early stage ITGC consideration.</li> <li>Support external &amp; Internal audits</li> </ul><p><br></p><p><br></p><p><strong>Requirements:</strong><br></p><ul> <li>Master and/ or bachelor’s degree in IT, Statistics or related areas</li> <li>Minimum 4 years of professional experience in a major IT, Consulting company with a focus on IT systems or IT Audit, Big-4 experience will be considered as a plus</li> <li>Process-oriented and problem-solving mentality</li> <li>Excellent teamwork skills</li> <li>Advanced MS Excel skills</li> <li>Excellent use of English, written and oral communication skills,</li> <li>Ability to adjust in an international environment</li> </ul><p><br></p><p><strong>We offer</strong><br></p><ul> <li>Competitive remuneration scheme</li> <li>  Private Medical &amp; Life Insurance</li> <li>  Meal coupons</li> <li>  Career development opportunities</li> </ul><p><br></p><p><strong>Your life @efood</strong><br></p><ul> <li>You will be a part of a fast-growing multinational company, member of the Delivery Hero holding, with the opportunity to acquire new skills and grow professionally.</li> <li>Υou will have the opportunity to function in an established, yet creative and fun working environment with genuine and ambitious people whose ultimate goal is to maintain efood as the ideal workplace. [In our maiden participation in 2020, we were honoured with a 5th place award from the Great Place to Work® Institute]</li> <li>Daily routine will be a thing of the past, as no day will be the same as the one before.</li> </ul>",
    "requirements": "",
    "link": "https://apply.workable.com/e-food/j/E7928F5B1A"
},
{
    "id": 1573155,
    "title": "HR Ops Associate",
    "company": "e-food",
    "department": "Human Resources",
    "location": "Athens",
    "description": "<p>We are looking for an <strong>HR Ops Associate</strong> to help our HR Ops team and handle a variety of personnel-related and payroll duties. The ideal candidate has gained experience in payroll and HR processes, is organised and can handle various administrative tasks in a timely manner. This is a chance to be part of a rapidly growing team in a company that is changing the food delivery landscape, and be able to influence, execute and see the impact of your work at the end of the day.</p><p><br></p><p><strong>Responsibilities (subject but not limited to):</strong></p><ul>  <li>Assist with day to day operations of the HR      functions and duties</li>  <li>Compile      and update employee records (hard and soft copies)</li>  <li>Update      internal databases in a timely manner</li>  <li>Prepare      and file HR Documents (contracts, forms etc) in hard and soft copies</li>  <li>Process      hiring documentation</li>  <li>Implement      the operational onboarding and offboarding process</li>  <li>Assist      in payroll preparation by providing relevant data</li>  <li>Communicate      with public services when necessary</li>  <li>Participate      in HR projects</li> </ul><p><strong><br>Apply if you have:</strong></p><ul>  <li>BSc preferably in Accounting or Human Resources</li>  <li>Experience      in Payroll</li>  <li>Hands-on      experience with an HR Software</li>  <li>High      level attention to detail and numerical literacy.</li>  <li>Basic      knowledge of labour laws</li>  <li>Excellent      proven organizational skills, with the ability to prioritize</li>  <li>Strong      phone, email and in-person communication skills</li>  <li>Computer      literacy</li>  <li>People-oriented      personality; you are approachable, good listener, easy to talk to</li>  <li>Good      sense of responsibility and commitment to confidentiality</li>  <li>Highest      levels of integrity</li> </ul><p><strong><br>We offer:</strong></p><ul>  <li>Competitive remuneration scheme</li>  <li>Meal      coupons</li>  <li>Private      Medical &amp; Life Insurance</li>  <li>Career      development opportunities</li> </ul><p><strong><br>Your life @efood:</strong></p><ul>  <li>You will be a part of a fast-growing      multinational company, member of the Delivery Hero holding, with the      opportunity to acquire new skills and grow professionally.</li>  <li>Υou      will have the opportunity to function in an established, yet creative and      fun working environment with genuine and ambitious people whose ultimate      goal is to maintain efood as the ideal workplace. [In our maiden      participation in 2020, we were honoured with a 5th place award from the      Great Place to Work® Institute]</li>  <li>Daily      routine will be a thing of the past, as no day will be the same day like      the one before.</li> </ul>",
    "requirements": "",
    "link": "https://apply.workable.com/e-food/j/E96651F227"
},
{
    "id": 1572923,
    "title": "Customer Care Team Leader",
    "company": "e-food",
    "department": "Customer Care",
    "location": "Athens",
    "description": "<p><strong>efood is looking for a Customer Care Team Leader to welcome in its family!</strong><br></p><p>We are looking for a fair and kind Leader, full of passion and ready to inspire, with logical thinking, creative problem solving and good time management skills to complete our leadership team.</p><p><br></p><p>Working in shifts and public holidays, 5 days a week, you will need among other things, to coordinate several tasks, motivate our customer care agents and rectify their shortcomings. Creating an inspiring team environment with an open communication culture as well as delegating tasks and setting deadlines or specific targets for your team.</p><p><br></p><p><strong>For this role you 'll have to :</strong></p><ul> <li>Build trust between team members</li> <li>Inspire and motivate teamwork for achieving goals</li> <li>Influence valuable changes and positive outcomes</li> <li>Recognize and acknowledge the skills of key team members and utilize their strengths to the benefit of the team</li> <li>Mediate disagreements between members</li> <li>Evaluate results and provide feedback to Head of Customer Care on a monthly basis</li> <li>Oversee and coordinate the customer care agents' day-to-day tasks ensuring policies and procedures are followed</li> <li>Management of demanding issues that might come up during a shift.  </li> <li>Daily shift reporting  to Head of Customer Care</li> <li>Support the shift and deal with anything that might come up, ensuring proper communication through relevant channels  </li> </ul><p><br></p><p><strong>Qualifications for this role include :</strong></p><ul> <li>Proven work experience as a team leader or supervisor</li> <li>Solid computer skills, especially MS Excel</li> <li>Good knowledge of performance metrics</li> <li>Excellent interpersonal, communication and leadership skills</li> <li>Organizational and time-management skills</li> <li>Natural charisma and leadership</li> <li>Ability to make quick and smart decisions under pressure</li> <li>Sense of ownership and pride in team's performance</li> <li>Ability to act proactively to ensure smooth team operations and effective collaboration</li> </ul><p><br></p><p><strong>We offer :</strong></p><ul> <li>Competitive remuneration scheme</li> <li>Meal coupons</li> <li>Medical &amp; Life Insurance</li> <li>Career development opportunities</li> </ul><p><br></p><p><strong>Your life @efood :</strong></p><ul> <li>You will be a part of a fast-growing multinational company, member of the Delivery Hero holding, with the opportunity to acquire new skills and grow professionally.</li> <li>Υou will have the opportunity to function in an established, yet creative and fun working environment with genuine and ambitious people whose ultimate goal is to maintain efood as the ideal workplace. [In our maiden participation in 2020, we were honoured with a 5th place award from the Great Place to Work® Institute]</li> <li>Daily routine will be a thing of the past, as no day will be the same day as the one before.</li> </ul>",
    "requirements": "",
    "link": "https://apply.workable.com/e-food/j/A3435C7115"
},
{
    "id": 1472300,
    "title": "Talent Acquisition Team Manager",
    "company": "e-food",
    "department": "Human Resources",
    "location": "Athens",
    "description": "<p>We are looking for a brilliant <strong>Talent Acquisition Team Manager</strong> to become the maestro of our growing Talent Acquisition team.</p><p>You already have extensive experience in Talent Acquisition, have led successfully a team of recruiters and know your way in employer branding.</p><p>In the Talent Acquisition team, we source candidates through various channels, plan interviews and selection flows, support our hiring managers (also, each other) and can host or participate in career events.</p><p>Your goal will be to organise, guide, inspire and monitor the duties, actions and efforts of our TA team to build strong talent pipelines, to hire the best talent and to make sure our candidates have the best experience during our selection process.</p><p><br></p><p><strong>For this role you'll have to :</strong></p><ul> <li>Coordinate and support the team in their day-to-day tasks</li> <li>Plan projects and initiatives</li> <li>Develop talent acquisition strategies and hiring plans</li> <li>Assess team performance</li> <li>Coach and nurture the entire team</li> <li>Find solutions and lift blockers </li> <li>Deploy employer branding strategies</li> <li>Organize and attend job fairs and recruitment events</li> <li>Track hiring metrics and run a seamless reporting scheme</li> <li>Hands on end to end recruitment for positions of various functions and levels</li> </ul><p><br></p><p><strong>Qualifications for this role include :</strong></p><ul> <li>Proven work experience as a Talent Acquisition Team Manager/Coordinator or similar role for at least 3 years</li> <li>BSc in  Human Resources Management, Organizational Psychology, Business Administration or relevant field. Additional HR education and certification will be a plus</li> <li>Work experience in a tech environment is a plus</li> <li>Exceptional team leading skills</li> <li>Organizational, coordination and time management skills</li> <li>Results driven professional</li> <li>Excellent verbal and written communication skills</li> <li>Proficient knowledge of ATS system and office applications</li> <li>Problem-solving and decision making skills</li> <li>Team spirit</li> </ul><p><br></p><p><strong>We offer :</strong></p><ul> <li>Competitive remuneration scheme</li> <li>Private Medical &amp; Life Insurance</li> <li>Meal coupons</li> <li>Career development opportunities</li> <li>Great Place to Work award winner working environment (5th place)</li> </ul><p><br></p><p><strong>Your life @efood :</strong></p><ul> <li>You will be a part of a fast-growing multinational company, member of the Delivery Hero holding, with the opportunity to acquire new skills and grow professionally.</li> <li>Moreover, you will have the opportunity to function in an established, yet creative and fun working environment with people who are genuine, ambitious and participate in a team that its highest goal is to maintain efood the ideal workplace.eama</li> </ul>",
    "requirements": "",
    "link": "https://apply.workable.com/e-food/j/AB213A29AF"
},
{
    "id": 1575103,
    "title": "Android Engineer",
    "company": "e-food",
    "department": "Information Technology",
    "location": "Athens",
    "description": "<p>We are in the unique position to experience new and interesting situations that many companies have never seen before. We bake challenges by using <strong>agile </strong>methodologies, <strong>top line tools </strong>and of course always working with the <strong>best of </strong><strong>teams</strong>.</p>  <p>This is a chance to be part of a rapidly growing team in a company that is changing the food delivery landscape, and be able to influence, execute and see the impact of your work at the end of the day. If you are an experienced <strong>Android Engineer</strong> with strong technical background and “get-things-done” attitude, then challenge yourself by joining our <strong>#techteam </strong>and make an impact!</p>    <p><strong>About the role:</strong></p>  <ul>  <li>Build      apps for phones and devices, making good use of all the latest APIs while      maintaining support for older versions of Android.</li>  <li>Take part in designing and      implementing new features from scratch.</li>  <li>Work with our Design and      Analytics team to create pixel perfect, usable and data driven apps.</li>  <li>Track down and resolve      issues.</li>  <li>Keep up with the latest SDK,      tools and conventions.</li> </ul>    <p><strong>Key requirements:</strong></p>  <ul>  <li>University      and/or Postgraduate Degree in Computer Science, Computer Engineering or      equivalent</li>  <li>At least 2 years of      professional experience in Android development</li>  <li>Released at least one      Android App</li>  <li>Excellent knowledge of      Kotlin and Java</li>  <li>Experience with one or more      of the following architecture design patterns: MVP, MVVM, Clean      architecture</li>  <li>Holistic knowledge and      passion for the platform</li>  <li>Experience in modern,      distributed version control (we use Git and accompanying flows)</li>  <li>Excellent eye for detail and      a self-motivated problem solver</li>  <li>Superior analytical skills      and a strong sense of urgency and ownership in your work</li>  <li>Strong communication and collaboration      skills (English is a must)</li> </ul>    <p><strong>Nice to have:</strong></p>  <ul>  <li>Experience      with the following: Retrofit, RxKotlin, EventBus, Dagger</li>  <li>Experience with Test Driven      Development</li>  <li>Familiarity with      integration/functional/UI Automation testing</li>  <li>Analytic tool experience and      data driven culture</li>  <li>Experience with tracking      tools (Firebase, Google tag manager, etc)</li> </ul>    <p><strong>We offer:</strong></p>  <ul>  <li>Competitive      remuneration scheme</li>  <li>Meal coupons</li>  <li>Private Medical &amp; Life      Insurance</li>  <li>Career development      opportunities</li>  <li>Free remote fitness courses</li> </ul>    <p><strong>Your life @efood:</strong></p>  <ul>  <li>You      will be a part of a fast-growing multinational company, member of the      Delivery Hero holding, with the opportunity to acquire new skills and grow      professionally.</li>  <li>Υou will have the      opportunity to function in an established, yet creative and fun working      environment with genuine and ambitious people whose ultimate goal is to      maintain efood as the ideal workplace. [In our maiden participation in      2020, we were honored with a 5th place award from the Great Place to Work®      Institute]</li>  <li>Daily routine will be a      thing of the past, as no day will be the same day as the one before.</li> </ul>",
    "requirements": "",
    "link": "https://apply.workable.com/e-food/j/954E8758B6"
},
{
    "id": 1575046,
    "title": "Photo Editor",
    "company": "e-food",
    "department": "Marketing",
    "location": "Athens",
    "description": "<p><br></p><p>efood is looking for a <strong>Photo Editor</strong> who loves photography and can’t live without -well- food! If you are ready to work for the #1online delivery service in Greece and contribute to communicating efood’s awesomeness, then you should definitely aim to join our rockstar team!</p><p><br><strong>What you'll be doing :</strong></p><ul> <li>Editing &amp; manipulation of food photography to make everything look super yummy while achieving highest quality</li> <li>Review photos, curate libraries and prepare photo albums</li> <li>Coordinate assignments by selecting, editing and uploading photos</li> <li>Collaborate with photographer and team members to decide on which photos will be uploaded</li> </ul><p><br></p><p><strong>You are characterized by :</strong></p><ul> <li>Proven work experience as a Photo Editor</li> <li>Solid experience with digital technology and photo editing software packages (e.g. Photoshop, Pixlr and Affinity Photo)</li> <li>Strong photo editing skills and excellent portfolio</li> <li>Thorough knowledge of computer imaging, photographic techniques and color composition</li> <li>Stay up to date with new image editing technologies</li> <li>Keep track of the deadlines</li> <li>Creative mind with an eye for detail</li> <li>Time-management skills</li> <li>Degree in photography, visual arts, digital media or related field</li> </ul><p><br></p><p><strong>Nice to have :</strong></p><ul><li>Experience in camera, lighting, and other professional photography equipment</li></ul><p><br></p><p><strong>We offer :</strong></p><ul> <li>Competitive remuneration scheme</li> <li>Great Place to Work award winner working environment</li> <li>Private Medical &amp; Life Insurance</li> <li>Meal coupons</li> <li>Career development opportunities</li> <li>Free remote fitness courses</li> </ul><p><br><strong>Your life @efood :</strong></p><ul> <li>You will be a part of a fast-growing multinational company, member of the Delivery Hero holding, with the opportunity to acquire new skills and grow professionally.</li> <li>Moreover, you will have the opportunity to function in an established, yet creative and fun working environment with people who are genuine, ambitious and participate in a team that its highest goal is to maintain efood the ideal workplace.</li> </ul>",
    "requirements": "",
    "link": "https://apply.workable.com/e-food/j/CC45DFB0C4"
},
{
    "id": 1198868,
    "title": "Software Engineer (Go, Node.js)",
    "company": "e-food",
    "department": "Information Technology",
    "location": "Athens",
    "description": "<p>We are in the unique position to experience new and interesting situations that many companies have never seen before. We bake challenges by using <strong>agile</strong> methodologies,<strong> top line tools</strong> and of course always working with the best of teams.</p><p>This is a chance to be part of a rapidly growing team in a company that is changing the food delivery landscape, and be able to influence, execute and see the impact of your work at the end of the day.</p><p>We are looking for an experienced and passionate <strong>Software Engineer</strong> to work on user-facing and internal tools, providing high quality work products that drive our business. We are a team of energetic, motivated and restless tech enthusiasts that take on the challenge of empowering our customers and internal users. We do that by providing them with the necessary intuitive technologies through creating a wide range of software solutions.</p><p>If these sound like you, then challenge yourself by joining our <strong>#techteam</strong> and make an impact!</p><p><strong>About the role:</strong></p><ul> <li>Design, implement and maintain complex, yet sophisticated and usable web and desktop applications.</li> <li>Test your code to assure quality of new and existing functionality.</li> <li>Work closely with Product Owners, Developers, DevOps engineers and Tech leads as part of an agile team, to meet and exceed the stakeholders' expectations.</li> <li>Experiment with new frameworks and technologies and learn continuously.</li> </ul><p><strong>Key requirements :</strong></p><ul> <li>University and/or Postgraduate Degree in Computer Science, Computer Engineering or equivalent</li> <li>At least 3 years of experience in full-stack development</li> <li>Excellent knowledge of at least one programming languages (Go, PHP, Node.js, Javascript)</li> <li>Knowledge of relational and non-relational database systems (e.g. MongoDB, Redis, PostGres)</li> <li>Familiarity with SOLID principles and software design patterns</li> <li>Experience consuming and developing REST APIs</li> <li>Excellent eye for detail and a self-motivated problem solver</li> <li>Superior analytical skills and a strong sense of urgency and ownership in your work</li> <li>Strong communication and collaboration skills (English is a must)</li> </ul><p><strong>Nice to have:</strong></p><ul> <li>Comfort in TDD and other testing practices</li> <li>Familiarity with at least one major cloud services provider (experience with AWS is a plus)</li> <li>Knowledge of at least one scripting language (e.g. Python)</li> <li>Experience working in an Agile team (Scrum/Kanban/XP)</li> <li>Involvement with open source projects is a plus.</li> </ul><p><strong>We offer :</strong></p><ul> <li>Competitive remuneration scheme</li> <li>Meal coupons</li> <li>Private Medical &amp; Life Insurance</li> <li>Career development opportunities</li> <li>Free remote fitness courses</li> </ul><p><strong>Your life @efood :</strong></p><ul> <li>You will be a part of a fast-growing multinational company, member of the Delivery Hero holding, with the opportunity to acquire new skills and grow professionally.</li> <li>Υou will have the opportunity to function in an established, yet creative and fun working environment with genuine and ambitious people whose ultimate goal is to maintain efood as the ideal workplace. [In our maiden participation in 2020, we were honoured with a 5th place award from the Great Place to Work® Institute]</li> <li>Daily routine will be a thing of the past, as no day will be the same day as the one before.</li> </ul>",
    "requirements": "",
    "link": "https://apply.workable.com/e-food/j/87AD39071C"
},
{
    "id": 1581623,
    "title": "Front-End Engineer (React.js, Node.js)",
    "company": "e-food",
    "department": "Information Technology",
    "location": "Athens",
    "description": "<p>We are in the unique position to experience new and interesting situations that many companies have never seen before. We bake challenges by using <strong>agile </strong>methodologies, <strong>top line tools</strong> and of course always working with the <strong>best of team</strong><strong>s</strong>.</p> <p>This is a chance to be part of a rapidly growing team in a company that is changing the food delivery landscape, and be able to influence, execute and see the impact of your work at the end of the day. If you are an experienced <strong>Front-End Engineer</strong> with strong technical background and “get-things-done” attitude, then challenge yourself by joining our <strong>#techteam</strong> and make an impact!</p><p><strong>About the role:</strong></p><ul> <li>Design,      implement and maintain complex, yet sophisticated and usable web apps.</li>  <li>Test your code to assure quality of new and      existing functionality.</li>  <li>Work closely with Product Owners, Software      Engineers, DevOps engineers and Tech leads as part of an agile team, to      meet and exceed the stakeholders' expectations.</li>  <li>Experiment with new frameworks and      technologies and learn continuously.</li> </ul><p><strong>Key Requirements:</strong></p><ul>  <li>University      and/or Postgraduate Degree in Computer Science, Computer Engineering or      equivalent</li>  <li>At least 2 years of experience in Front-End      development</li>  <li>Deep understanding of the whole web application      development life-cycle</li>  <li>Thorough knowledge of web standards and      protocols such as HTTP and REST</li>  <li>Experience with the latest features of      Javascript in ES6+</li>  <li>Experience with modern MV* frameworks (React,      Vue.js) and their ecosystem e.g. Flux pattern state management, routing</li>  <li>Knowledge of modern bundlers like Webpack or      Rollup and their build process and configuration</li>  <li>Knowledge of CSS and CSS extension languages      (preferably Sass)</li>  <li>Experience with responsive design and      knowledge of basic UX principles</li>  <li>Excellent eye for detail and a self-motivated      problem solver</li>  <li>Superior analytical skills and a strong sense      of urgency and ownership in your work</li>  <li>Strong communication and collaboration skills      (English is a must)</li> </ul><p><strong>Nice to have:</strong></p><ul>  <li>Familiar      working with agile methodologies (Scrum/Kanban/XP)</li>  <li>Ability to transform mockups and wireframes      into HTML/CSS</li>  <li>Experience with best practices and frameworks      (e.g. Jest)</li>  <li>Experience with TypeScript</li>  <li>Experience working with back-end systems      (Node.js/ Express, PHP or .NET) will be considered a plus</li> </ul><p><strong>We offer:</strong></p><ul>  <li>Competitive      remuneration scheme</li>  <li>Meal coupons</li>  <li>Private Medical &amp; Life Insurance</li>  <li>Career development opportunities</li>  <li>Free fitness courses (remote sessions included)</li> </ul><p><strong>Your life @ efood:</strong></p><ul>  <li>You      will be a part of a fast-growing multinational company, member of the      Delivery Hero holding, with the opportunity to acquire new skills and grow      professionally.</li>  <li>You will have the opportunity to function in      an established, yet creative and fun working environment with genuine and      ambitious people whose ultimate goal is to maintain efood as the ideal      workplace. [In our maiden participation in 2020, we were honored with a      5th place award from the Great Place to Work® Institute]</li>  <li>Daily routine will be a thing of the past, as      no day will be the same day as the one before.</li> </ul>",
    "requirements": "",
    "link": "https://apply.workable.com/e-food/j/367392B965"
},
{
    "id": 1581559,
    "title": "Photography Manager",
    "company": "e-food",
    "department": "Business Development",
    "location": "Athens",
    "description": "<p>We are looking for an iconic <strong>Photography Manager</strong> to join efood!</p><p><br></p><p>As the Photography Manager, you are responsible for all photography on efood, end to end. You mentor and collaborate with our Food Photographers, Food stylists and editors on the development and quality assurance of the efood visual language. You work in a cross-functional, agile environment to help the photography team to grow through mentorship, empowerment, and a hands-on mentality. You are responsible for building an environment in which all photographers continuously evolve and grow by driving personal development in one-on-ones, moderating workshops/feedback meetings with the larger group, and identifying and recruiting top talent to join the team as needed. You will also be responsible for the operations behind the photography team and everything that it entails to run it successfully.</p><p><br></p><p><strong>About the role :<br></strong></p><ul> <li> You oversee and coordinate photography weekly feedback meetings, photography capacity, planning, and execution for both internal projects and those we work on in collaboration with our partners.</li> <li>You coach and empower the team to deliver high quality images, and support them by managing stakeholders and expectations, as well as identifying the tools/props they need to succeed.</li> <li>You ensure our images are consistent across all channels and products and that our corporate identity is represented and developed in the best way possible.</li> <li>You work closely with the Branding department and the lead of Design to further develop and visualize how the efood visual language can and should evolve.</li> <li>You coordinate and oversee all photoshoot bookings (with support from team)</li> <li> You manage albums uploading (from photographers, to edited images that must be uploaded to our database)</li> <li>You facilitate general requests for these operations to run as smoothly as possible </li> <li>You research and prioritize which restaurants to shoot and in which areas, as well as catalogue what progress has been made so far</li> <li>You oversee budgeting and monitoring targets for photoshoots, planning the year ahead</li> <li>You lead the global assets operations (long term process of building an assets library for generic images)</li> <li>You drive and manage reporting on all the above-mentioned issues </li> </ul><p><br><strong>Key Requirements :<br></strong></p><ul> <li>You have excellent organizational &amp; communication skills and an ability to manage multiple projects at once.</li> <li>You have a strong photography portfolio that showcases a wide variety of projects and your skills and experience with food photography.</li> <li>You are passionate about photography and have an up-to-date understanding of best practices and trends, especially in food styling, composition, and set design.</li> <li>You have experience in leading a team with a mindset for empowering, motivating, and encouraging personal development</li> <li>You are inspired by food and telling stories around it, and therefore, style and build atmospheric sets that make the food shine.</li> <li>You have strong English skills.</li> </ul><p><br><strong>We offer :</strong></p><ul> <li>Competitive remuneration scheme</li> <li>Meal coupons</li> <li>Private Medical &amp; Life Insurance</li> <li>Career development opportunities</li> <li>Free fitness courses (remote sessions included)</li> </ul><p><br><strong>Your life @ efood :</strong></p><p>You will be a part of a fast-growing multinational company, member of the Delivery Hero holding, with the opportunity to acquire new skills and grow professionally.</p><p>You will have the opportunity to function in an established, yet creative and fun working environment with genuine and ambitious people whose ultimate goal is to maintain efood as the ideal workplace. [In our maiden participation in 2020, we were honored with a 5th place award from the Great Place to Work® Institute]</p><p>Daily routine will be a thing of the past, as no day will be the same as the one before.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/e-food/j/DE5469B7BE"
},
{
    "id": 1581544,
    "title": "Technical Support Specialist",
    "company": "e-food",
    "department": "Technical Support",
    "location": "Athens",
    "description": "<p>As a <strong>Technical Support Specialist</strong>, you will be part of our Customer Care Department with the main objective to provide excellent service to our partners regarding technical matters.</p><p><br></p><p><strong>Responsibilities</strong><br></p><ul>  <li>Professionally handle incoming requests      for corporate partners' inductions to our systems and ensure tools      and resources are best utilized</li>  <li>Thoroughly and efficiently solve any      technical issues with system updates and maintenance of the equipment</li>  <li>Educate partners where applicable      regarding the use of equipment and systems</li>  <li>Assist partners with questions and orders      via phone, email, and chat</li>  <li>Respond to partner complaints and      technical inquiries professionally, address concerns to the appropriate      department, when needed</li>  <li>Provide back up or assistance to other      customer care teams as required</li> </ul><p><br></p><p><strong>Requirements</strong><br></p><ul>  <li>Experience in customer service and/or      technical support roles</li>  <li>BSc in Computer Science will be      considered an asset</li>  <li>Good knowledge of English language</li>  <li>Strong verbal and written communication skills</li>  <li>Multitasking skills</li>  <li>Problem solving</li>  <li>Strong interpersonal skills</li> </ul><p><br></p><p><strong>We offer</strong><br></p><ul> <li>Competitive remuneration scheme</li> <li>Meal coupons</li> <li>Private Medical &amp; Life Insurance</li> <li>Career development opportunities</li> <li>Free fitness courses (remote sessions included)</li> </ul><p><br></p><p><strong>Your life @efood</strong><br></p><ul> <li>You will be a part of a fast-growing multinational company, member of the Delivery Hero holding, with the opportunity to acquire new skills and grow professionally.</li> <li>Υou will have the opportunity to function in an established, yet creative and fun working environment with genuine and ambitious people whose ultimate goal is to maintain efood as the ideal workplace. [In our maiden participation in 2020, we were honoured with a 5th place award from the Great Place to Work® Institute]</li> <li>Daily routine will be a thing of the past, as no day will be the same as the one before.</li> </ul>",
    "requirements": "",
    "link": "https://apply.workable.com/e-food/j/EF4E8BE0E1"
},
{
    "id": 1581329,
    "title": "Operations Excellence Manager",
    "company": "e-food",
    "department": "Operations",
    "location": "Athens",
    "description": "<p>We are looking for a rock star <strong>Operations Excellence Manager</strong> to join our team!</p> <p>As our Operations Excellence Manager you will be responsible for optimizing existing Operations and cross departmental processes, introducing new ones, monitoring KPIs and ensuring best practices are standardized across different Operations teams in order to offer the best customer experience to our customers and partners</p> If you have a strong passion to drive change, high analytical skills and great interpersonal and communication skills, we will be thrilled to meet you!<p><br></p><p><strong>Responsibilities</strong><br></p> <ul> <li>Continuous process optimization to ensure high quality of service</li> <li>Define and deploy processes for every new business area that links to Operations</li> <li>Deep dive and resolve day to day/ week to week operational issues in coordination with team Managers</li> <li>Monitor Operations KPIs and drive performance improvement projects from concept generation to implementation</li> </ul><p><br></p><p><strong>Requirements</strong><br></p> <ul> <li>Bachelor’s degree in Engineering, Economics or another field with strong focus on numerical data</li> <li>Strong analytical skills and the ability to use hard data and metrics to back up assumptions</li> <li>Proven experience in driving performance improvement through process optimization </li> <li>Excellent communication skills and team orientation</li> <li>Experience in leading process improvement through Lean, Kaizen, and/or Six Sigma will be considered an advantage!!</li> <li>Master’s degree/MBA in business, operations, logistics, supply chain, or related field will be considered a plus</li> </ul> <p><br></p><p><strong>We offer</strong><br></p><ul> <li>Competitive remuneration scheme</li> <li>Meal coupons</li> <li>Private Medical &amp; Life Insurance</li> <li>Career development opportunities</li> <li>Free fitness courses (remote sessions included)</li> </ul><p><br></p><p><strong>Your life @efood<br></strong></p><ul> <li>You will be a part of a fast-growing multinational company, member of the Delivery Hero holding, with the opportunity to acquire new skills and grow professionally. </li> <li>Υou will have the opportunity to function in an established, yet creative and fun working environment with genuine and ambitious people whose ultimate goal is to maintain efood as the ideal workplace. [In our maiden participation in 2020, we were honoured with a 5th place award from the Great Place to Work® Institute] </li> <li>Daily routine will be a thing of the past, as no day will be the same as the one before.</li> </ul>",
    "requirements": "",
    "link": "https://apply.workable.com/e-food/j/8E1694C92E"
},
{
    "id": 1583125,
    "title": "On foot delivery",
    "company": "e-food",
    "department": "Logistics",
    "location": "Spata",
    "description": "<p><strong>efood </strong>is seeking for <strong>“on foot</strong> <strong>delivery” team members</strong>. As a member of our “<strong>on foot</strong> <strong>delivery” team,</strong> you will be responsible for the delivery of customers' orders on foot.</p><p><i>This is a physical, fast-paced, indoor position that involves continual delivery of meal / food orders on foot.</i></p><p><strong>What you'll do</strong></p><ul> <li>Deliver packages by foot in an efficient, trustworthy and reliable manner to customers</li> <li>Follow strict safety standards and practices throughout all delivery stages from package pickup, transport and delivery</li> <li>Interact with customers and the public in a professional and positive manner</li> <li>Usage of handheld technology to manage the delivery process</li> </ul>",
    "requirements": "<ul> <li>Excellent knowledge of English</li> <li>Smartphone must be updated and active with internet service and in good condition</li> <li>Long distance walking ability</li> <li>Able to work on weekends</li> <li>Comfort /familiarity with basic smartphone operations</li> <li>Prior customer service and delivery experience</li> <li>Must be at least 18 years old</li> <li>Must embody and demonstrate company values and culture</li> </ul>",
    "link": "https://apply.workable.com/e-food/j/35F3ACD88B"
}
]