[
{
    "id": 1581329,
    "title": "Operations Excellence Manager",
    "company": "e-food",
    "department": "Operations",
    "location": "Athens",
    "description": "<p>We are looking for a rock star <strong>Operations Excellence Manager</strong> to join our team!</p> <p>As our Operations Excellence Manager you will be responsible for optimizing existing Operations and cross departmental processes, introducing new ones, monitoring KPIs and ensuring best practices are standardized across different Operations teams in order to offer the best customer experience to our customers and partners</p> If you have a strong passion to drive change, high analytical skills and great interpersonal and communication skills, we will be thrilled to meet you!<p><br></p><p><strong>Responsibilities</strong><br></p> <ul> <li>Continuous process optimization to ensure high quality of service</li> <li>Define and deploy processes for every new business area that links to Operations</li> <li>Deep dive and resolve day to day/ week to week operational issues in coordination with team Managers</li> <li>Monitor Operations KPIs and drive performance improvement projects from concept generation to implementation</li> </ul><p><br></p><p><strong>Requirements</strong><br></p> <ul> <li>Bachelor’s degree in Engineering, Economics or another field with strong focus on numerical data</li> <li>Strong analytical skills and the ability to use hard data and metrics to back up assumptions</li> <li>Proven experience in driving performance improvement through process optimization </li> <li>Excellent communication skills and team orientation</li> <li>Experience in leading process improvement through Lean, Kaizen, and/or Six Sigma will be considered an advantage!!</li> <li>Master’s degree/MBA in business, operations, logistics, supply chain, or related field will be considered a plus</li> </ul> <p><br></p><p><strong>We offer</strong><br></p><ul> <li>Competitive remuneration scheme</li> <li>Meal coupons</li> <li>Private Medical &amp; Life Insurance</li> <li>Career development opportunities</li> <li>Free fitness courses (remote sessions included)</li> </ul><p><br></p><p><strong>Your life @efood<br></strong></p><ul> <li>You will be a part of a fast-growing multinational company, member of the Delivery Hero holding, with the opportunity to acquire new skills and grow professionally. </li> <li>Υou will have the opportunity to function in an established, yet creative and fun working environment with genuine and ambitious people whose ultimate goal is to maintain efood as the ideal workplace. [In our maiden participation in 2020, we were honoured with a 5th place award from the Great Place to Work® Institute] </li> <li>Daily routine will be a thing of the past, as no day will be the same as the one before.</li> </ul>",
    "requirements": "",
    "link": "https://apply.workable.com/e-food/j/8E1694C92E"
},
{
    "id": 1411214,
    "title": "Performance Marketing Wonderkid",
    "company": "e-food",
    "department": "Marketing",
    "location": "Athens",
    "description": "<p><br></p><p>efood’s Performance Marketing team is looking for a passionate <strong>Performance Marketing Wonderkid</strong> who will focus on Facebook &amp; Display advertising. If you are an A-player, want to get your hands dirty, wish to implement strategies that drive growth and are always willing to learn, then efood is the right place for you!<br><br></p><p><strong>What you’ll do: </strong></p><ul> <li>End-to End-Campaign management: Set-up, launch, measure and optimize advertising campaigns on Facebook, Instagram, GDN, YouTube</li> <li>Researching and testing new features, trends and ideas. Constantly challenging the status quo by identifying both new and improved execution strategies that will increase overall performance and efficiency, in turn leading to higher user satisfaction and retention.</li> <li>Strategic Planning &amp; Execution: Assist in the media strategy development with complete control of tactical execution of campaign.</li> <li>Monitoring and challenging acquisition and order funnels in order to improve CVRs and performance of marketing campaigns.</li> <li>Understanding of a creative’s impact in performance marketing and constantly working in a feedback loop with the design team.</li> <li>Develop processes, best practices and automation that will help elevate campaign reach to the next level</li> </ul><p><br></p> <p><strong>What you have:<br></strong></p> <ul> <li>Deep expertise on Facebook ads with usage of both hard sell and soft sell objectives</li> <li>Experience on Google ads, mostly with Display, Video and App advertising</li> <li>Educated around User acquisition and Growth strategies in the digital world</li> <li>Good understanding of CRM and email marketing fundamentals and their potential synergies with rest performance marketing channels</li> <li>Experience with A/B Testing. Testing mindset: Test everything that matters</li> <li>Deep knowledge of Analytics fundamentals and past experience with Google Analytics and Tag Manager</li> <li>Understanding of how tracking works across platforms</li> <li>A strong disposition for data-driven decision making; you like to play around with data and cut it in many different ways to find interesting insights that can help the business</li> <li>Excel skills : know your way around pivot tables </li> <li>Ability to manage and prioritize multiple projects at once</li> <li>Team spirit that can work with multiple people from different backgrounds and expertise<br> </li> </ul><p><br></p> <p><strong>Nice to have:<br></strong></p> <ul> <li>Bachelor/MSc in Computer Science, Statistics, Mathematics, Physics or Engineering</li> <li>SQL / Python hands-on experience</li> <li>Experience with Programmatic advertising</li> <li>HTML / CSS basic understanding </li> </ul><p><br></p><p><strong>We offer:</strong></p><ul> <li>Competitive remuneration scheme</li> <li>Meal coupons</li> <li>Medical &amp; Life Insurance</li> <li>Career development opportunities<br><br><br> </li> </ul><p><strong>Your life @efood :</strong></p><ul> <li>You will be a part of a fast-growing multinational company, member of the Delivery Hero holding, with the opportunity to acquire new skills and grow professionally. </li> <li>Υou will have the opportunity to function in an established, yet creative and fun working environment with genuine and ambitious people whose ultimate goal is to maintain efood as the ideal workplace. [In our maiden participation in 2020, we were honoured with a 5th place award from the Great Place to Work® Institute] </li> <li>Daily routine will be a thing of the past, as no day will be the same day as the one before.</li> </ul>",
    "requirements": "",
    "link": "https://apply.workable.com/e-food/j/4132560A60"
},
{
    "id": 1572923,
    "title": "Customer Care Team Leader",
    "company": "e-food",
    "department": "Customer Care",
    "location": "Athens",
    "description": "<p><strong>efood is looking for a Customer Care Team Leader to welcome in its family!</strong><br></p><p>We are looking for a fair and kind Leader, full of passion and ready to inspire, with logical thinking, creative problem solving and good time management skills to complete our leadership team.</p><p><br></p><p>Working in shifts and public holidays, 5 days a week, you will need among other things, to coordinate several tasks, motivate our customer care agents and rectify their shortcomings. Creating an inspiring team environment with an open communication culture as well as delegating tasks and setting deadlines or specific targets for your team.</p><p><br></p><p><strong>For this role you 'll have to :</strong></p><ul> <li>Build trust between team members</li> <li>Inspire and motivate teamwork for achieving goals</li> <li>Influence valuable changes and positive outcomes</li> <li>Recognize and acknowledge the skills of key team members and utilize their strengths to the benefit of the team</li> <li>Mediate disagreements between members</li> <li>Evaluate results and provide feedback to Head of Customer Care on a monthly basis</li> <li>Oversee and coordinate the customer care agents' day-to-day tasks ensuring policies and procedures are followed</li> <li>Management of demanding issues that might come up during a shift.  </li> <li>Daily shift reporting  to Head of Customer Care</li> <li>Support the shift and deal with anything that might come up, ensuring proper communication through relevant channels  </li> </ul><p><br></p><p><strong>Qualifications for this role include :</strong></p><ul> <li>Proven work experience as a team leader or supervisor</li> <li>Solid computer skills, especially MS Excel</li> <li>Good knowledge of performance metrics</li> <li>Excellent interpersonal, communication and leadership skills</li> <li>Organizational and time-management skills</li> <li>Natural charisma and leadership</li> <li>Ability to make quick and smart decisions under pressure</li> <li>Sense of ownership and pride in team's performance</li> <li>Ability to act proactively to ensure smooth team operations and effective collaboration</li> </ul><p><br></p><p><strong>We offer :</strong></p><ul> <li>Competitive remuneration scheme</li> <li>Meal coupons</li> <li>Medical &amp; Life Insurance</li> <li>Career development opportunities</li> </ul><p><br></p><p><strong>Your life @efood :</strong></p><ul> <li>You will be a part of a fast-growing multinational company, member of the Delivery Hero holding, with the opportunity to acquire new skills and grow professionally.</li> <li>Υou will have the opportunity to function in an established, yet creative and fun working environment with genuine and ambitious people whose ultimate goal is to maintain efood as the ideal workplace. [In our maiden participation in 2020, we were honoured with a 5th place award from the Great Place to Work® Institute]</li> <li>Daily routine will be a thing of the past, as no day will be the same day as the one before.</li> </ul>",
    "requirements": "",
    "link": "https://apply.workable.com/e-food/j/A3435C7115"
},
{
    "id": 1642493,
    "title": "Dispatching Supervisor (Customer Care)",
    "company": "e-food",
    "department": "Customer Care",
    "location": "Athens",
    "description": "<p>Dispatching is a key component of our Delivered by efood service. Dispatchers monitor real time operations and communicate all necessary information to both internal and external parties: riders, partners and customers.</p><p>We are looking for a dedicated Dispatching Supervisor to coordinate our fast growing Dispatch team. A vibrant team of 60 (dispatching) agents with the aim to deliver an exceptional customer, rider and partner experience on a daily basis.</p><p>Do you want to become a key member of a rapidly growing team? This is an exciting opportunity to make history!  </p><p><br><br></p><p><strong>As our Dispatching Supervisor you will:<br><br></strong></p><ul> <li>Monitor overall team performance and support Team Leaders when/if necessary  </li> <li>Solve day to day issues by providing holistic solutions </li> <li>Collaborate with Logistics and Product for new developments and/or product requirements</li> <li>Handle crisis and arising emergencies </li> <li>Determine priorities to handle potential high-pressure workload</li> <li>Cooperate with the Head of Customer Care to identify customer/partner issues, to implement solutions that force process effectiveness </li> <li>Follow up and take actions for improvement of escalated issues across internal departments </li> <li>Monitor dispatching KPIs, identify and eliminate barriers to accuracy, productivity and quality</li> <li>Develop procedures and policies aiming to maximize customer, partner and rider experience<br><br> </li> </ul><p><strong>Requirements:<br><br></strong></p><ul> <li>3+ years work experience in a similar role/industry (operations, logistics)</li> <li>Proven experience in team management</li> <li>Proficient knowledge of customer experience</li> <li>Outstanding communication skills, both written and verbal</li> <li>Excellent people skills</li> <li>Strong ability to focus both on customer's and team's needs</li> <li>Detail-oriented with outstanding organizational skills</li> <li>Available to work shifts if required (occasionally)</li> <li>Strong analytical skills </li> <li>Prior experience in live operations will be considered as a big plus<br><br> </li> </ul><p><strong>We offer:<br><br></strong></p><ul> <li>Competitive remuneration scheme</li> <li>Private Medical &amp; Life Insurance</li> <li>Meal coupons</li> <li>Career development opportunities<br><br> </li> </ul><p><strong>Your life @efood:<br><br></strong></p><ul> <li>You will be a part of a fast-growing multinational company, member of the Delivery Hero holding, with the opportunity to acquire new skills and grow professionally.</li> <li>Υou will have the opportunity to function in an established, yet creative and fun working environment with genuine and ambitious people whose ultimate goal is to maintain efood as the ideal workplace. [In our maiden participation in 2020, we were honoured with a 5th place award from the Great Place to Work® Institute]</li> <li>Daily routine will be a thing of the past, as no day will be the same day as the one before.</li> </ul>",
    "requirements": "",
    "link": "https://apply.workable.com/e-food/j/EB8430899A"
},
{
    "id": 1669908,
    "title": "Customer Care (Dispatcher)",
    "company": "e-food",
    "department": "Operations",
    "location": "Athens",
    "description": "<p>Are you a multitasker that loves coordinating operational tasks?</p><p>Our Dispatch team is growing and we are looking for our new superstars that will take our operations above and beyond. </p><p><strong>As a Dispatcher you will monitor \"delivered by efood\" orders in real-time, making sure all works immaculately. You will lift any blockers on our riders' way to the PERFECT delivery &amp; communicate efficiently with our customers!</strong><br><br></p><p>Join our thriving team and become the next <strong>efooder</strong>!<br><br></p><p><strong>Responsibilities</strong></p><ul> <li>Monitor orders and handle issues from the watchlist</li> <li>Ensure that delivery zone performance and delays are on track</li> <li>Make corrective actions whenever needed (even before needed)</li> <li>Handle incoming contact from<strong> vendors, riders &amp; customers through chat &amp; calls</strong> </li> <li>Monitor order routing and make adjustments</li> <li>Inform customers for their order status if and when needed<br> </li> </ul><p><strong>Requirements</strong></p><ul> <li>High level of multitasking</li> <li>Problem-solving mindset</li> <li>Attention to detail</li> <li>Great communication skills</li> <li>Excellent computer skills</li> <li>Bachelor degree will be a plus</li> <li>Experience in a similar industry or customer care field will be a plus</li> <li>Excellent English verbal and written communication is a must</li> <li> <strong>Ability to work in a rotating weekly schedule of day &amp; night shifts from Monday - Sunday including national holidays</strong><br> </li> </ul><p><strong>We offer</strong></p><ul> <li>Competitive remuneration scheme</li> <li>Private Medical &amp; Life Insurance</li> <li>Meal coupons</li> <li>Career development opportunities<br> </li> </ul><p><strong>Your life @efood</strong><br></p><ul> <li>You will be a part of a fast-growing multinational company, member of the Delivery Hero holding, with the opportunity to acquire new skills and grow professionally.</li> <li>Υou will have the opportunity to function in an established, yet creative and fun working environment with genuine and ambitious people whose ultimate goal is to maintain efood as the ideal workplace. [In our maiden participation in 2020, we were honoured with a 5th place award from the Great Place to Work® Institute]</li> <li>Daily routine will be a thing of the past, as no day will be the same day as the one before.</li> </ul>",
    "requirements": "",
    "link": "https://apply.workable.com/e-food/j/76513B4ECC"
},
{
    "id": 1669882,
    "title": "Customer Care Agent",
    "company": "e-food",
    "department": "Customer Care",
    "location": "Athens",
    "description": "<p>We are looking for someone who is customer oriented to deliver happiness to our customers (<strong>shifts: including day and night</strong>)! Are you enthusiastic? Energetic? Do you enjoy helping people and providing solutions? We are here to end world hunger and generate awesome brand love, thus we need someone with your skills to join our -great- cause! <br></p><p><br>You will be responsible for the communication with, both, our end users and partners, making sure that they receive the best customer experience.</p><p><br></p><p><strong>Apply if:</strong></p><ul> <li>You understand the difference between hungry and HANGRY</li> <li>You can meditate even with the most hardcore rock music playing in the background</li> <li>You will go straight to the restaurant and deliver the food yourself to our customers if you need to</li> <li>The term \"agent\" doesn't only mean you're part of the FBI, CIA etc.</li> <li>\"Call Center\" sounds like a \"Happiest Land Ever Created\" to you</li> </ul><p><br><strong>Seriously though, apply if:</strong></p><ul> <li>You have strong verbal and written communication skills in order to handle all our 3 channels: incoming calls, live chat and email.</li> <li>You are problem solving oriented and you have the ability to find the best solution to every customer related issue.</li> <li>You are a team player! Team spirit is necessary as you will be part of a highly interactive and dynamic team of customer care agents.</li> <li>Multitasking and critical thinking are required in order to prioritize and handle both incoming and outgoing contact.</li> <li>Strong understanding of customer expectations with a focus on quality driven support.</li> <li>Fluency in Greek and English is a must.</li> <li>Prior experience in customer service will be considered as a plus.</li> <li>Bachelor's degree will be considered as a plus.</li> <li>Full time work, 5 days a week, including weekends and national holidays.</li> </ul><p><br></p><p><strong>Your life @efood :</strong><br></p><ul> <li>You will be a part of a fast-growing multinational company, member of the Delivery Hero holding, with the opportunity to acquire new skills and grow professionally.</li> <li>Υou will have the opportunity to function in an established, yet creative and fun working environment with genuine and ambitious people whose ultimate goal is to maintain efood as the ideal workplace. [In our maiden participation in 2020, we were honoured with a 5th place award from the Great Place to Work® Institute]</li> <li>Daily routine will be a thing of the past, as no day will be the same day as the one before.</li> </ul>",
    "requirements": "",
    "link": "https://apply.workable.com/e-food/j/3C359E8290"
},
{
    "id": 1672146,
    "title": "Risk Manager",
    "company": "e-food",
    "department": "Finance",
    "location": "Athens",
    "description": "<p>Delivery Hero Payments (DH Pay) is looking for a <strong>Risk Manager</strong> for its operations in Athens, Greece. </p><p>The Risk Manager will be responsible for identifying and analyzing various risks (e.g. strategic, operational), developing risk management controls and contingency plans and communicating recommendations to entity’s and group’s management.<br><br> </p><p><strong>Your mission</strong></p><ul> <li>Implementing the risk management system approved by the management, including leading practices, policies, and regulatory requirements. </li> <li>Performing risk assessment by analyzing the current risks and identifying potential risks that are affecting the entity.</li> <li>Performing risk evaluation on entity’s handling of risks.</li> <li>Reporting identified and assessed risks to the management.</li> <li>Establishing the level of risk, the entity is willing to take (risk appetite). </li> <li>Promoting risk culture and raise awareness within the entity. </li> <li>Providing thought partnership, risk analytics (e.g. return on Risk Mitigation investments), and recommendations around remediation, risk mitigation, or process improvement to the local C-Level, management and risk owners. </li> <li>Consulting and coordinate with other control-related functions (e.g. Internal Controls and Compliance). </li> <li>Regularly reporting updates on risk management to the local management and Central Risk Management.</li> <li>Establishing and maintaining relationship with the regulatory authorities.</li> </ul><p><strong><br>Your skills</strong></p><ul> <li>Bachelor’s Degree, preferably in Risk Management, Management or Business Studies, Finance or Economics.</li> <li>Three (3) to five (5) years of proven professional experience in Risk Management or in a relevant role, preferably in a multinational environment. Big4 experience will be considered an asset.</li> </ul><ul> <li>Professional Risk Management certification will be considered an asset.</li> <li>Proven experience in risk management related projects in financial services industry.</li> <li>Enhanced appreciation of the financial regulatory and governance environment (Proven experience in Fintech industry and strong Card Scheme knowledge will be considered an asset). </li> <li>Excellent command of English (written and spoken) is must.</li> <li>Independent, goal-oriented and systematic way of working.</li> <li>Ambition to work in a dynamic, fast paced work environment. </li> <li>Ability to manage priorities, work under pressure and meet tight deadlines.</li> <li>Demonstrate integrity and professional ethics.</li> </ul><p><br></p><p><strong>We offer</strong></p><ul> <li>Competitive remuneration scheme</li> <li>Meal coupons</li> <li>Private Medical &amp; Life Insurance</li> <li>Career development opportunities</li> </ul><p><br></p><p><strong>Your life @efood</strong></p><ul> <li>You will be a part of a fast-growing multinational company, member of the Delivery Hero holding, with the opportunity to acquire new skills and grow professionally. </li> <li>Υou will have the opportunity to function in an established, yet creative and fun working environment with genuine and ambitious people whose ultimate goal is to maintain efood as the ideal workplace. [In our maiden participation in 2020, we were honoured with a 5th place award from the Great Place to Work® Institute] </li> <li>Daily routine will be a thing of the past, as no day will be the same as the one before.</li> </ul>",
    "requirements": "",
    "link": "https://apply.workable.com/e-food/j/E9A84B6A59"
},
{
    "id": 1538024,
    "title": "AML & Compliance Officer",
    "company": "e-food",
    "department": "Finance",
    "location": "Athens",
    "description": "<p>Delivery Hero Payments (DH Pay) is looking for an <strong>AML &amp; Compliance Officer</strong> for its operations in Greece. </p><p>The AML &amp; Compliance Officer will be responsible for the provision of services to the firm relating to Card Scheme Compliance, Anti-Money Laundering (AML), Sanctions, Oversight and management between Regulators and Financial Anti-Corruption Compliance.  </p><p><br></p><p><strong>Your mission:<br></strong></p><ul> <li>Aiding in building a comprehensive compliance program and governance structure that is fit for purpose regarding all financial instruments in Greece as well as other European markets. </li> <li>Being a strategic business partner providing assurance that business is being conducted in line with the ethical and legal international frameworks.</li> <li>Executing and monitoring compliance programs in line with the firm's expectation.</li> <li>Coordinating with central and local management and key stakeholders to ensure alignment with operational goals.</li> <li>Working closely with Card Schemes and local regulators to ensure the company is suitably compliant and protected.  This includes compliance with regulatory reporting requirements.</li> <li>Coordinating audit, regulator and merchant inquiries and reviews relating to all financial compliance matters.</li> <li>Getting involved in departmental projects particularly in relation to the development of compliance such as e-KYC.</li> <li>Reviewing and rolling out relevant policies and procedures and identifying where local adjustments may be needed.</li> <li>Initiating, conducting and promptly replying to ad-hoc compliance issues as appropriate and supporting colleagues in understanding compliance-related risks and management of such risks.</li> <li>Keeping abreast of changes and developments in the relevant regulatory environment in all applicable jurisdictions.</li> <li>Being able to demonstrate an ability to interpret Card Scheme, E-Money or regulatory requirements and assess operational Compliance with those requirements with particular focus on financial crime, anti-corruption and on-going reporting and compliance with the relevant standards.</li> </ul><p><br></p><p><strong>Our requirements:</strong><br></p><ul> <li>Bachelor’s Degree,in legal or compliance or a comparable field.</li> <li>Minimum five (5) years of proven professional experience in Compliance or in a relevant role, preferably in a multinational environment. Big4, Banking or FinTech experience will be considered an asset.</li> <li>Proven experience in overseeing compliance projects and assurance services (audit or similar) in the financial services industry.</li> <li>Enhanced appreciation of the financial regulatory and governance environment (Proven experience in Fintech industry and strong Card Scheme knowledge will be considered an asset). </li> <li>Independent, goal-oriented and systematic approach to work.</li> <li>Excellent command of English (written and spoken) is essential.</li> <li>Ability to work in a dynamic, fast paced work environment. </li> <li>Ability to manage priorities, work under pressure and meet tight deadlines.</li> <li>Highest level of professional integrity and professional ethics.</li> </ul><p><br></p><p><strong>We offer</strong></p><ul> <li>Competitive remuneration scheme</li> <li>Meal coupons</li> <li>Private Medical &amp; Life Insurance</li> <li>Career development opportunities</li> </ul><p><br></p><p><strong>Your life @efood</strong></p><ul> <li>You will be a part of a fast-growing multinational company, member of the Delivery Hero holding, with the opportunity to acquire new skills and grow professionally. </li> <li>Υou will have the opportunity to function in an established, yet creative and fun working environment with genuine and ambitious people whose ultimate goal is to maintain efood as the ideal workplace. [In our maiden participation in 2020, we were honoured with a 5th place award from the Great Place to Work® Institute] </li> <li>Daily routine will be a thing of the past, as no day will be the same as the one before.</li> </ul>",
    "requirements": "",
    "link": "https://apply.workable.com/e-food/j/DA68C8017E"
},
{
    "id": 1563744,
    "title": "Talent Development Specialist",
    "company": "e-food",
    "department": "HR",
    "location": "Athens",
    "description": "<p>We are looking for an experienced and passionate Talent Development Specialist to join our Human Resources department to support the development, launch, and continued delivery of training programs that will advance the company’s performance and strengthen our culture. This role is critical to the execution and expansion of organization-wide learning programs as we rapidly scale.</p><p>If you think that knowledge shared is knowledge squared, we want to meet you!</p><p><br></p><p><strong>What you'll do</strong></p><ul> <li>Support the design, development and delivery of class and online trainings for the whole company.</li> <li>Manage scheduling and communications for our learning programs to deliver polished and professional experiences.</li> <li>Provide operational and technical support during virtual sessions, leveraging digital tools to engage learners.</li> <li>Consistently brainstorm ways we can improve the quality, efficiency, and scalability of our trainings (e.g., automating processes, templetizing communications, etc.)</li> <li>Assist in the creation of  processes and procedures required to launch and maintain new trainings.</li> <li>Partner with stakeholders to inspire advocacy of the training content and ensure high participation rates.</li> <li>Support team operations by proactively tracking, monitoring, and reporting on projects.</li> <li>Assist in the development and execution of company-wide learning initiatives that help us recruit, develop, and retain top talent.</li> </ul><p><strong>What you have</strong><br></p><ul> <li>At least 5 years of professional experience in HR, L&amp;D, Talent Development, or a related field.</li> <li>Strong project management skills and sharp attention to detail.</li> <li>Experience owning projects with multiple collaborators and stakeholders.</li> <li>Demonstrated ability to build and maintain relationships with individuals across all levels, departments.</li> <li>BSc in Human Resources Management, Organizational Psychology or relevant field. Additional education and certification on training will be a plus.</li> <li>Strong and confident communicator with excellent verbal and written skills.</li> <li>Ability to analyze data and present in a cohesive and concise manner.</li> <li>Proficiency in MS Office applications.</li> <li>Ownership and Team spirit.</li> </ul><p><strong>We offer</strong></p><ul> <li>Competitive remuneration scheme</li> <li>Meal coupons</li> <li>Private Medical &amp; Life Insurance</li> <li>Career development opportunities</li> </ul><p><strong>Your life @efood</strong><br></p><ul> <li>You will be a part of a fast-growing multinational company, member of the Delivery Hero holding, with the opportunity to acquire new skills and grow professionally.</li> <li>Υou will have the opportunity to function in an established, yet creative and fun working environment with genuine and ambitious people whose ultimate goal is to maintain efood as the ideal workplace. [In our maiden participation in 2020, we were honoured with a 5th place award from the Great Place to Work® Institute]</li> <li>Daily routine will be a thing of the past, as no day will be the same day as the one before.</li> </ul>",
    "requirements": "",
    "link": "https://apply.workable.com/e-food/j/194715FF4F"
}
]