[
{
    "id": 1746003,
    "title": "Customer Care Agent",
    "company": "e-food",
    "department": "Customer Care",
    "location": "Athens",
    "description": "<p>We are looking for someone who is customer oriented to deliver happiness to our customers (<strong>shifts: including day and night</strong>)! Are you enthusiastic? Energetic? Do you enjoy helping people and providing solutions? We are here to end world hunger and generate awesome brand love, thus we need someone with your skills to join our -great- cause! <br></p><p><br>You will be responsible for the communication with, both, our end users and partners, making sure that they receive the best customer experience.</p><p><br></p><p><strong>Apply if:</strong></p><ul> <li>You understand the difference between hungry and HANGRY</li> <li>You can meditate even with the most hardcore rock music playing in the background</li> <li>You will go straight to the restaurant and deliver the food yourself to our customers if you need to</li> <li>The term \"agent\" doesn't only mean you're part of the FBI, CIA etc.</li> <li>\"Call Center\" sounds like a \"Happiest Land Ever Created\" to you</li> </ul><p><br><strong>Seriously though, apply if:</strong></p><ul> <li>You have strong verbal and written communication skills in order to handle all our 3 channels: incoming calls, live chat and email.</li> <li>You are problem solving oriented and you have the ability to find the best solution to every customer related issue.</li> <li>You are a team player! Team spirit is necessary as you will be part of a highly interactive and dynamic team of customer care agents.</li> <li>Multitasking and critical thinking are required in order to prioritize and handle both incoming and outgoing contact.</li> <li>Strong understanding of customer expectations with a focus on quality driven support.</li> <li>Fluency in Greek and English is a must.</li> <li>Prior experience in customer service will be considered as a plus.</li> <li>Bachelor's degree will be considered as a plus.</li> <li>Full time work, 5 days a week, including weekends and national holidays.</li> </ul><p><br></p><p><strong>Your life @efood :</strong><br></p><ul> <li>You will be a part of a fast-growing multinational company, member of the Delivery Hero holding, with the opportunity to acquire new skills and grow professionally.</li> <li>Υou will have the opportunity to function in an established, yet creative and fun working environment with genuine and ambitious people whose ultimate goal is to maintain efood as the ideal workplace. [In 2021 we were honoured with a 3rd place award from the Great Place to Work® Institute]</li> <li>Daily routine will be a thing of the past, as no day will be the same day as the one before.</li> </ul>",
    "requirements": "",
    "link": "https://apply.workable.com/e-food/j/FFBE14310D"
},
{
    "id": 1766107,
    "title": "Customer Care Agent - Part Time (Evening & Night Shifts)",
    "company": "e-food",
    "department": "Customer Care",
    "location": "Athens",
    "description": "<p>We are looking for someone who is customer oriented to deliver happiness to our customers (<strong>shifts: including evening &amp; night</strong>)! Are you enthusiastic? Energetic? Do you enjoy helping people and providing solutions? We are here to end world hunger and generate awesome brand love, thus we need someone with your skills to join our -great- cause! <br></p><p><br>You will be responsible for the communication with, both, our end users and partners, making sure that they receive the best customer experience.</p><p><br></p><p><strong>Apply if:</strong></p><ul> <li>You understand the difference between hungry and HANGRY</li> <li>You can meditate even with the most hardcore rock music playing in the background</li> <li>You will go straight to the restaurant and deliver the food yourself to our customers if you need to</li> <li>The term \"agent\" doesn't only mean you're part of the FBI, CIA etc.</li> <li>\"Call Center\" sounds like a \"Happiest Land Ever Created\" to you</li> </ul><p><br><strong>Seriously though, apply if:</strong></p><ul> <li>You have strong verbal and written communication skills in order to handle all our 3 channels: incoming calls, live chat and email.</li> <li>You are problem solving oriented and you have the ability to find the best solution to every customer related issue.</li> <li>You are a team player! Team spirit is necessary as you will be part of a highly interactive and dynamic team of customer care agents.</li> <li>Multitasking and critical thinking are required in order to prioritize and handle both incoming and outgoing contact.</li> <li>Strong understanding of customer expectations with a focus on quality driven support.</li> <li>Fluency in Greek and English is a must.</li> <li>Prior experience in customer service will be considered as a plus.</li> <li>Bachelor's degree will be considered as a plus.</li> <li>Part time work, 4 days a week, including weekends and national holidays.</li> </ul><p><br></p><p><strong>Your life @efood :</strong><br></p><ul> <li>You will be a part of a fast-growing multinational company, member of the Delivery Hero holding, with the opportunity to acquire new skills and grow professionally.</li> <li>Υou will have the opportunity to function in an established, yet creative and fun working environment with genuine and ambitious people whose ultimate goal is to maintain efood as the ideal workplace. [In 2021, we were honoured with a 3rd place award from the Great Place to Work® Institute]</li> <li>Daily routine will be a thing of the past, as no day will be the same day as the one before.</li> </ul>",
    "requirements": "",
    "link": "https://apply.workable.com/e-food/j/411122EF05"
},
{
    "id": 1846494,
    "title": "Accounts Receivable Agent",
    "company": "e-food",
    "department": "Finance",
    "location": "Athens",
    "description": "<p>efood is in search of a reliable <strong>Accounts Receivable Agent</strong> to join our Accounting team. The agent will be responsible for tracking invoices, handling requests and inquiries relevant to partners accounts, monitoring credit note requests. He or she should be extremely detail-oriented and a team player. We need someone who can work closely with the Accounting Department and Sales Department in order to support the verification process and screening of our partners.</p><p><strong>Join us</strong> for your chance to be part of a rapidly growing team in a company that is changing the delivery landscape.</p><p><br></p><p><strong>What you'll do</strong></p><ul> <li>Process incoming mail concerning billing and invoicing</li> <li>Communicate with clients about billing discrepancies and questions</li> <li>Initiate collections on past-due accounts</li> <li>Maintain accounting ledgers as required</li> <li>Audit ledgers to ensure they contain correct information</li> <li>Ensure accuracy and completeness of Partners master data</li> <li>Collect and store verification documents</li> <li>Draft and store contracts</li> </ul><p><strong><br>What you have</strong></p><ul> <li>Bachelor’s degree in Accounting or related field</li> <li>2+ years’ experience in AR or accounting related department </li> <li>Flexibility and ability to solve problems</li> <li>Experience with customer service and client communication</li> <li>Excellent communication and problem-solving skills</li> <li>Advanced knowledge of Microsoft office</li> <li>Familiarity with accounting software programs</li> <li>Excellent English language skills</li> </ul><p><br></p><p><strong>We offer</strong><br></p><ul> <li>Competitive remuneration scheme</li> <li>  Private Medical &amp; Life Insurance</li> <li>  Meal coupons</li> <li>  Career development opportunities</li> <li>Remote gym sessions</li> </ul><p><br></p><p><strong>Your life @ efood</strong><br></p><ul> <li>You will be a part of a fast-growing multinational company, member of the Delivery Hero SE, with the opportunity to acquire new skills and grow professionally.</li> <li>You will have the opportunity to function in an established, yet creative environment with genuine and ambitious people whose ultimate goal is to maintain efood as the ideal workplace [In 2021 we were honoured with a 3rd place award from the <strong>Great Place to Work</strong> Institute] </li> <li>Daily routine will be a thing of the past, as no day will be the same as the one before.</li> </ul>",
    "requirements": "",
    "link": "https://apply.workable.com/e-food/j/FE53182722"
},
{
    "id": 1847963,
    "title": "Trainer | Riders' Fleet",
    "company": "e-food",
    "department": "Logistics",
    "location": "Athens",
    "description": "<p>We are looking for a energetic <strong>Trainer | Riders' Fleet</strong> to join our rapidly growing Logistics department. The new member will be responsible for the training of our Riders' Fleet and elevating Logistics teams.</p><p><br></p><p><strong>Responsibilities:</strong></p><ul> <li>Training and coaching Riders' fleet</li> <li>Elevating teams of Logistics Department as per business needs</li> <li>Design and deliver courses for Riders and other divisions of the department</li> <li>Prepare, update and coordinate training material</li> <li>Propose and handle training alliances to improve training experience</li> <li>Support admin tasks on our training platform</li> <li>Identify areas of improvement and turn them into development opportunities for the entire community</li> </ul><p><br></p><p><strong>Requirements:</strong></p><ul> <li>Proven experience in designing and delivering training courses and material</li> <li>Knowledge of training methods, tools and techniques</li> <li>Ability to assess and analyze development and training needs of the teams</li> <li>Excellent time management and organizational skills, ability to communicate and negotiate properly, high adaptability</li> <li>Bachelor degree</li> <li>Excellent English command (written and oral)</li> <li>Excellent knowledge of MS-Office</li> <li>Fast learner, team player, active listener</li> </ul><p><br></p><p><strong>We offer :</strong></p><ul> <li>Competitive remuneration scheme</li> <li>Meal coupons</li> <li>Private Medical &amp; Life Insurance</li> <li>Career development opportunities</li> <li>Free fitness courses (remote sessions included)</li> </ul><p><br></p><p><strong>Your life @ efood :</strong></p><p>You will be a part of a fast-growing multinational company, member of the Delivery Hero holding, with the opportunity to acquire new skills and grow professionally.</p><p>You will have the opportunity to function in an established, yet creative and fun working environment with genuine and ambitious people whose ultimate goal is to maintain efood as the ideal workplace. [In our participation in 2021, we were honored with a 3rd place award from the Great Place to Work® Institute]</p><p>Daily routine will be a thing of the past, as no day will be the same as the one before.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/e-food/j/1E02416A70"
},
{
    "id": 1847942,
    "title": "Fleet Shift Supervisor",
    "company": "e-food",
    "department": "Logistics",
    "location": "Athens",
    "description": "<p>We are looking for a skilled <strong>Fleet Shift Supervisor </strong>in Athens to help us take our riders’ fleet to the next level, a Hero level!</p><p>On a daily basis, you’ll oversee and manage riders’ shift scheduling on your assigned areas, handle schedule, holiday, sick leave, etc requests. You will be responsible for the area staffing so our delivery service runs like a well-oiled machine, the KPIs are met and exceeded. Moreover, you will work closely with the Fleet Manager and provide guidance and support to your assigned fleet teams as required.</p><p><strong>Responsibilities</strong></p><ul> <li>Manage weekly schedule, riders’ shifts, and time-off requests</li> <li>Understand and provide prompt support to couriers for any kind of support request received via our ticketing system</li> <li>Contact riders to make all necessary schedule adjustments</li> <li>Ensure that weekly fleet staffing goals are met</li> <li>Oversee the cash collection process for precision and accuracy</li> <li>Provide guidance and feedback to riders whenever needed</li> <li>Monitor rider’s performance and engagement KPI’s to provide feedback to the Fleet Manager</li> <li>Attend one to one meetings with the Fleet to provide feedback</li> <li>Guide fleet captains to maintain compliance among riders and vendors</li> </ul><p>¨</p><p><strong>Requirements</strong></p><ul> <li>Strong computer skills, great competency in MS Excel</li> <li>Excellent communication skills</li> <li>Organizational and time management skills while multitasking</li> <li>A natural tendency to communicate effectively, lead &amp; inspire team members</li> <li>A can-do attitude in an ever-changing environment</li> <li>Love to always aim higher</li> <li>Experience in Logistics or relevant field will be a plus</li> <li>Bachelor degree will be a plus</li> </ul><p><br></p><p><strong>We offer :</strong><br>Competitive remuneration scheme<br>Meal coupons<br>Private Medical &amp; Life Insurance<br>Career development opportunities<br>Free fitness courses (remote sessions included)</p><p><br></p><p><strong>Your life @ efood :</strong><br>You will be a part of a fast-growing multinational company, member of the Delivery Hero holding, with the opportunity to acquire new skills and grow professionally.<br>You will have the opportunity to function in an established, yet creative and fun working environment with genuine and ambitious people whose ultimate goal is to maintain efood as the ideal workplace. [In our maiden participation in 2020, we were honored with a 3rd place award from the Great Place to Work® Institute.<br>Daily routine will be a thing of the past, as no day will be the same as the one before.</p>",
    "requirements": "",
    "link": "https://apply.workable.com/e-food/j/E945C3C384"
},
{
    "id": 1850218,
    "title": "Talent Acquisition Team Manager",
    "company": "e-food",
    "department": "Human Resources",
    "location": "Athens",
    "description": "<p>Efood is the #1online delivery service in Greece that is offering a selection of more than 15.000 restaurants and shops in more that 90 cities from where you can order everyday. Our goal is every order, to be an “efood order” in Greece.</p><p>Do you have solid experience with leading recruitment teams, can’t live without challenges and are able  to create and foster relationships with stakeholders and candidates? Hooray! You have found your next career step!</p><p>We are looking for a bright and energetic Talent Acquisition Team Manager to drive our talent acquisition efforts and help us grow our fast growing team. 🚀</p><p>While considering this position, take into account what we value at efood. We are looking for someone who:</p><ul> <li>aims higher</li> <li>delivers solutions</li> <li>cares</li> </ul><p><strong>About the role:</strong></p><ul> <li>Develop talent acquisition strategies and hiring plans</li> <li>Drive hiring metrics (i.e. Time to Fill, Recruitment funnel effectiveness) and leverage data to facilitate hiring decisions</li> <li>Align with hiring managers to forecast hiring needs and determine selection criteria</li> <li>Lead, oversee and supervise recruiters</li> <li>Train and advise hiring managers on interviewing techniques and assessment methods</li> <li>Lead employer branding initiatives</li> <li>Find bottlenecks in the recruiting process</li> <li>Strategically improve the candidate experience</li> <li>Hands on experience on the full cycle of recruitin</li> </ul>",
    "requirements": "<ul> <li>BSc or MS in Human Resources Management, Organizational Psychology, Business Administration or relevant field</li> <li>At least 3-5 years of work experience as a Talent Acquisition Manager/Lead or similar role </li> <li>A sense of ownership and pride in your performance and its impact on the company’s success</li> <li>Experience with tracking TA KPI’s and reviewing and presenting TA data</li> <li>Significant knowledge on sourcing and interviewing methods</li> <li>Hands-on experience with full-cycle recruiting using various interview techniques and evaluation methods</li> <li>Knowledge of sourcing techniques on social media and niche platforms</li> <li>Strong stakeholder management and communication skills</li> <li>Critical thinker and problem-solving skills</li> <li>Team spirit / able to work with professionals with different background and expertise</li> <li>Excellent verbal and written communication skills in Greek &amp; English</li> </ul>",
    "link": "https://apply.workable.com/e-food/j/E4886127D3"
}
]