[
{
    "id": 1746003,
    "title": "Customer Care Agent",
    "company": "e-food",
    "department": "Customer Care",
    "location": "Athens",
    "description": "<p>We are looking for someone who is customer oriented to deliver happiness to our customers (<strong>shifts: including day and night</strong>)! Are you enthusiastic? Energetic? Do you enjoy helping people and providing solutions? We are here to end world hunger and generate awesome brand love, thus we need someone with your skills to join our -great- cause! <br></p><p><br>You will be responsible for the communication with, both, our end users and partners, making sure that they receive the best customer experience.</p><p><br></p><p><strong>Apply if:</strong></p><ul> <li>You understand the difference between hungry and HANGRY</li> <li>You can meditate even with the most hardcore rock music playing in the background</li> <li>You will go straight to the restaurant and deliver the food yourself to our customers if you need to</li> <li>The term \"agent\" doesn't only mean you're part of the FBI, CIA etc.</li> <li>\"Call Center\" sounds like a \"Happiest Land Ever Created\" to you</li> </ul><p><br><strong>Seriously though, apply if:</strong></p><ul> <li>You have strong verbal and written communication skills in order to handle all our 3 channels: incoming calls, live chat and email.</li> <li>You are problem solving oriented and you have the ability to find the best solution to every customer related issue.</li> <li>You are a team player! Team spirit is necessary as you will be part of a highly interactive and dynamic team of customer care agents.</li> <li>Multitasking and critical thinking are required in order to prioritize and handle both incoming and outgoing contact.</li> <li>Strong understanding of customer expectations with a focus on quality driven support.</li> <li>Fluency in Greek and English is a must.</li> <li>Prior experience in customer service will be considered as a plus.</li> <li>Bachelor's degree will be considered as a plus.</li> <li>Full time work, 5 days a week, including weekends and national holidays.</li> </ul><p><br></p><p><strong>Your life @efood :</strong><br></p><ul> <li>You will be a part of a fast-growing multinational company, member of the Delivery Hero holding, with the opportunity to acquire new skills and grow professionally.</li> <li>Υou will have the opportunity to function in an established, yet creative and fun working environment with genuine and ambitious people whose ultimate goal is to maintain efood as the ideal workplace. [In 2021 we were honoured with a 3rd place award from the Great Place to Work® Institute]</li> <li>Daily routine will be a thing of the past, as no day will be the same day as the one before.</li> </ul>",
    "requirements": "",
    "link": "https://apply.workable.com/e-food/j/FFBE14310D"
},
{
    "id": 1746002,
    "title": "Customer Care (Dispatcher)",
    "company": "e-food",
    "department": "Operations",
    "location": "Athens",
    "description": "<p>Are you a multitasker that loves coordinating operational tasks?</p><p>Our Dispatch team is growing and we are looking for our new superstars that will take our operations above and beyond. </p><p><strong>As a Dispatcher you will monitor \"delivered by efood\" orders in real-time, making sure all works immaculately. You will lift any blockers on our riders' way to the PERFECT delivery &amp; communicate efficiently with our customers!</strong><br><br></p><p>Join our thriving team and become the next <strong>efooder</strong>!<br><br></p><p><strong>Responsibilities</strong></p><ul> <li>Monitor orders and handle issues from the watchlist</li> <li>Ensure that delivery zone performance and delays are on track</li> <li>Make corrective actions whenever needed (even before needed)</li> <li>Handle incoming contact from<strong> vendors, riders &amp; customers through chat &amp; calls</strong> </li> <li>Monitor order routing and make adjustments</li> <li>Inform customers for their order status if and when needed<br> </li> </ul><p><strong>Requirements</strong></p><ul> <li>High level of multitasking</li> <li>Problem-solving mindset</li> <li>Attention to detail</li> <li>Great communication skills</li> <li>Excellent computer skills</li> <li>Bachelor degree will be a plus</li> <li>Experience in a similar industry or customer care field will be a plus</li> <li>Excellent English verbal and written communication is a must</li> <li> <strong>Ability to work in a rotating weekly schedule of day &amp; night shifts from Monday - Sunday including national holidays</strong><br> </li> </ul><p><strong>We offer</strong></p><ul> <li>Competitive remuneration scheme</li> <li>Private Medical &amp; Life Insurance</li> <li>Meal coupons</li> <li>Career development opportunities<br> </li> </ul><p><strong>Your life @efood</strong><br></p><ul> <li>You will be a part of a fast-growing multinational company, member of the Delivery Hero holding, with the opportunity to acquire new skills and grow professionally.</li> <li>Υou will have the opportunity to function in an established, yet creative and fun working environment with genuine and ambitious people whose ultimate goal is to maintain efood as the ideal workplace. [In 2021 we were honoured with a 3rd place award from the Great Place to Work® Institute]</li> <li>Daily routine will be a thing of the past, as no day will be the same day as the one before.</li> </ul>",
    "requirements": "",
    "link": "https://apply.workable.com/e-food/j/43F02FE3C2"
}
]