[
{
    "id": "job-698049",
    "title": "Spanish Speaking Seasonal Travel Agent",
    "company": "ferryhopper",
    "department": null,
    "location": "Athens, Greece",
    "description": "<p>The Company</p>\n<p>Ferryhopper is revolutionizing online ferry booking. We are collaborating with more than 50 major and smaller ferry companies to offer ferry itineraries to 250 destinations in the Mediterranean and we will keep expanding our horizons to new destinations. We always strive to cater to the needs of all travelers and to improve our services.</p>\n<p><br></p>\n<p>The Role</p>\n<p>Selling ferry tickets creates a whole host of questions from our customers, and we pride ourselves on the highest level of customer support in the market. Last year our customer support team interacted in over 41.000 different conversations with different customers; keeping all of them satisfied is no small task, but if you feel up to it, we want to hear from you! We are looking for a seasonal customer support agent to join our fast-growing team in Athens.</p>\n<p>The successful candidate will be responsible to handle customers’ requests and maintain an excellent tailor-made customer experience. We value people who take pride in their work and enjoy the challenge involved in delivering outstanding results.</p>\n<p><br></p>\n<p>Main responsibilities</p>\n<ul>\n<li><p>Receive &amp; process incoming calls &amp; emails </p></li>\n<li><p>Handle general requests in several communication channels</p></li>\n<li><p>Execute ferry tickets cancellations, rebookings and other inquiries</p></li>\n<li><p>Handle force majeure such as strikes or extreme weather events, bulk changes</p></li>\n<li><p>Communicate with Ferry operators and partners </p></li>\n<li><p>Report technical issues internally</p></li>\n<li><p>Suggest improvements to the operational process to ensure the smoothest possible functioning of the team as a whole</p></li>\n</ul>",
    "requirements": "<p>Requirements<br></p>\n<ul>\n<li><p>Excellent knowledge (Native level) of Spanish oral and written</p></li>\n<li><p>Excellent communication in English</p></li>\n<li><p>Familiar working with apps and new technologies /  Computer literacy</p></li>\n<li><p>Bachelor’s degree preferably in Tourism/ Business Administration or any quantitative subject</p></li>\n<li><p>Quality focus and multitasking in a fast-paced environment</p></li>\n<li><p>Dedication to going above and beyond to solve customers' problems</p></li>\n<li><p>Self-motivated, strong time-management and problem solving skills </p></li>\n<li><p>A relentless team player, willing to share ideas and help other team members</p></li>\n</ul>\n<p><br></p>\n<p>It will be good to have</p>\n<ul>\n<li><p>Extra foreign language FR/IT</p></li>\n<li><p>Previous experience in the customer service sector </p></li>\n<li><p>Previous experience in OTAs</p></li>\n<li><p>Knowledge of any CRM app (Freshdesk,Zendesk)</p></li>\n<li><p>Knowledge of ferries ticketing systems (Liknoss,Certus) </p></li>\n</ul>\n<p><br></p>\n<p>Benefits</p>\n<ul>\n<li><p>Competitive compensation package</p></li>\n<li><p>Training</p></li>\n<li><p>Joining a fast-growing and ambitious international team</p></li>\n<li><p>Work in a collaborative and dynamic environment of young people</p></li>\n</ul>",
    "link": "https://ferryhopper.recruitee.com/o/spanish-speaking-seasonal-travel-agent"
},
{
    "id": "job-735101",
    "title": "Credit Control & Reconciliation Manager",
    "company": "ferryhopper",
    "department": null,
    "location": "Athens, Greece",
    "description": "<h2><span style=\"font-size:20px;\">The Company</span></h2>\n<p>Ferryhopper is revolutionizing online ferry booking! We are collaborating with more than 53 major and smaller ferry companies to offer ferry itineraries to 250 destinations in the Mediterranean. We always strive to cater to the needs of all travelers and to improve our services and will keep expanding our horizons to new destinations. </p>\n<h2><span style=\"font-size:20px;\">The Role</span></h2>\n<p>We are currently looking for a Credit Control &amp; Reconciliation Manager to join our fast-growing team and be part of our Accounting department.<span style=\"font-size:18px;\"><br></span></p>\n<h3><span style=\"font-size:20px;\">Main Responsibilities</span></h3>\n<ul>\n<li><p>Managing the general accounting function</p></li>\n<li><p>Evaluating and making appropriate improvements to internal accounting processes ensuring that practices are in line with the overall goals of the organization</p></li>\n<li><p>Handling the accounting (SAP), CRM platforms, and the online banking platforms</p></li>\n<li><p>Issuing and reconciling invoices for customers &amp; external partners</p></li>\n<li><p>Handling financial discrepancies</p></li>\n<li><p>Handling and checking commissions</p></li>\n<li><p>Handling the cancelled tickets and making sure they are sent on time to suppliers</p></li>\n<li><p>Controlling refunds</p></li>\n<li><p>Handling the cash planning, prepayments, and controlling liquidity</p></li>\n<li><p>Maintaining payment dates according to payment terms</p></li>\n<li><p>Dealing with suppliers to ensure charges are accurate and that payments are received in a timely manner</p></li>\n<li><p>Maintaining digital &amp; physical financial records</p></li>\n<li><p>Participating in quarterly &amp; annual audits</p></li>\n<li><p>Communicating with internal &amp; external stakeholders</p></li>\n</ul>",
    "requirements": "<h3>\n<span style=\"font-size:20px;\">Qualifications</span><br>\n</h3>\n<ul>\n<li><p>Academic background in Finance, Economics or Accounting (a Master’s degree is a plus, not a must) </p></li>\n<li><p>3-5 years of hands-on experience in the field of accounting</p></li>\n<li><p>Computer literacy</p></li>\n<li><p>Working knowledge of Accounting software and systems such as SAP</p></li>\n<li><p>Strong written and verbal communication skills, team player</p></li>\n<li><p>Strong organization skills, flexibility and the ability to set priorities</p></li>\n<li><p>Ability to prioritize and juggle concurrent demands </p></li>\n<li><p>Work accurately with close attention to detail, fast learner</p></li>\n</ul>\n<h3>\n<span style=\"font-size:20px;\">Good to have</span><br>\n</h3>\n<ul><li><p>Previous working experience in the travel tech industry (e.g. online travel agency)</p></li></ul>\n<h2><span style=\"font-size:20px;\">Benefits</span></h2>\n<p>Our team is always the number one priority; We offer:</p>\n<ul>\n<li><p>Competitive compensation package</p></li>\n<li><p>Equipment of your choice</p></li>\n<li><p>Access to training and education materials</p></li>\n<li><p>Great office space at the heart of Athens</p></li>\n<li><p>Growth opportunities</p></li>\n<li><p>Flexible working hours </p></li>\n</ul>",
    "link": "https://ferryhopper.recruitee.com/o/credit-control-reconciliation-manager"
},
{
    "id": "job-763979",
    "title": "Node.js Engineer",
    "company": "ferryhopper",
    "department": "Developers",
    "location": "Athens, Greece",
    "description": "<p><br><strong>The Company</strong><br>Ferryhopper is revolutionizing online ferry booking. They are collaborating with more than 53 major and smaller ferry companies to offer ferry itineraries to 250 destinations in the Mediterranean and they will keep expanding their horizons to new destinations. They always strive to cater to the needs of all travelers and to improve their services.<br><br><strong>The role</strong></p>\n<p>Our middleware API is consumed internally (Ferryhopper Website &amp; Mobile App) as well as by 3rd party clients (mainly travel websites). You will be part of the api layer team that develops, maintains, and improves this API. As a Node.js engineer, you will work closely with the mobile app team to build new features as well as with other backend engineers to make use of our services in order to provide a clean and cohesive api.</p>\n<p><strong><br></strong></p>\n<p><strong>You can be the next Ferryhopper if you...</strong><br></p>\n<ul>\n<li><p>Enjoy being part of a growing, fast-moving, and agile team.</p></li>\n<li><p>Like solving problems.</p></li>\n<li><p>Strive to continuously improve and drive technical issues to completion.</p></li>\n<li><p>Like working independently on complex design and development tasks.</p></li>\n<li><p>Can contribute to and discuss different ideas and agree to team decisions on standards and processes.</p></li>\n</ul>\n<p><br></p>",
    "requirements": "<h3>\n<strong><span style=\"font-size:14px;\">Our stack</span></strong><br>\n</h3>\n<ul>\n<li><p>Node.js</p></li>\n<li><p>Nest.js</p></li>\n<li><p>Typescript</p></li>\n<li><p>Jest</p></li>\n<li><p>Rxjs</p></li>\n<li><p>Redis</p></li>\n<li><p>Postgres</p></li>\n<li><p>Firebase</p></li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li><p>Solid grasp of Typescript or ES6+</p></li>\n<li><p>Experience with node.js</p></li>\n<li><p>Familiarity with Object Oriented or Functional Programming (We write OOP but utilise some FP principles)</p></li>\n<li><p>Comfortable with git</p></li>\n<li><p>Testable and clean code matters to you</p></li>\n<li><p>1-3 years of experience in a professional setup</p></li>\n</ul>\n<p><strong>Nice to have</strong></p>\n<ul>\n<li><p>Experience with nest js</p></li>\n<li><p>Familiarity with any other tool of our stack</p></li>\n<li><p>Experience in any other language</p></li>\n<li><p>Experience with docker</p></li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li><p>A competitive compensation package</p></li>\n<li><p>Quick professional development</p></li>\n<li><p>Training and educational budget throughout the year</p></li>\n<li><p>Joining a fast-growing ambitious international team</p></li>\n<li><p>Work in a collaborative and dynamic environment of young people</p></li>\n</ul>",
    "link": "https://ferryhopper.recruitee.com/o/nodejs-engineer"
},
{
    "id": "job-770527",
    "title": "Content Marketing Copywriter",
    "company": "ferryhopper",
    "department": "Marketing",
    "location": "Remote job",
    "description": "<p style=\"max-width:920px;width:100%;\"><img src=\"https://recruitee-main.s3.eu-central-1.amazonaws.com/uploads/8817orvuf2/Content_Marketing_Copywriter.png\" style=\"max-width:920px;width:100%;\"></p>\n<p><br></p>\n<h2>The Company</h2>\n<p>Ferryhopper is revolutionizing <strong>online ferry booking</strong>! We are collaborating with more than 53 major and smaller ferry companies to offer ferry routes to 250 destinations in Southern Europe and Northern Africa. We always strive to cater to the needs of all travelers and to improve our services. We love creating <em>ferrytales</em> and we are constantly trying to expand our horizons.</p>\n<p><br></p>\n<h2>The Role</h2>\n<p>Being knowledgeable, passionate, honest, inclusive, fun, and quirky is what best describes Ferryhopper’s brand. We are currently looking for a full-time Content Marketing Copywriter to rock our socks off! You will be part of our growing Marketing Team in Athens, Greece, with the aim of enhancing its creativity, productivity and imagination.</p>\n<p></p>\n<h3>Responsibilities</h3>\n<p><br></p>\n<ul>\n<li><p>Write, edit and translate high-engagement content that reflects our brand's voice in <strong>English </strong>and <strong>Greek </strong>(knowledge of <strong>Spanish </strong>will be considered an extra asset)</p></li>\n<li><p>Collaborate with other people from the Marketing Team to develop a variety of content <strong>marketing pieces</strong>, contributing to organic web traffic</p></li>\n<li><p>Follow creative and <strong>Search Engine Optimization briefs</strong> to produce clear and persuasive copy</p></li>\n<li><p>Integrate and implement <strong>brand guidelines</strong> to our website texts</p></li>\n<li><p>Ensure brand and writing <strong>consistency </strong>(style, fonts, images, messaging, and tone)</p></li>\n</ul>\n<h2>Benefits</h2>\n<p>Our team is our number one priority; we offer a great working environment. This includes:</p>\n<ul>\n<li><p>Competitive compensation package</p></li>\n<li><p>Work equipment</p></li>\n<li><p>Access to training and education material</p></li>\n<li><p>Great office space at the heart of Athens</p></li>\n<li><p>Growth opportunities</p></li>\n<li><p>Flexible working hours &amp; remote working</p></li>\n</ul>",
    "requirements": "<h3>Requirements</h3>\n<p><br></p>\n<ul>\n<li><p>Creativity, humor, resourcefulness, flexibility, and passion</p></li>\n<li><p>Professional fluency in Greek and English</p></li>\n<li><p>Ability to work independently across text types and switch between projects</p></li>\n<li><p>Attention to detail, excellent organizational and multitasking skills</p></li>\n<li><p>Web content writer experience</p></li>\n</ul>\n<p><br></p>\n<h3>Good to have</h3>\n<p><br></p>\n<ul>\n<li><p>Professional knowledge of Spanish (writing, proofreading, translating)</p></li>\n<li><p>Experience working as a content writer in the travel industry</p></li>\n<li><p>Educational background in Marketing or Tourism Studies</p></li>\n<li><p>SEO writing experience or good understanding of principles and practical applications</p></li>\n</ul>\n<div><br></div>\n<blockquote>Ferryhopper is an equal opportunity employer that welcomes diversity and is committed to inclusion in the workplace. We do not accept discrimination and harassment of any kind.</blockquote>\n<blockquote>This policy applies to all employment practices within our company!</blockquote>",
    "link": "https://ferryhopper.recruitee.com/o/content-marketing-copywriter"
},
{
    "id": "job-787869",
    "title": "Quality Assurance Engineer",
    "company": "ferryhopper",
    "department": "Product",
    "location": "Athens, Greece, Greece",
    "description": "<h2>Who we are</h2>\n<p>Ferryhopper is revolutionizing online ferry booking! We are collaborating with more than 53 major and smaller ferry companies to offer ferry itineraries to more than 250 destinations in the Mediterranean. We always strive to meet the needs of all travelers and to improve our services towards them. And we would like to maintain the excellent quality of our product while expanding our horizons to new destinations!<br></p>\n<p><br></p>\n<h2>The role</h2>\n<p>We are looking for a passionate Quality Assurance (QA) engineer to ensure the quality of our cutting-edge products and an awesome user experience. Working with cross-functional teams of product owners, developers, and designers, you will ensure the quality of our Web and Mobile applications, allowing the efficient delivery of high-quality products and reducing the need for re-work.</p>\n<p>During the development of our products, you will participate in the specifications and testing phases of the features created. The role mainly focuses on the UI/UX testing of our interfaces, which is mainly manual with an outlook of this becoming more and more automated. Along with these, bug reporting and grooming will be part of your daily routine.</p>\n<p><strong>The responsibilities</strong></p>\n<p>As a Quality Assurance engineer you are expected to:</p>\n<ul>\n<li><p>Review specifications to provide timely and meaningful feedback for gaps and pain points.</p></li>\n<li><p>Understand the task at hand and propose the best testing approach for the circumstances.</p></li>\n<li><p>Compose the test scenarios according to the requirements. These scenarios could be describing either manual or automated tests.</p></li>\n<li><p>Execute the test cases (either manually or automatically) and report on the results.</p></li>\n<li><p>Propose new testing tools and test strategies.</p></li>\n<li><p>Identify, document, and track bugs. When bugs are resolved, thorough testing will also be part of the role’s responsibility.</p></li>\n</ul>",
    "requirements": "<h2>The profile</h2>\n<p>This is a position that is heavily based on the ability to identify existing and potential bugs both during the release cycle, but also during the lifetime of our products. In this respect, soft and hard skills are needed to fulfill the daily tasks of the position.</p>\n<p>If we could break these down into bullets, these would be:</p>\n<ul>\n<li><p>Thinking analytically. You need to analyze problems and spot possible pain points.</p></li>\n<li><p>Being an advocate of quality in everything you do.</p></li>\n<li><p>Having a keen eye for detail and commitment to excellence.</p></li>\n<li><p>Being passionate about process improvements to take testing to the high standards.</p></li>\n<li><p>Being fluent in both English and Greek languages (verbal and written).</p></li>\n</ul>\n<p>On a more technical level the successful candidate <strong>should have</strong>:</p>\n<ul>\n<li><p>Technical background.</p></li>\n<li><p>Prior quality assurance and testing experience for at least 2-3 years.</p></li>\n<li><p>Knowledge of structured test methods and procedures.</p></li>\n<li><p>Understanding of agile development methodologies and of Test Driven Development.</p></li>\n</ul>\n<p>Adding to the above the successful candidate would be <strong>nice to have</strong>:</p>\n<ul>\n<li><p>ISTQB certification.</p></li>\n<li><p>Familiarity with UX concepts and best practices.</p></li>\n<li><p>Familiarity with e-commerce challenges.</p></li>\n<li><p>Experience working with version control systems.</p></li>\n<li><p>Experience in test automation tools (e.g. Selenium, Cypress).</p></li>\n</ul>\n<div><br></div>\n<h2>Benefits</h2>\n<ul>\n<li><p>A competitive compensation package.</p></li>\n<li><p>Quick professional development.</p></li>\n<li><p>Training and educational budget throughout the year.</p></li>\n<li><p>Joining a fast-growing ambitious international team.</p></li>\n<li><p>Work in a collaborative and dynamic environment of young people.</p></li>\n</ul>\n<p><br></p>\n<p><em>Ferryhopper is an equal opportunity employer that welcomes diversity and is committed to inclusion in the workplace. We do not accept discrimination and harassment of any kind. This policy applies to all employment practices within our company.</em><br></p>",
    "link": "https://ferryhopper.recruitee.com/o/quality-assurance-engineer"
}
]