[
{
    "id": "job-479000",
    "title": "React Native Developer",
    "company": "ferryhopper",
    "department": "Developers",
    "location": "Athens, Greece",
    "description": "<p>Ferryhopper is an online booking engine that makes island-hopping around Greece as easy as a breeze. Our modern and innovative platform presents the user with every available direct and indirect connection to over 160 Greek islands and major ports. Through Ferryhopper, the traveler can plan their ferry trip effortlessly, book their tickets quickly, compare prices instantly, secure the cheapest fare, and start hopping!</p>\n<p><br></p>\n<p><strong>What is the role we are looking for?</strong></p>\n<p><br></p>",
    "requirements": "<p><strong><br></strong></p>\n<p><strong>You can be the next Ferryhopper if you...</strong></p>\n<ul>\n<li>Enjoy being part of a small, fast-moving, and agile team</li>\n<li>Like solving problems</li>\n<li>Love building interfaces that captivate users</li>\n<li>Cannot spend a day without reading about the new cool things in the JS ecosystem</li>\n<li>Strive to continuously improve and drive technical issues to completion</li>\n<li>Can work independently on complex design and development tasks</li>\n<li>Enjoy contributing to and discussing different ideas and agree to team decisions on standards and processes<br>\n</li>\n</ul>\n<p><strong>What you will be doing?</strong></p>\n<ul>\n<li>Write well designed, testable, and efficient TypeScript code by using state-of-the-art software development practices</li>\n<li>Complement our UI library with pixel-perfect components</li>\n<li>Stay up-to-date with the React/React Native ecosystem and industry-leading standards and conventions</li>\n<li>Participate in training &amp; discussion sessions, sharing knowledge with the rest of the engineering team</li>\n</ul>\n<ul>\n<li>Engage in an agile environment with frequent releases</li>\n<li>Work closely with UX Designers, Product Owners, and Backend Developers to build scalable, intuitive experiences in both platforms</li>\n</ul>\n<p><strong></strong><strong>What you need to have</strong></p>\n<ul>\n<li>At least 2 years of experience in React or React Native</li>\n<li>Knowledge of the React Native ecosystem, from debugging to building complex interactions and animations</li>\n<li>Strong understanding of JavaScript (ES6+). You feel comfortable with scopes and closures and know your way around .map(), .reduce() and .filter()</li>\n<li>Proven experience with TypeScript</li>\n<li>Experience with at least one React state management tool or solution</li>\n<li>Understanding of functional programming</li>\n<li>Comfortable with Git and issue tracking tools</li>\n<li>Experience with Jest or other testing frameworks</li>\n</ul>\n<p><strong>What is nice to have :)</strong></p>\n<ul>\n<li>Experience with Ramda, RxJS, Redux</li>\n<li>Familiarity with Google Firebase</li>\n<li>Experience with NodeJS</li>\n<li>Familiarity with the Elm programming language</li>\n</ul>\n<p><strong>What we offer</strong><br></p>\n<ul>\n<li>Competitive compensation package</li>\n<li>Fun and collaborative work environment with flexible working</li>\n<li>Quick professional development</li>\n<li>Training and education budget throughout the year</li>\n<li>Joining a fast-growing ambitious international team</li>\n</ul>",
    "link": "https://ferryhopper.recruitee.com/o/react-native-developer"
}
]