[
{
    "id": "job-787869",
    "title": "Quality Assurance Engineer",
    "company": "ferryhopper",
    "department": "Product",
    "location": "Remote job",
    "description": "<h2>Who we are</h2>\n<p>Ferryhopper is revolutionizing online ferry booking! We are collaborating with more than 53 major and smaller ferry companies to offer ferry itineraries to more than 250 destinations in the Mediterranean. We always strive to meet the needs of all travelers and to improve our services towards them. And we would like to maintain the excellent quality of our product while expanding our horizons to new destinations!<br></p>\n<p><br></p>\n<h2>The role</h2>\n<p>We are looking for a passionate Quality Assurance (QA) engineer to ensure the quality of our cutting-edge products and an awesome user experience. Working with cross-functional teams of product owners, developers, and designers, you will ensure the quality of our Web and Mobile applications, allowing the efficient delivery of high-quality products and reducing the need for re-work.</p>\n<p>During the development of our products, you will participate in the specifications and testing phases of the features created. The role mainly focuses on the UI/UX testing of our interfaces, which is mainly manual with an outlook of this becoming more and more automated. Along with these, bug reporting and grooming will be part of your daily routine.</p>\n<p><strong>The responsibilities</strong></p>\n<p>As a Quality Assurance engineer you are expected to:</p>\n<ul>\n<li><p>Review specifications to provide timely and meaningful feedback for gaps and pain points.</p></li>\n<li><p>Understand the task at hand and propose the best testing approach for the circumstances.</p></li>\n<li><p>Compose the test scenarios according to the requirements. These scenarios could be describing either manual or automated tests.</p></li>\n<li><p>Execute the test cases (either manually or automatically) and report on the results.</p></li>\n<li><p>Propose new testing tools and test strategies.</p></li>\n<li><p>Identify, document, and track bugs. When bugs are resolved, thorough testing will also be part of the role’s responsibility.</p></li>\n</ul>",
    "requirements": "<h2>The profile</h2>\n<p>This is a position that is heavily based on the ability to identify existing and potential bugs both during the release cycle, but also during the lifetime of our products. In this respect, soft and hard skills are needed to fulfill the daily tasks of the position.</p>\n<p>If we could break these down into bullets, these would be:</p>\n<ul>\n<li><p>Thinking analytically. You need to analyze problems and spot possible pain points.</p></li>\n<li><p>Being an advocate of quality in everything you do.</p></li>\n<li><p>Having a keen eye for detail and commitment to excellence.</p></li>\n<li><p>Being passionate about process improvements to take testing to the high standards.</p></li>\n<li><p>Being fluent in both English and Greek languages (verbal and written).</p></li>\n</ul>\n<p>On a more technical level the successful candidate <strong>should have</strong>:</p>\n<ul>\n<li><p>Technical background.</p></li>\n<li><p>Prior quality assurance and testing experience for at least 2-3 years.</p></li>\n<li><p>Knowledge of structured test methods and procedures.</p></li>\n<li><p>Understanding of agile development methodologies and of Test Driven Development.</p></li>\n</ul>\n<p>Adding to the above the successful candidate would be <strong>nice to have</strong>:</p>\n<ul>\n<li><p>ISTQB certification.</p></li>\n<li><p>Familiarity with UX concepts and best practices.</p></li>\n<li><p>Familiarity with e-commerce challenges.</p></li>\n<li><p>Experience working with version control systems.</p></li>\n<li><p>Experience in test automation tools (e.g. Selenium, Cypress).</p></li>\n</ul>\n<div><br></div>\n<h2>Benefits</h2>\n<ul>\n<li><p>A competitive compensation package.</p></li>\n<li><p>Quick professional development.</p></li>\n<li><p>Training and educational budget throughout the year.</p></li>\n<li><p>Joining a fast-growing ambitious international team.</p></li>\n<li><p>Work in a collaborative and dynamic environment of young people.</p></li>\n</ul>\n<p><br></p>\n<p><em>Ferryhopper is an equal opportunity employer that welcomes diversity and is committed to inclusion in the workplace. We do not accept discrimination and harassment of any kind. This policy applies to all employment practices within our company.</em><br></p>",
    "link": "https://ferryhopper.recruitee.com/o/quality-assurance-engineer"
},
{
    "id": "job-814665",
    "title": "Performance Marketing Manager",
    "company": "ferryhopper",
    "department": "Marketing",
    "location": "Remote job",
    "description": "<p style=\"max-width:920px;width:100%;\"><img src=\"https://recruitee-main.s3.eu-central-1.amazonaws.com/uploads/bchyhlw841/Perfomance_Marketng_Manager_Layout-05.png\" style=\"max-width:920px;width:100%;\"></p>\n<p><br></p>\n<h2>\n<span style=\"font-size:18px;\"><span style=\"font-size:24px;\">Who are we looking for?</span></span><br>\n</h2>\n<p>If you are a passionate, curious and experienced digital marketer then keep reading, because... We are currently looking for a full-time Performance Marketing Manager to sail with us! You will be part of our growing Marketing Team in Athens, Greece, and<span style=\"color:rgb(0, 0, 0);\"> you will be leading our quirky performance team. </span></p>\n<h3>What will you be doing?</h3>\n<ul>\n<li>Creating a strong performance marketing strategy &amp; an execution plan<br>\n</li>\n<li>Managing budgets and campaigns across all digital channels to drive strong return on investment and achieve other KPIs</li>\n<li>Ensuring successful planning, execution, optimization for key traffic KPIs via paid, organic &amp; own marketing channels</li>\n<li>Measuring and reporting performance of all digital marketing actions, and assess towards goals</li>\n<li>Identifying trends and insights, and optimize actions according to them</li>\n<li>Collaborating with internal teams to implement all strategies</li>\n<li>Identifying and testing new channels to continue to meet or exceed established critical metrics</li>\n<li>Working closely with the management to share funnel conversion improvement ideas, feedback &amp; present results</li>\n</ul>\n<h2><span style=\"font-size:24px;\">What we offer</span></h2>\n<p>Our team is our number one priority; we offer a great working environment. This includes:</p>\n<ul>\n<li><p>Competitive compensation package</p></li>\n<li><p>Work equipment</p></li>\n<li><p>Access to training and education material</p></li>\n<li><p>Great office space at the heart of Athens</p></li>\n<li><p>Growth opportunities</p></li>\n<li><p>Flexible working hours &amp; remote working</p></li>\n</ul>",
    "requirements": "<ul>\n<li><p>At least three years of relevant work experience</p></li>\n<li><p>Solid expertise in campaign and channel analysis and reporting, including Google Analytics experience</p></li>\n<li><p>Demonstrable experience leading and managing SEO/SEM, marketing database, email, social media and display advertising campaigns</p></li>\n<li><p>Excellent analytical skills and love for data, metrics and numbers</p></li>\n<li><p>Great communication and team management skills</p></li>\n<li><p>Professional fluency in Greek and English</p></li>\n<li><p>Ability to work independently and switch between projects</p></li>\n</ul>\n<div><span style=\"font-size:12px;\"><span style=\"font-size:18px;\"><span style=\"font-size:20px;\"><span style=\"font-size:24px;\">About the Company</span></span></span></span></div>\n<p>Ferryhopper is revolutionizing <strong>online ferry booking</strong>! We are collaborating with more than 53 major and smaller ferry companies to offer ferry routes to 250 destinations in Southern Europe and Northern Africa. We always strive to cater to the needs of all travelers and to improve our services. We love creating <em>ferrytales</em> and we are constantly trying to expand our horizons.</p>\n<div><br></div>\n<blockquote>Ferryhopper is an equal opportunity employer that welcomes diversity and is committed to inclusion in the workplace. We do not accept discrimination and harassment of any kind.</blockquote>\n<blockquote>This policy applies to all employment practices within our company!</blockquote>",
    "link": "https://ferryhopper.recruitee.com/o/performance-marketing-manager"
},
{
    "id": "job-816425",
    "title": "Ancillary Specialist",
    "company": "ferryhopper",
    "department": "Commercial",
    "location": "Athens, Greece",
    "description": "<h2>The Company</h2>\n<p>Ferryhopper is an online travel company based in Athens, Greece. We specialise in ferry ticket sales, powered by our in-house search engine which compares ferry ticket prices and itineraries across 10 different countries, including Greece, Italy, Spain, and Turkey. </p>\n<p>Ferryhopper has revolutionised the online ferry ticket booking process by simplifying all the complexities of ferry ticket selection: from itineraries to seats, cabins to motorbikes, and campervans to foot-passenger tickets. </p>\n<p>In building this simplicity, Ferryhopper has been distinctly focused on providing a ferry-centric experience. It is now time, with a considerable monthly user base and over 3M tickets sold, to ensure Ferryhopper customers can access a complete travel experience through our products. From adding recommendations for port transfer taxi services through to enabling customers to buy travel insurance with their tickets, Ferryhopper is looking to boost it’s profit margins through ancillary services. </p>\n<h2>The Position</h2>\n<p>In a sentence, you will be the carrier of all ancillary services  offered on Ferryhopper -  an ancillary is any service available through Ferryhopper which is not a basic ferry ticket. In more detail, you will be expected to:</p>\n<p><br></p>\n<ul>\n<li><p>Develop a commercial strategy for cross and up selling our products; </p></li>\n<li><p>Identify relevant products and services to include in our offer; </p></li>\n<li><p>Contact, negotiate and contract with the most appropriate providers for the above, building strong relationships with our suppliers; </p></li>\n<li><p>Imagine and co-create any “in-house” ancillaries (eg premium check-in service, home delivery, etc) and project manage their deployment to our products;  </p></li>\n<li><p>Identify the most suitable and appropriate touchpoints in our products to serve these ancillaries; </p></li>\n<li><p>Coordinate across and support other departments in the deployment of the selected products in the selected touchpoints; </p></li>\n<li><p>Build and maintain dashboards to monitor and improve the relative performance of each product in each touch point through clear KPIs; </p></li>\n<li><p>Continuously review the ancillary program to ensure it best serves the needs of the customers, while maximising ancillary revenue for the company.</p></li>\n</ul>\n<h2>Organisational set-up</h2>\n<p>You will be reporting directly to the Commercial Director and will be part of the Commercial team. Seeing as the ancillary services are served in a wide variety of touchpoints, you will need to coordinate closely with a wide range of stakeholders across the company, from Product Owners through to Content Managers and of course the CRM team.<br></p>",
    "requirements": "<h2>The Successful Candidate</h2>\n<p>To achieve this, you will need to have: </p>\n<ul>\n<li><p>Analytical skills, and passion for convincing with data; </p></li>\n<li><p>Commercial acumen, and the ability to challenge, influence &amp; negotiate; </p></li>\n<li><p>Strategic thinking, with an ability to see the big picture, analyze complex data and focus on important detail;</p></li>\n</ul>\n<p>We are open to a wide range of applicants for this position, with proven experience valued above educational achievements. We expect as an absolute minimum that any candidate is comfortable with at least the following tools: </p>\n<ul>\n<li><p>Google Analytics</p></li>\n<li><p>Google Data Studio</p></li>\n<li><p>Google and Microsoft Office Suites, in particular spreadsheet programs.</p></li>\n<li><p>At least one CRM tool and an appetite to adapt to our chosen tool.</p></li>\n</ul>",
    "link": "https://ferryhopper.recruitee.com/o/ancillary-specialist"
},
{
    "id": "job-817027",
    "title": "Product Owner",
    "company": "ferryhopper",
    "department": "Engineering",
    "location": "Remote job",
    "description": "<h2>About Ferryhopper</h2>\n<p><br></p>\n<p>Ferryhopper is an online travel company based in Athens, Greece. We specialise in ferry ticket sales, powered by our in-house search engine which compares ferry ticket prices and itineraries across 10 different countries, including Greece, Italy, Spain, and Turkey.</p>\n<p>Ferryhopper has revolutionised the online ferry ticket booking process by simplifying all the complexities of ferry ticket selection: from itineraries to seats, cabins to motorbikes, and campervans to foot-passenger tickets.</p>\n<p>We are relentless in our thrive for improving our product and the services that we provide to our users. In this respect we are looking for a Product Manager who will be responsible for the web application of Ferryhopper. We value people who enjoy analyzing needs, spotting opportunities and providing solutions even in non-well-defined problems.<br></p>\n<br>\n<p><br></p>\n<h2>Role description</h2>\n<p><br></p>\n<p>Do you love travelling with ferries? Do you get passionate about making travel arrangements easy and exciting? If yes, then Ferryhopper is the right place!</p>\n<p>As a Product Team in Ferryhopper we are always looking to deliver excellent products that make the life of travellers better and easier. We go the extra mile and provide solutions for ferry travellers even in non-well defined problems.</p>\n<p>As a Product Owner of our website, you will have the opportunity to change the way people perceive online ferry booking. Within our team you will be responsible for leading the full life-cycle of new features, driving the respective vision, strategy and roadmap. By definition, this role is cross-functional and you will be working closely with development, design, marketing, operations, customer care, and commercial teams, to bring what matters into life.</p>\n<p>The ideal candidate will have a track record of owning and managing technology products from conceptualization to launch, show a deep customer focus, and have a mature business judgment. Highest levels of quality in products and customer experience are among our key values in Ferryhopper and what this role will strive to deliver.</p>\n<p><strong><br></strong></p>\n<p><strong>The key responsibilities:</strong><br><br></p>\n<ul>\n<li>Explore customer needs and receive user feedback;</li>\n<li>Collaborate with stakeholders to understand their needs;</li>\n<li>Work side-by-side with our developers and designers;</li>\n<li>Participate and contribute to the scrum rituals of the team;</li>\n<li>Prioritize projects and set goals aligned with the product strategy;</li>\n<li>Own the product roadmap for the website team;</li>\n<li>Break down complex ideas into executable features and priorities;</li>\n<li>Define the MVP of each feature and prioritize the issues respectively;</li>\n<li>Produce detailed and clear specifications for new product features, appropriately comprehensible by the engineering teams;</li>\n<li>Ensure the quality of the feature to be released;</li>\n<li>Measure the success and usage of the features and ensure their constant improvement.</li>\n</ul>",
    "requirements": "<h2>The profile</h2>\n<p>The succesful candidate, </p>\n<p><strong>Must have: </strong></p>\n<ul>\n<li><p>At least 2 years of experience in product management and at least 4 years of experience in digital products;</p></li>\n<li><p>A proven track record of bringing to life experiences that users love, shown through your ability to conceptualize, define and deliver;</p></li>\n<li><p>Comfort with transforming vague ideas into clear actions;</p></li>\n<li><p>A sharp, analytical mind: your decisions are data-driven and supported by the data that you have researched and collected;</p></li>\n<li><p>Understanding fundamental design and usability principles behind a scalable application; </p></li>\n<li><p>Well versed in lean product development and agile engineering methodologies such as Scrum and/or Kanban; </p></li>\n<li><p>Familiarity with project / task management tools (Youtrack, JIRA, Trello, Asana, etc.);</p></li>\n<li><p>Great communication and organizational skills; you will be functioning in an international environment.</p></li>\n</ul>\n<p><strong><br></strong></p>\n<p><strong>It would be nice to have:</strong><br></p>\n<ul>\n<li><p>Studies in the field of Engineering, Information Technology, Management of Digital Products or Product Design; </p></li>\n<li><p>Prior experience in the creation of digital travel or e-commerce products;</p></li>\n<li><p>A career with strong focus on UX, UI and Design Thinking;</p></li>\n<li><p>A proven track record that you love travelling (just kidding).</p></li>\n</ul>\n<h2><br></h2>\n<h2>Benefits</h2>\n<p>The health of our company and the success of our products is directly related to the health of our team and the work environment we create for ourselves. With this in mind, we strive to provide an inclusive and positive working environment. In this respect, we offer:</p>\n<p><br></p>\n<ul>\n<li>Quick professional development.</li>\n<li>Equipment of your choice;</li>\n<li><p>Training and educational budget throughout the year.</p></li>\n<li><p>Joining a fast-growing ambitious international team.</p></li>\n<li><p>Work in a collaborative and dynamic environment of young people.</p></li>\n</ul>\n<p><br></p>\n<p><em>Ferryhopper is an equal opportunity employer that welcomes diversity and is committed to inclusion in the workplace. We do not accept discrimination and harassment of any kind. This policy applies to all employment practices within our company.</em><br></p>",
    "link": "https://ferryhopper.recruitee.com/o/product-owner-athens-greece"
},
{
    "id": "job-828107",
    "title": "Finance Manager",
    "company": "ferryhopper",
    "department": "finance",
    "location": "Athens, Greece",
    "description": "<h3><strong>The Company</strong></h3>\n<p>Ferryhopper is revolutionizing online ferry booking. We are collaborating with more than 53 major and smaller ferry companies to offer ferry itineraries to 250 destinations in the Mediterranean and we will keep expanding our horizons to new destinations. We always strive to cater to the needs of all travelers and to improve our services.</p>\n<h3><strong>The Role</strong></h3>\n<p>Being a constantly growing team of 80 people in the forthcoming months, we are looking for a Financial Manager to manage, analyze and oversee everyday financial activities. The ideal candidate will need to have solid experience in finance or accounting, forecasting, and budgeting with main responsibilities to produce financial reports, company annual budget, and future financial plans, to communicate financial information to the management team, and to present financial and business updates to investors.<br></p>",
    "requirements": "<h3><strong>Main Responsibilities</strong></h3>\n<ul>\n<li><p>Collecting, interpreting, and reviewing financial information</p></li>\n<li><p>Create monthly and annual reports to identify results, trends, and financial forecasts</p></li>\n<li><p>Develop budgets and financial plans for the company based on research and data reports</p></li>\n<li><p>Report to the management team, and offer insights and financial advice on how to meet the company’s objectives</p></li>\n<li><p>Developing long-term business plans based on these reports</p></li>\n<li><p>Analyze costs, pricing, variable contributions, sales results, and the company’s actual performance compared to the business plans.</p></li>\n<li><p>Supervise internal commercial accountants and financial assistants</p></li>\n<li><p>Overview that all financial transactions are properly recorded, filed and reported</p></li>\n<li><p>Report to the CEO with timely and accurate financial information</p></li>\n<li><p>Work closely with the CEO to present reports to senior executives, investors, and board members.</p></li>\n<li><p>Coordinate with all departments, discussing company plans and agreeing on future paths to be taken.</p></li>\n<li><p>Ensuring organizational financial stability.</p></li>\n</ul>\n<div>\n<h3><strong>Job Requirements</strong></h3>\n<ul>\n<li><p>Proven experience as a Financial Manager</p></li>\n<li><p>Experience in the financial sector with previous possible roles</p></li>\n<li><p>5+ years of overall combined finance and accounting experience</p></li>\n<li><p>BS/MA degree in Finance, Accounting or Economics</p></li>\n<li><p>A solid understanding of financial statistics and accounting principles</p></li>\n<li><p>Experience in relationships with investors</p></li>\n<li><p>Excellent accounting software user and administration skills</p></li>\n<li><p>Strong Leadership qualities</p></li>\n<li><p>Strong interpersonal, communication, and presentation skills</p></li>\n<li><p>Negotiation skills and analytical thinking</p></li>\n<li><p>Commercial and business awareness</p></li>\n<li><p>A keen eye for detail and desire to probe further into data</p></li>\n<li><p>Fluency in English</p></li>\n<li><p>Ability to produce advanced financial analyses using Microsoft Excel</p></li>\n</ul>\n<div>\n<h3><strong>Benefits</strong></h3>\n<ul>\n<li><p>Competitive compensation package</p></li>\n<li><p>Joining a fast-growing and ambitious international team</p></li>\n<li><p>Growth opportunities and quick professional development</p></li>\n<li><p>Equipment of your choice</p></li>\n<li><p>Work in a collaborative and dynamic environment of young people</p></li>\n<li><p>Flexible working hours &amp; remote working</p></li>\n</ul>\n</div>\n</div>",
    "link": "https://ferryhopper.recruitee.com/o/finance-manager"
},
{
    "id": "job-830145",
    "title": "Multilingual Customer Support Representative",
    "company": "ferryhopper",
    "department": "Operations & Maintenance",
    "location": "Athens, Greece",
    "description": "<p>The Company</p>\n<p>Ferryhopper is revolutionizing online ferry booking. We are collaborating with more than 50 major and smaller ferry companies to offer ferry itineraries to 250 destinations in the Mediterranean and we will keep expanding our horizons to new destinations. We always strive to cater to the needs of all travelers and to improve our services.</p>\n<p><br></p>\n<p>The Role</p>\n<p>Selling ferry tickets creates a whole host of questions from our customers, and we pride ourselves on the highest level of customer support in the market. Last year our customer support team interacted in over 41.000 different conversations with different customers; keeping all of them satisfied is no small task, but if you feel up to it, we want to hear from you! We are looking for a seasonal customer support agent to join our fast-growing team in Athens.</p>\n<p>The successful candidate will be responsible to handle customers’ requests and maintain an excellent tailor-made customer experience. We value people who take pride in their work and enjoy the challenge involved in delivering outstanding results.</p>\n<p><br></p>\n<p>Main responsibilities</p>\n<ul>\n<li><p>Receive &amp; process incoming calls &amp; emails </p></li>\n<li><p>Handle general requests in several communication channels</p></li>\n<li><p>Execute ferry tickets cancellations, rebookings and other inquiries</p></li>\n<li><p>Handle force majeure such as strikes or extreme weather events, bulk changes</p></li>\n<li><p>Communicate with Ferry operators and partners </p></li>\n<li><p>Report technical issues internally</p></li>\n<li><p>Suggest improvements to the operational process to ensure the smoothest possible functioning of the team as a whole</p></li>\n</ul>",
    "requirements": "<p>Requirements<br></p>\n<p></p>\n<ul>\n<li><p>Fluent speaker <strong>in more than one </strong>of the following languages: <strong>German / French / Spanish / Italian </strong></p></li>\n<li><p>Excellent communication in English</p></li>\n<li><p>Familiar working with apps and new technologies /  Computer literacy</p></li>\n<li><p>Bachelor’s degree preferably in Tourism/ Business Administration or any quantitative subject</p></li>\n<li><p>Quality focus and multitasking in a fast-paced environment</p></li>\n<li><p>Dedication to going above and beyond to solve customers' problems</p></li>\n<li><p>Self-motivated, strong time-management and problem solving skills </p></li>\n<li><p>A relentless team player, willing to share ideas and help other team members</p></li>\n</ul>\n<p><br></p>\n<p><br></p>\n<p>It will be good to have</p>\n<p></p>\n<ul>\n<li><p>Extra foreign language FR/IT/SP</p></li>\n<li><p>Previous experience in the customer service sector </p></li>\n<li><p>Previous experience in OTAs</p></li>\n<li><p>Knowledge of any CRM app (Freshdesk,Zendesk)</p></li>\n<li><p>Ideally based in Athens</p></li>\n</ul>\n<p><br></p>\n<p><br></p>\n<p>Benefits</p>\n<ul>\n<li><p>Competitive compensation package</p></li>\n<li><p>Training</p></li>\n<li><p>Quick professional development</p></li>\n<li><p>Joining a fast-growing and ambitious international team</p></li>\n<li><p>Work in a collaborative and dynamic environment of young people</p></li>\n</ul>",
    "link": "https://ferryhopper.recruitee.com/o/multilingual-customer-support-representative-athens"
},
{
    "id": "job-831191",
    "title": "Junior Account Manager - Greece",
    "company": "ferryhopper",
    "department": "Commercial",
    "location": "Athens, Greece",
    "description": "<h2>The Company</h2>\n<p>Ferryhopper is an online travel company based in Athens, Greece. We specialise in ferry ticket sales, powered by our in-house search engine which compares ferry ticket prices and itineraries across 10 different countries, including Greece, Italy, Spain and Turkey. </p>\n<p>Ferryhopper has revolutionised the online ferry booking process by simplifying all the complexities of ferry ticket selection: from itineraries to seats, cabins to motorbikes, and campervans to foot-passenger tickets. </p>\n<p>Ferryhopper is determined to become the Global Ferry Expert, which can only happen through strong partnerships with our suppliers: the ferry companies. We are looking for someone to join our account management team and nurture the relationships we have built with ferry companies in the Greek market. Interacting effectively with our suppliers allows us to provide our final customers with the best ferry booking engine on the market.</p>\n<h2>The Position</h2>\n<p>In a sentence, you will support the communication between Ferryhopper and some Greek ferry companies. </p>\n<p>In more detail, you will be asked to: </p>\n<p><br></p>\n<ul>\n<li><p>Support the maintenance an effective relationship with relevant stakeholders in each account under your management; </p></li>\n<li><p>Implement, with support from the Senior Account Manager, an action plan for each account on a regular basis; </p></li>\n<li><p>Support in troubleshooting any issues that arise with these accounts, ranging from operational, to technical, through to marketing and of course covering commercial concerns. </p></li>\n</ul>\n<p>By doing the above, you will be directly enabling Ferryhopper to: </p>\n<ul>\n<li><p>Provide the most complete and up-to-date ferry booking engine on the market; </p></li>\n<li><p>Secure our recently gained influential position in the Greek market, building credibility for our continued geographic expansion; </p></li>\n<li><p>Maximise the value of our recent and rapid market growth in Greece; </p></li>\n<li><p>Stay fully relevant to our market as we continue to grow, reacting effectively and timely to any changes that could affect us;</p></li>\n<li><p>Transition from the up-and-coming outsider to the established and understood market leader;</p></li>\n</ul>",
    "requirements": "<h2>The Successful Candidate</h2>\n<p>To achieve this, you will need to be: </p>\n<ul>\n<li><p>Excited about working with a wide variety of people from within the ferry industry: building sustainable long-term commercial relationships with them;</p></li>\n<li><p>An avid problem solver, always looking for the best solution for your accounts within Ferryhopper’s product; </p></li>\n<li><p>Data oriented, and evidence driven, looking to understand why and how different accounts are behaving differently on our platform;</p></li>\n<li><p>Perfectly fluent in Greek with a strong business level of English (other languages always an advantage, especially Italian); </p></li>\n<li><p>Comfortable working with a wide range of basic digital platforms (Office Suites, CRM, Task Management, etc)</p></li>\n</ul>\n<p>We are open to a wide range of applicants for this position, with proven experience valued above educational achievements, however any points on the following list will strengthen your application: </p>\n<ul>\n<li><p>A degree in a relevant field such as Business Administration, Commerce, Trade or other; </p></li>\n<li><p>Experience of successfully maintaining and upgrading an existing list of accounts; </p></li>\n</ul>\n<h2>Organisational set-up</h2>\n<p>The successful applicant will be reporting to the Senior Account Manager, in the Commercial Department.<br></p>",
    "link": "https://ferryhopper.recruitee.com/o/junior-account-manager-greece"
},
{
    "id": "job-836150",
    "title": "Office Administrator",
    "company": "ferryhopper",
    "department": "Operations & Maintenance",
    "location": "Athens, Greece",
    "description": "<h3><strong>The Company</strong></h3>\n<p>Ferryhopper is revolutionizing online ferry booking. We are collaborating with more than 53 major and smaller ferry companies to offer ferry itineraries to 250 destinations in the Mediterranean and we will keep expanding our horizons to new destinations. We always strive to cater to the needs of all travelers and to improve our services.</p>\n<p> </p>\n<p><strong>The Role</strong></p>\n<p>With a constantly growing team of 60 to 100 people in the forthcoming months, we are looking for an Office Administrator to organize and coordinate administration duties and office procedures.<br>The ideal candidate will be competent in prioritizing tasks, being self-motivated, and trustworthy. The office administrator ensures smooth running of our company’s offices and contributes in driving sustainable growth.</p>\n<h3><strong>Main Responsibilities</strong></h3>\n<ul>\n<li><p>Oversee and achieve organizational goals while maintaining an efficient, productive, and positively cultured office and employee experience </p></li>\n<li><p>Keep track &amp; collect invoices and financial files (digital and physical financial records)</p></li>\n<li><p>Ensure general management of the office, overseeing operational efficiency, effective communications</p></li>\n<li><p>Create and update records and databases with personnel</p></li>\n<li><p>Organizing the office layout and ordering stationery and equipment</p></li>\n<li><p>Maintain facilities management and facilitation of all office functions and services</p></li>\n<li><p>Support bookkeeping procedures</p></li>\n<li><p>Manage and coordinate travel arrangements </p></li>\n<li><p>Provide general support to visitors</p></li>\n</ul>",
    "requirements": "<p><strong>Job Requirements</strong></p>\n<ul>\n<li><p>Proven experience as an office administrator, office assistant, or relevant role</p></li>\n<li><p>Excellent organizational skills &amp; Outstanding communication</p></li>\n<li><p>Familiarity with office management procedures and basic accounting principles</p></li>\n<li><p>Ability to handle sensitive, confidential information</p></li>\n<li><p>BSc/BA is preferred <br><br></p></li>\n</ul>\n<p>It will be good to have</p>\n<ul>\n<li><p>Travel Industry or relevant experience</p></li>\n<li><p>Additional qualification as an Administrative assistant will be a plus</p></li>\n</ul>\n<div>\n<h3><strong>Benefits</strong></h3>\n<ul>\n<li><p>Competitive compensation package</p></li>\n<li><p>Joining a fast-growing and ambitious international team</p></li>\n<li><p>Training</p></li>\n<li><p>Growth opportunities</p></li>\n<li><p>Work in a collaborative and dynamic environment of young people</p></li>\n</ul>\n</div>",
    "link": "https://ferryhopper.recruitee.com/o/office-administrator"
}
]