[
{
    "id": "job-596284",
    "title": "Experienced Seasonal Ferries Travel Agent",
    "company": "ferryhopper",
    "department": null,
    "location": "athens, Greece",
    "description": "<p><strong>The Company</strong></p>\n<p>Ferryhopper is revolutionizing online ferry booking. We are collaborating with more than 53 major and smaller ferry companies to offer ferry itineraries to 250 destinations in the Mediterranean and we will keep expanding our horizons to new destinations. We always strive to cater to the needs of all travelers and to improve our services.</p>\n<p><strong>The Role</strong></p>\n<p>Selling ferry tickets creates a whole host of questions from our customers, and we pride ourselves on the highest level of customer support in the market. Last year our customer support team interacted in over 41,000 different conversations with different customers; keeping all of them satisfied is no small task, but if you feel up to it, we want to hear from you! We are looking for a  seasonal customer support agent to join our fast-growing team in Athens.</p>\n<p>The successful candidate will be responsible to handle customers’ requests and maintain an excellent tailor-made customer experience. We value people who take pride in their work and enjoy the challenge involved in delivering outstanding results.</p>\n<p><strong>Main responsibilities</strong></p>\n<ul>\n<li>Receive &amp; process incoming calls &amp; emails </li>\n<li>Accommodate customers in person at our reception desk</li>\n<li>Handle general requests in several communication channels</li>\n<li>Execute ferry tickets cancellations, rebookings and other inquiries</li>\n<li>Handle force majeure such as strikes or extreme weather events, bulk changes</li>\n<li>Communicate with Ferry operators and partners </li>\n<li>Report technical issues internally</li>\n<li>Suggest improvements to the operational process to ensure the smoothest possible functioning of the team as a whole</li>\n</ul>",
    "requirements": "<p><strong>Requirements</strong></p>\n<ul>\n<li>Excellent knowledge English and Greek</li>\n<li>3 years previous experience in Ferry Travel Agency </li>\n<li>Experienced user of ferries ticketing systems (Liknoss,Certus) </li>\n<li>Familiar working with apps and new technologies - Computer literacy</li>\n<li>Quality focus and multitasking in a fast-paced environment</li>\n<li>Dedication to going above and beyond to solve customers' problems</li>\n<li>Self-motivated, strong time-management and problem solving skills </li>\n<li>A relentless team player, willing to share ideas and help other team members</li>\n</ul>\n<p><span style=\"font-size: 14px;\"><strong>\n</strong></span></p>\n<p><strong><br></strong></p>\n<p><strong>It will be good to have</strong><strong></strong><strong></strong></p>\n<ul>\n<li>Extra foreign language  DE/SP/FR/IT</li>\n<li>Previous experience on checking suppliers commission statements</li>\n<li>Familiar at handling statements on discrepancies</li>\n<li>Bachelor’s degree preferably in Tourism/ Business Administration or any quantitative subject</li>\n<li>Previous experience in OTAs</li>\n<li>Knowledge of any CRM app (Freshdesk, Zendesk)</li>\n</ul>\n<p><br></p>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>Competitive compensation package</li>\n<li>Training</li>\n<li>Joining a fast-growing and ambitious international team</li>\n<li>Growth opportunities</li>\n<li>Work in a collaborative and dynamic environment of young people</li>\n</ul>",
    "link": "https://ferryhopper.recruitee.com/o/experienced-seasonal-ferries-travel-agent"
},
{
    "id": "job-597678",
    "title": "German Speaking Seasonal Travel Agent",
    "company": "ferryhopper",
    "department": null,
    "location": "Athens, Greece",
    "description": "<p><strong>The Company</strong></p>\n<p>Ferryhopper is revolutionizing online ferry booking. We are collaborating with more than 53 major and smaller ferry companies to offer ferry itineraries to 250 destinations in the Mediterranean and we will keep expanding our horizons to new destinations. We always strive to cater to the needs of all travelers and to improve our services.</p>\n<p><strong>The Role</strong></p>\n<p>Selling ferry tickets creates a whole host of questions from our customers, and we pride ourselves on the highest level of customer support in the market. Last year our customer support team interacted in over 41.000 different conversations with different customers; keeping all of them satisfied is no small task, but if you feel up to it, we want to hear from you! We are looking for a  seasonal customer support agent to join our fast-growing team in Athens.</p>\n<p>The successful candidate will be responsible to handle customers’ requests and maintain an excellent tailor-made customer experience. We value people who take pride in their work and enjoy the challenge involved in delivering outstanding results.</p>\n<p><br></p>\n<p><strong>Main responsibilities</strong></p>\n<ul>\n<li>Receive &amp; process incoming calls &amp; emails </li>\n<li>Handle general requests in several communication channels</li>\n<li>Execute ferry tickets cancellations, rebookings and other inquiries</li>\n<li>Handle force majeure such as strikes or extreme weather events, bulk changes</li>\n<li>Communicate with Ferry operators and partners </li>\n<li>Report technical issues internally</li>\n<li>Suggest improvements to the operational process to ensure the smoothest possible functioning of the team as a whole</li>\n</ul>",
    "requirements": "<p><strong>Requirements</strong></p>\n<p><br></p>\n<ul>\n<li>Excellent knowledge (Native level) of German oral and written</li>\n<li>Excellent communication in English</li>\n<li>Familiar working with apps and new technologies /  Computer literacy</li>\n<li>Bachelor’s degree preferably in Tourism/ Business Administration or any quantitative subject</li>\n<li>Quality focus and multitasking in a fast-paced environment</li>\n<li>Dedication to going above and beyond to solve customers' problems</li>\n<li>Self-motivated, strong time-management and problem solving skills </li>\n<li>A relentless team player, willing to share ideas and help other team members</li>\n</ul>\n<p><br></p>\n<p><strong>It will be good to have</strong></p>\n<ul>\n<li>Extra foreign language  SP/FR/IT</li>\n<li>Previous experience in the customer service sector </li>\n<li>Previous experience in OTAs</li>\n<li>Knowledge of any CRM  app (Freshdesk,Zendesk)</li>\n<li>Knowledge of ferries ticketing systems (Liknoss,Certus) </li>\n</ul>\n<p><br></p>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>Competitive compensation package</li>\n<li>Training</li>\n<li>Joining a fast-growing and ambitious international team</li>\n<li>Work in a collaborative and dynamic environment of young people</li>\n</ul>",
    "link": "https://ferryhopper.recruitee.com/o/german-speaking-seasonal-travel-agent"
},
{
    "id": "job-608645",
    "title": "Business Development Consultant - Italy",
    "company": "ferryhopper",
    "department": "Commercial",
    "location": "Remote job",
    "description": "<h2>The Company</h2>\n<p>Ferryhopper is an online travel company based in Athens, Greece. We specialise in ferry ticket sales, powered by our in-house search engine which compares ferry ticket prices and itineraries across 10 different countries, including Greece, Italy, Spain, and Turkey. </p>\n<p>Ferryhopper has revolutionised the online ferry ticket booking process by simplifying all the complexities of ferry ticket selection: from itineraries to seats, cabins to motorbikes, and campervans to foot-passenger tickets. </p>\n<p>Ferryhopper is determined to become the Global Ferry Expert, which can only happen through strong partnerships with our suppliers: the ferry companies. We have been building contacts and integrating new companies from Italy to continue to expand our reach. We now need someone to give us an extra push in this area, contacting the few remaining companies we have not yet reached out to, and hand-holding those companies who are currently onboarding. </p>\n<h2>The Position</h2>\n<p>In a sentence, you will be supporting the onboarding of approximately 15 ferry companies in Italy who do not yet sell their tickets on Ferryhopper.</p>\n<p>In more detail, you will be asked to: </p>\n<p><br></p>\n<ul>\n<li>Source contacts and build relationships with new ferry companies who are not yet under Ferryhopper management; </li>\n<li>Maintain effective relationships with all relevant stakeholders within each account in the Italian market; </li>\n<li>Support - with data collection, analysis and argumentation - the creation of an action plan for each account. Support for this activity will be provided by the Athens-based Account Manager;</li>\n<li>Coordinate between the Athens office and the accounts, the troubleshooting of any issues that arise. These will range from operational, to technical, through to marketing and of course covering commercial concerns; </li>\n<li>Generally support the Athens-based Account Manager with a variety of commercial actions required to complete the opening of the Italian market; </li>\n<li>Depending on travel restrictions, travel to meet representatives of these companies may be required. </li>\n</ul>\n<p>By doing the above, you will be directly enabling Ferryhopper to: </p>\n<ul>\n<li>Provide the most complete and up-to-date ferry booking engine on the market; </li>\n<li>Progress from our dominant position in the Greek market to becoming a true European player; </li>\n<li>Stay fully relevant to our market as we continue to grow, reacting effectively and timely to any changes that could affect us;</li>\n<li>Transition from the up-and-coming outsider to the established and understood market leader; </li>\n<li>Ensure the Ferryhopper commercial culture is well aligned to the Italian market. </li>\n</ul>",
    "requirements": "<h2>The Successful Candidate</h2>\n<p>To achieve this, you will need to be: </p>\n<ul>\n<li>Excited about working with a wide variety of people from within the ferry industry: building sustainable long-term commercial relationships with them;</li>\n<li>An avid problem solver, with a “go-getter” attitude, always looking for the best solution for your accounts within Ferryhopper’s product; </li>\n<li>Perfectly fluent in Italian with a strong business level of English (other European languages always an advantage, Greek not essential); </li>\n<li>Comfortable working with a wide range of basic digital platforms (Office Suites, CRM, Task Management, etc). </li>\n</ul>\n<p>We are open to a wide range of applicants for this position, with proven experience valued above educational achievements, however any points on the following list will strengthen your application: </p>\n<ul>\n<li>A degree in a relevant field such as Business Administration, Commerce, Trade or other; </li>\n<li>Experience of successfully maintaining and upgrading an existing list of accounts is highly beneficial.</li>\n</ul>\n<h2>The Project</h2>\n<h3>Objectives</h3>\n<ul>\n<li>Objective 1: Make contact with 6 uncontacted priority companies <ul>\n<li>Source decision making contacts within these companies;</li>\n<li>Adapt if necessary any material already created by Ferryhopper required to engage with these contacts;</li>\n<li>Arrange, coordinate, and attend physical or digital meetings (depending on travel restrictions) along with a member of the Athens based team.  </li>\n</ul>\n</li>\n<li>Objective 2: Complete on-boarding of 8 companies already in process + the 6 newly contacted companies as per Objective 1 <ul>\n<li>Take hand over of communication from existing team member, </li>\n<li>Understand current position in the integration pipeline,</li>\n<li>Support the company throughout the integration process. </li>\n</ul>\n</li>\n</ul>\n<h3>Timeline</h3>\n<p>This project is planned to start on <strong>Monday 15th February</strong> and to end by <strong>Friday the 16th April</strong>. The first week of the project will be dedicated to training. The successful candidate will follow the onboarding training designed for account managers, in order to provide for a rounded understanding of Ferryhopper’s business.</p>\n<p>Following this training week, the successful candidate will be in close coordination with the Athens-based Account Manager to whom they will report directly. Regular progress meetings will also take place with the Chief Commercial Officer.</p>\n<p>Due to the nature of the two objectives of the mission, they will need to be completed in parallel. </p>\n<p>A total of 20 working days has been estimated as necessary for the completion of this project. </p>\n<h3>Administration</h3>\n<p>This is a short term business development project, which, for the right candidate and with the right market conditions (read Covid-permitting) could transition to a longer term account management engagement. The successful candidate is expected to have their own working equipment (computer and internet connection), but will be provided with access to any software which might be required. </p>\n<p>Timesheets will need to be submitted on a weekly basis, which will then be used to generate invoices, on a monthly basis. Invoices will be required in order to process payment, the successful candidate will therefore need to be fully registered with their local tax authority. Allowances for travel will be arranged if required. These will be 100% covered by Ferryhopper. </p>\n<p><br></p>",
    "link": "https://ferryhopper.recruitee.com/o/business-development-consultant-italy"
}
]