[
{
    "id": "job-479000",
    "title": "React Native Developer",
    "company": "ferryhopper",
    "department": "Developers",
    "location": "Athens, Greece",
    "description": "<p>Ferryhopper is an online booking engine that makes island-hopping around Greece as easy as a breeze. Our modern and innovative platform presents the user with every available direct and indirect connection to over 160 Greek islands and major ports. Through Ferryhopper, the traveler can plan their ferry trip effortlessly, book their tickets quickly, compare prices instantly, secure the cheapest fare, and start hopping!</p>\n<p><br></p>\n<p><strong>What is the role we are looking for?</strong></p>\n<p><br></p>",
    "requirements": "<p><strong><br></strong></p>\n<p><strong>You can be the next Ferryhopper if you...</strong></p>\n<ul>\n<li>Enjoy being part of a small, fast-moving, and agile team</li>\n<li>Like solving problems</li>\n<li>Love building interfaces that captivate users</li>\n<li>Cannot spend a day without reading about the new cool things in the JS ecosystem</li>\n<li>Strive to continuously improve and drive technical issues to completion</li>\n<li>Can work independently on complex design and development tasks</li>\n<li>Enjoy contributing to and discussing different ideas and agree to team decisions on standards and processes<br>\n</li>\n</ul>\n<p><strong>What you will be doing?</strong></p>\n<ul>\n<li>Write well designed, testable, and efficient TypeScript code by using state-of-the-art software development practices</li>\n<li>Complement our UI library with pixel-perfect components</li>\n<li>Stay up-to-date with the React/React Native ecosystem and industry-leading standards and conventions</li>\n<li>Participate in training &amp; discussion sessions, sharing knowledge with the rest of the engineering team</li>\n</ul>\n<ul>\n<li>Engage in an agile environment with frequent releases</li>\n<li>Work closely with UX Designers, Product Owners, and Backend Developers to build scalable, intuitive experiences in both platforms</li>\n</ul>\n<p><strong></strong><strong>What you need to have</strong></p>\n<ul>\n<li>At least 2 years of experience in React or React Native</li>\n<li>Knowledge of the React Native ecosystem, from debugging to building complex interactions and animations</li>\n<li>Strong understanding of JavaScript (ES6+). You feel comfortable with scopes and closures and know your way around .map(), .reduce() and .filter()</li>\n<li>Proven experience with TypeScript</li>\n<li>Experience with at least one React state management tool or solution</li>\n<li>Understanding of functional programming</li>\n<li>Comfortable with Git and issue tracking tools</li>\n<li>Experience with Jest or other testing frameworks</li>\n</ul>\n<p><strong>What is nice to have :)</strong></p>\n<ul>\n<li>Experience with Ramda, RxJS, Redux</li>\n<li>Familiarity with Google Firebase</li>\n<li>Experience with NodeJS</li>\n<li>Familiarity with the Elm programming language</li>\n</ul>\n<p><strong>What we offer</strong><br></p>\n<ul>\n<li>Competitive compensation package</li>\n<li>Fun and collaborative work environment with flexible working</li>\n<li>Quick professional development</li>\n<li>Training and education budget throughout the year</li>\n<li>Joining a fast-growing ambitious international team</li>\n</ul>",
    "link": "https://ferryhopper.recruitee.com/o/react-native-developer"
},
{
    "id": "job-551835",
    "title": "UX/UI designer",
    "company": "ferryhopper",
    "department": "Product",
    "location": "Athens, Greece",
    "description": "<h3>Our Company</h3>\n<p>Ferryhopper is revolutionizing online ferry booking. We are currently collaborating with more than 53 ferry companies to offer ferry itineraries to 250 destinations in the Mediterranean. Our ongoing goal is to keep expanding our horizons to new destinations. We always strive to cater to the needs of all travelers and to improve our services.</p>\n<p><br></p>\n<h3>Our Teams</h3>\n<p>In the organization of our teams we follow a matrix approach. Horizontally you will be working with other UX and UI designers, and vertically you will collaborate closely with a product manager and a software development team. On the z-axis, you will work with all other teams to understand needs and present ideas.</p>\n<p><br></p>\n<h3>Your Role</h3>\n<p>As a UX/UI designer at Ferryhopper, you’ll be an interaction designer and a visual designer in equal parts. As an interaction designer, you will be responsible for enhancing customer satisfaction and loyalty by improving the usability and ease of use of our online products. As a visual designer, you will produce visual designs that align with brand values and style. A user centred approach should be inside everything you do. </p>\n<p><br></p>\n<p>More specifically you will need to:<br></p>\n<p><br></p>\n<h4>Discover</h4>\n<p>&gt;  Understand the product’s strategic goals, user needs and technical constraints that define the UX/UI space;</p>\n<p>&gt;  Identify and analyze the pain points of the UX/UI flow and propose solutions;</p>\n<p>&gt;  Collaborate with the product manager and the team members to brainstorm solutions or ways of approaching the design challenge;</p>\n<p><br></p>\n<h4>Design, prototype &amp; test</h4>\n<p>&gt;  Produce wireframes of the proposed solution to gather initial feedback;</p>\n<p>&gt;  Produce, present and review high-resolution designs, aligned with the company’s visual identity;</p>\n<p>&gt;  Produce demo prototypes that help evaluate the overall flow and experience of the product. We use Adobe XD and Figma on a day to day basis;</p>\n<p>&gt;  Prepare tests and scenarios for users and participate in the user testing sessions by capturing feedback;</p>\n<p><br></p>\n<h4>Deliver for development</h4>\n<p>&gt;  Annotate design deliverables to ensure the design intent is clearly communicated to the development team;</p>\n<p>&gt;  Provide thorough specifications that fully describe the desired behavior of the features and enable the dev team to proceed to implementation;</p>\n<p>&gt;  Review the implementation of the designs to ensure it meets business goals and design intent.</p>",
    "requirements": "<h3>Experience</h3>\n<p>We’re looking for a creative team player who wants to build relevant and long-lasting solutions on behalf of millions of customers. If you enjoy complex design challenges, validating ideas with data and customer research, and have a strong belief in the value of collaboration, then do not hesitate to apply for this position. </p>\n<p><br></p>\n<p>What we are looking for:</p>\n<ul>\n<li>At least 3 years’ designing experience on Web and Mobile applications;</li>\n<li>Professional experience with design &amp; prototyping tools such as Adobe XD, Figma and Illustrator;</li>\n<li>Passion about achieving great UX using user data;</li>\n<li>Extended experience in usability and A/B Testing;</li>\n<li>Exceptional visual design skills;</li>\n<li>Good understanding of CSS &amp; HTML would be an asset;</li>\n<li>Comfortable working in iterative design process;</li>\n<li>Experience working within design and development teams in an agile environment;</li>\n</ul>\n<p><br></p>\n<h3>Benefits</h3>\n<p>Our team is our number one priority; we offer an amazing working environment. This includes:</p>\n<ul>\n<li>Competitive compensation package</li>\n<li>Equipment of your choice</li>\n<li>Access to training and education material</li>\n<li>Great office space at the heart of Athens</li>\n<li>Currently we are in a work from home setup but we will return at the office. We love sharing the same working environment. However, we remain flexible in working hours &amp; remote working<br>\n</li>\n</ul>\n<p><br></p>\n<h3>How to submit your application</h3>\n<p>Please note that it is required to provide your online portfolio along with your CV or as a separate file in order for your application to be considered</p>",
    "link": "https://ferryhopper.recruitee.com/o/uxui-designer"
}
]