[
{
    "id": 1609332,
    "title": "Sales Engineer - REMOTE (North America)",
    "company": "lensesio",
    "department": "",
    "location": "New York",
    "description": "<p><strong>Who are we?</strong></p><p>At Lenses.io we are on a mission to democratize streaming data, helping businesses to operate in real-time.</p><p>Our technology allows organizations to practice DataOps, anew way of consuming, processing and moving data. Our product makes working with cutting-edge open-source technologies more accessible to users and operationalizes them for enterprises. Our customers, who range from household names like Daimler-Benz and Adidas to cloud-native startups, use Lenses to help run their strategic streaming and software applications: think IoT, fraud-detection AI engines and cutting-edge consumer-facing microservices.</p><p>          <strong>Looking to make a difference?</strong>  </p><p>Are you someone that gets excited about building things? Keen to see your ideas and knowledge shine as they directly impact our product? This is your moment to join a high-growth tech startup on the first floor.</p><p>Having established a sales team in the US in 2020, we are now building out our Sales Engineering for the next growth phase. As a Sales Engineer, you will be our technical champion in both pre- and post-sales phases. Using your close customer relationships and deep know-how of the value Lenses brings, you will connect the feedback loop to help drive the Lenses product roadmap.</p><p>We are proud of our engineering culture at Lenses.io. During a steep growth period, we have a consistent and opinionated set of best practices that are helping us to scale newly minted technologies like Apache Kafka into enterprise-ready software. Are you ready to work with Kafka, Kubernetes, Streaming SQL, and other modern technologies on-prem and across clouds?</p><p>If the answer is ‘yes’ – and you are curious, open-minded, hungry, and eager to learn then Lenses.io is the place for you!</p><p><br></p><p><strong>Here is what you will do day-to-day</strong></p><ul> <li>Lead technical engagements where we prove the potential of Lenses through discovery, demos, and POCs</li> <li>Become a trusted advisor for our customers offering best-practices, recommendations, and tips</li> <li>Be a key player in scaling our US business, working closely with sales, marketing, &amp; engineering teams</li> <li>Engage with our customer base and in our vibrant community</li> <li>Be one of our evangelists in the US for Lenses.io and DataOps with customers, and through engaging with      content</li> </ul><p>    <br></p>",
    "requirements": "<p><strong>What you will bring</strong></p>    <ul> <li>Selling into engineering or operations teams in large organizations with a go-getter attitude</li> <li>Ability to present strong technical arguments and best practices bringing inspiration to customers</li> <li>Good knowledge of streaming or messaging systems such as Apache Kafka, Rabbit MQ, JMS, as well as Linux operating systems and first principles</li> <li>Aptitude in system administration and cloud services and some experience working in data analytics</li> <li>Strong emotional intelligence helping product/tech teams to navigate a customer's challenges </li> <li>Business acumen, strong critical thinking, and root-cause analysis as well as strong written and oral skills</li> <li>Working with integrity, proactively follow new trends and technologies in the data analytics and engineering markets </li> <li>Experience in building, running, or architecting distributed technologies and/or selling DevOps tooling is a bonus</li> </ul>",
    "link": "https://apply.workable.com/lensesio/j/23F9FE843B"
},
{
    "id": 1628945,
    "title": "Business Development Representative - REMOTE (North America)",
    "company": "lensesio",
    "department": "",
    "location": "New York",
    "description": "<p><strong>Who are we?</strong></p><p>At Lenses.io we are on a mission to democratize streaming data, helping businesses to operate in real-time.</p>    <p>Our technology allows organizations to practice DataOps, a new way of consuming, processing and moving data. Our product makes working with cutting-edge open-source technologies more accessible to users and operationalizes them for enterprises. Our customers, who range from household names like Daimler-Benz and Adidas to cloud-native startups, use Lenses to help run their strategic streaming and software applications: think IoT, fraud-detection AI engines and cutting-edge consumer-facing microservices.</p><p><br></p>    Looking to make a difference?    <p>Are you someone that gets excited about building things? Keen to see your ideas and knowledge shine as they directly impact our product? This is your moment to join a high-growth tech startup on the ground floor.</p>    <p>We are looking for our first <strong>North American Business Development Representative (BDR) </strong>to partner with the Field Sales &amp; Marketing teams to convert North American prospects. The BDR leverages outbound prospecting, lead generation, and follow up to help build our fast-growing American customer-base. This is an amazing opportunity for an experienced BDR to take on a new market with tons of greenspace &amp; opportunity. </p>    <p>If you are curious, open-minded, hungry, and eager to learn then Lenses.io is the place for you!</p><p><br></p>    What your day-to-day looks like:  <ul> <li>Research accounts and prospects to develop compelling and tailored value propositions </li> <li>Prospect, educate, qualify, and develop target accounts from lead-generation activities, such as outbound cold-calling, emailing, and direct mailers into targeted accounts</li> <li>Engage with prospects via phone, email and social selling tools to share the DataOps vision, identify opportunities, and generate interest</li> <li>Handle prospect’s questions &amp; objections, before educating them on Lenses.io and DataOps</li> <li>Distribute qualified new opportunities to appropriate sales representative, collaborating with reps about the opportunity and determining appropriate action items</li> <li>Collaborate with Account Executives to optimize Outbound efforts</li> <li>Work closely with marketing to capitalize on warm engagement from demand generation and content marketing initiatives</li> <li>Maintain notes and activity tracking of accounts and engagement in SFDC</li> <li>Hit your personal target of Deals Generated (quota)</li> <li>Develop in-depth knowledge about the real-time data space</li> <li><strong>Build the foundations of the US sales development, including communications &amp; procedure</strong></li> </ul>",
    "requirements": "<p>What you will bring</p>  <ul> <li>Hands on experience as a SDR/BDR and ability to work in fast paced, constantly evolving environment</li> <li>Excellent verbal and written communication skills including high-level interactions with internal and external contacts</li> <li>Exceptional ability to organize work and tasks; attention to detail and excellent follow-through</li> <li>A strong curiosity to understand the unique challenger that companies in different industries face</li> <li>Passion for learning new things and continuous improvement</li> <li>Desire to build a career in Sales</li> </ul>",
    "link": "https://apply.workable.com/lensesio/j/8BECDB67D2"
},
{
    "id": 1656075,
    "title": "Principal Cloud Architect (Europe - REMOTE)",
    "company": "lensesio",
    "department": "",
    "location": "London",
    "description": "<p><strong>Who are we?</strong></p><p>At Lenses.io we are on a mission to democratize streaming data, helping businesses to operate in real-time.</p><p>Our technology allows organizations to practice DataOps, a new way of consuming, processing and moving data. Our product makes working with cutting-edge open-source technologies more accessible to users and operationalizes them for enterprises. </p><p>Our customers, who range from household names like Daimler-Benz and Adidas to cloud-native startups, use Lenses to help run their strategic streaming and software applications: think IoT, fraud-detection AI engines and cutting-edge consumer-facing microservices.</p><p><strong>Looking to make a difference?</strong></p><p>Are you someone that gets excited about building things? Keen to see your ideas and knowledge shine as they directly impact our product? This is your moment to join a high-growth tech startup on the ground floor.</p><p>We are looking for a Principal Cloud Architect to play a critical part of our growing company, leading the design and launch of a cloud-hosted service solution. You will bring your expertise to plan, design, document, and maintain the technologies and infrastructure needed to build a scalable and secure cloud offering. You have a great understanding of best practices in automating operations, infrastructure security, high-availability systems, and software development. You'll have the chance to work in an open and collaborative environment to improve our existing technology stack, and infrastructure along the way.</p><p>If you are curious, open-minded, hungry, and eager to learn we would love to hear from you!</p>",
    "requirements": "<p><strong>What your day-to-day looks like:</strong></p><ul> <li>Provide in-depth knowledge and strategy regarding cloud capabilities using any of the following Cloud technology services such as AWS or Azure ensuring regulations, security, risk and compliance</li> <li>Work with Agile and DevOps techniques and implementation approaches in the delivery</li> <li>Provide technical leadership to the team and colleagues. Defining and driving the Cloud vision and architecture incl. platform roadmap, service roadmap, and technology selection</li> <li>Create Solutions in terms of delivery organization competencies, processes, tools, dimensioning, costing</li> <li>Lead and be responsible for the cloud architecture on all aspects both functional and non-functional around design of a cloud-based production environment</li> <li>Support Solution  for Proof-of-Concept (POCs), 1st and 2nd engagements and develop the value and selling propositions</li> <li>Provide in-depth knowledge and strategy regarding managing kubernetes components, scalability and cost/consumption monitoring</li> <li>Provide advisory and thought leadership on the provision of analytics environments leveraging Cloud based platforms, big data technologies, including integration with existing data and analytics platforms and tools</li> <li>Lead a team of engineers and provide support and development through effective coaching and mentoring</li> <li>Provide support and technical governance, expertise related to cloud architectures, deployment, and operations</li> <li>Develop solutions architecture and evaluate architectural alternatives for private, public and hybrid cloud models, including SaaS, and other cloud services</li> <li>Develop future service offerings and value propositions to keep relevant to the market, including leading virtual teams to create collateral and best practice in partnership with vendor partners</li> </ul><p><strong>What you will bring</strong><br></p><ul> <li>Hands-on experience with related/complementary open-source software language GO</li> <li>Significant experience of architecting and implementing cloud solutions</li> </ul><ul> <li>Excellent knowledge of cloud architecture design (e.g., AWS Well-Architected)</li> <li>Experience building scalable, resilient, and secured applications</li> <li>Experience with CI/CD &amp; Infrastructure as Code (e.g., Terraform, gitops, chatops)</li> <li>Possess strong knowledge of the Private/Public Cloud offerings from AWS, CGP or Azure</li> <li>Solid Experience with migrations to Public Cloud (AWS, Azure or GCP)</li> <li>Strong hands-on cloud technologies understanding including Kubernetes, Security, non-functional elements, DBs, cloud technologies and services and the ‘as a service’ tools, open source and cloud ecosystem in general, integration methodologies and implementation</li> <li>Demonstrate knowledge of cloud architecture and implementation features (OS, multi-tenancy, virtualization, orchestration, elastic scalability)</li> <li>Demonstrate knowledge of DevOps tool chains and processes</li> <li>Experience in workload management, scalability and distributed platform architectures.</li> </ul>",
    "link": "https://apply.workable.com/lensesio/j/4D45D9F843"
}
]