[
{
    "id": 1530080,
    "title": "Senior Frontend Engineer (React/JavaScript/TypeScript) - REMOTE",
    "company": "lensesio",
    "department": "",
    "location": "",
    "description": "<p>At Lenses.io We believe the future is data-driven. Building and operating data platforms must be accessible to everyone. Lenses provides a simple way to operate data with confidence, governance and security, allowing users to accelerate delivery.</p><p>Do you have what it takes?</p><p>The engineering culture at Lenses takes pride in technical excellence, we want the best, but we also have quality and delivery ingrained in our DNA. We work in flexible scrum-based teams to deliver tangible features, end to end, utilizing the latest technology. This means that as an engineer in Lenses you get exposed to all aspects of the product to ensure delivery of features, including design, UX, UI, APIs, DevOps, integration testing and of course writing lots of awesome code!</p><p>Backed by industry experts defining and driving the DataOps vision, are you ready to work with Apache Kafka, Apache Pulsar, Redis, Kubernetes, ReactJS, every data system imaginable and all major Clouds?</p><p>If you're curious, love challenges, and have a great sense of humor then Lenses is the place for you!</p>",
    "requirements": "<p><strong>As a Lenses.io Senior Front-End Engineer you will:</strong></p><ul> <li>Take part in all stages of the development process, from requirements gathering to implementation and testing</li> <li>Work in multidisciplinary teams and collaborate closely with neighbouring disciplines, such as UX Designers, BackEnd Developers, DevOps, Product Managers</li> <li>Participate in an Agile environment, with clear goals and fast releases</li> <li>Take part in knowledge sharing sessions with the rest of the UI Engineers or in company-wide ones</li> <li>Make use of the latest tools, libs and frameworks available in the Front-End space</li> <li>Help build the DataOps platform of the future</li> </ul><p></p><p><strong>What we are looking for in a Senior Front-End Engineer:</strong></p><ul> <li>Self-driven and motivated to deliver and improve his/her knowledge constantly</li> <li>Extensive front end development experience, with a focus on building single-page web applications</li> <li>Understands JavaScript well, from its closures, scopes and up to the later ES6+ features</li> <li>Has experience building optimized, responsive and fully tested UI components &amp; screens from scratch using ReactJS</li> <li>Cares about consistency throughout the code base and isn’t shy to refactor and improve it</li> <li>Goes beyond just reading the 3rd party library documentation and wants to know how it works “behind the scene”</li> <li>Knowledge of the Front-End Development ecosystem, web tooling such as NPM, YARN, Lerna</li> <li>Ability to debug code, investigate performance issues, track issues, fix them and put tests in place to avoid them in the future</li> <li>Excellent spoken / written communication in English</li> </ul><p></p><p><strong>Good to have experience with:</strong><br></p><ul> <li>TypeScript, Rx.js, Redux, Ramda</li> <li>Cypress or other E2E testing frameworks</li> <li>WebSockets or other type of streaming data</li> <li>Knowledge of React Hooks</li> <li>Experience working with a live Component Library such as Fractal or Storybook</li> </ul>",
    "link": "https://apply.workable.com/lensesio/j/B234D4882F"
},
{
    "id": 1609332,
    "title": "Sales Engineer - REMOTE (North America)",
    "company": "lensesio",
    "department": "",
    "location": "New York",
    "description": "<p><strong>Who are we?</strong></p><p>At Lenses.io we are on a mission to democratize streaming data, helping businesses to operate in real-time.</p><p>Our technology allows organizations to practice DataOps, anew way of consuming, processing and moving data. Our product makes working with cutting-edge open-source technologies more accessible to users and operationalizes them for enterprises. Our customers, who range from household names like Daimler-Benz and Adidas to cloud-native startups, use Lenses to help run their strategic streaming and software applications: think IoT, fraud-detection AI engines and cutting-edge consumer-facing microservices.</p><p>          <strong>Looking to make a difference?</strong>  </p><p>Are you someone that gets excited about building things? Keen to see your ideas and knowledge shine as they directly impact our product? This is your moment to join a high-growth tech startup on the first floor.</p><p>Having established a sales team in the US in 2020, we are now building out our Sales Engineering for the next growth phase. As a Sales Engineer, you will be our technical champion in both pre- and post-sales phases. Using your close customer relationships and deep know-how of the value Lenses brings, you will connect the feedback loop to help drive the Lenses product roadmap.</p><p>We are proud of our engineering culture at Lenses.io. During a steep growth period, we have a consistent and opinionated set of best practices that are helping us to scale newly minted technologies like Apache Kafka into enterprise-ready software. Are you ready to work with Kafka, Kubernetes, Streaming SQL, and other modern technologies on-prem and across clouds?</p><p>If the answer is ‘yes’ – and you are curious, open-minded, hungry, and eager to learn then Lenses.io is the place for you!</p><p><br></p><p><strong>Here is what you will do day-to-day</strong></p><ul> <li>Lead technical engagements where we prove the potential of Lenses through discovery, demos, and POCs</li> <li>Become a trusted advisor for our customers offering best-practices, recommendations, and tips</li> <li>Be a key player in scaling our US business, working closely with sales, marketing, &amp; engineering teams</li> <li>Engage with our customer base and in our vibrant community</li> <li>Be one of our evangelists in the US for Lenses.io and DataOps with customers, and through engaging with      content</li> </ul><p>    <br></p>",
    "requirements": "<p><strong>What you will bring</strong></p>    <ul> <li>Selling into engineering or operations teams in large organizations with a go-getter attitude</li> <li>Ability to present strong technical arguments and best practices bringing inspiration to customers</li> <li>Good knowledge of streaming or messaging systems such as Apache Kafka, Rabbit MQ, JMS, as well as Linux operating systems and first principles</li> <li>Aptitude in system administration and cloud services and some experience working in data analytics</li> <li>Strong emotional intelligence helping product/tech teams to navigate a customer's challenges </li> <li>Business acumen, strong critical thinking, and root-cause analysis as well as strong written and oral skills</li> <li>Working with integrity, proactively follow new trends and technologies in the data analytics and engineering markets </li> <li>Experience in building, running, or architecting distributed technologies and/or selling DevOps tooling is a bonus</li> </ul>",
    "link": "https://apply.workable.com/lensesio/j/23F9FE843B"
},
{
    "id": 1628945,
    "title": "Business Development Representative - REMOTE (North America)",
    "company": "lensesio",
    "department": "",
    "location": "New York",
    "description": "<strong>Who are we?</strong><p>At Lenses.io we are on a mission to democratize streaming data, helping businesses to operate in real-time.</p>    <p>Our technology allows organizations to practice DataOps, anew way of consuming, processing and moving data. Our product makes working with cutting-edge open-source technologies more accessible to users and operationalizes them for enterprises. Our customers, who range from household names like Daimler-Benz and Adidas to cloud-native startups, use Lenses to help run their strategic streaming and software applications: think IoT, fraud-detection AI engines and cutting-edge consumer-facing microservices.</p>    Looking to make a difference?  <p></p>  <p>Are you someone that gets excited about building things? Keen to see your ideas and knowledge shine as they directly impact our product? This is your moment to join a high-growth tech startup on the first floor.</p>    <p>We are looking for our first <strong>North American Business Development Representative (BDR) </strong>to partner with the Field Sales &amp; Marketing teams to convert NA prospects. The BDR leverages outbound prospecting, lead generation, and follow up to help build our fast-growing American customer-base. This is an amazing opportunity for an experienced BDR to take on a new market with tons of greenspace &amp; opportunity. Successful BDRs that achieve their company goals can expect to progress into an Account Executive position at Lenses.io.</p>    <p>If you are curious, open-minded, hungry, and eager to learn then Lenses.io is the place for you!</p><p><br></p>    What your day-to-day looks like:<p></p>  <ul> <li>Research accounts and prospects to develop compelling and tailored value propositions </li> <li>Prospect, educate, qualify, and develop target accounts from lead-generation activities, such as outbound cold-calling, emailing, and direct mailers into targeted accounts</li> <li>Engage with prospects via phone, email and social selling tools to share the DataOps vision, identify opportunities, and generate interest</li> <li>Handle prospect’s questions &amp; objections and educate them on Lenses.io &amp; DataOps</li> <li>Disseminate qualified new opportunities to appropriate sales representative, collaborating with reps about the opportunity and determining appropriate action items</li> <li>Collaborate with Account Executives to optimize Outbound efforts</li> <li>Work closely with marketing to capitalize on “warm engagement” from demand generation and content marketing initiatives</li> <li>Maintain notes and activity tracking of accounts and engagement in SFDC</li> <li>Hit your personal target of Deals Generated (quota)</li> <li>Gain in-depth knowledge about the real-time data space</li> <li><strong>Build the foundations of the US sales development, including communications &amp; procedure</strong></li> </ul>",
    "requirements": "<p>What you will bring</p><p></p>  <ul> <li>Hands on experience as a BDR and ability to work in fast paced, constantly evolving environment</li> <li>Excellent verbal and written communication skills including high-level interactions with internal and external contacts</li> <li>Exceptional ability to organize work and tasks; attention to detail and excellent follow-through</li> <li>Passion for learning new things and continuous improvement</li> <li>Desire to build a career in Sales</li> </ul>",
    "link": "https://apply.workable.com/lensesio/j/8BECDB67D2"
}
]