[
{
    "id": 1483426,
    "title": "Senior Frontend Engineer (React/JavaScript/TypeScript)-REMOTE or Athens Office",
    "company": "lensesio",
    "department": "",
    "location": "Athens",
    "description": "<p><br></p>    <p>At Lenses.io We believe the future is data-driven. Building and operating data platforms must be accessible to everyone. Lenses provides a simple way to operate data with confidence, governance and security, allowing users to accelerate delivery.</p>  <p>Do you have what it takes?</p>  <p>The engineering culture at Lenses takes pride in technical excellence, we want the best, but we also have quality and delivery ingrained in our DNA. We work in flexible scrum-based teams to deliver tangible features, end to end, utilizing the latest technology. This means that as an engineer in Lenses you get exposed to all aspects of the product to ensure delivery of features, including design, UX, UI, APIs, DevOps, integration testing and of course writing lots of awesome code!</p>  <p>Backed by industry experts defining and driving the DataOps vision, are you ready to work with Apache Kafka, Apache Pulsar, Redis, Kubernetes, ReactJS, every data system imaginable and all major Clouds?</p>  <p>If you're curious, love challenges, and have a great sense of humor then Lenses is the place for you!</p>",
    "requirements": "<p><strong>As a Lenses.io Senior Front-End Engineer you will:</strong></p>  <ul> <li>Take part in all stages of the development process, from requirements gathering to implementation and testing</li> <li>Work in multidisciplinary teams and collaborate closely with neighbouring disciplines, such as UX Designers, BackEnd Developers, DevOps, Product Managers</li> <li>Participate in an Agile environment, with clear goals and fast releases</li> <li>Take part in knowledge sharing sessions with the rest of the UI Engineers or in company-wide ones</li> <li>Make use of the latest tools, libs and frameworks available in the Front-End space</li> <li>Help build the DataOps platform of the future</li> </ul><p><strong>What we are looking for in a Senior Front-End Engineer:</strong></p><ul> <li>Self-driven and motivated to deliver and improve his/her knowledge constantly</li> <li>Extensive front end development experience, with a focus on building single-page web applications</li> <li>Understands JavaScript well, from its closures, scopes and up to the later ES6+ features</li> <li>Has experience building optimized, responsive and fully tested UI components &amp; screens from scratch using ReactJS</li> <li>Cares about consistency throughout the code base and isn’t shy to refactor and improve it</li> <li>Goes beyond just reading the 3rd party library documentation and wants to know how it works “behind the scene”</li> <li>Knowledge of the Front-End Development ecosystem, web tooling such as NPM, YARN, Lerna</li> <li>Ability to debug code, investigate performance issues, track issues, fix them and put tests in place to avoid them in the future</li> <li>Excellent spoken / written communication in English</li> </ul><p><br></p><p><strong>Good to have experience with:<br></strong></p><ul> <li>TypeScript, Rx.js, Redux, Ramda</li> <li>Cypress or other E2E testing frameworks</li> <li>WebSockets or other type of streaming data</li> <li>Knowledge of React Hooks</li> <li>Experience working with a live Component Library such as Fractal or Storybook</li> </ul>",
    "link": "https://apply.workable.com/lensesio/j/A5181EEC70"
},
{
    "id": 1522233,
    "title": "Software Development Engineer in Test (SDET) - REMOTE or Athens Office",
    "company": "lensesio",
    "department": "",
    "location": "Athens",
    "description": "<p>At Lenses.io We believe the future is data-driven. Building and operating data platforms must be ac- cessible to everyone. Lenses provides a simple way to operate data with confidence, governance and security, allowing users to accelerate delivery.</p>  <p>Do you have what it takes?</p>  <p>The engineering culture at Lenses takes pride in technical excellence, we want the best, but we also have quality and delivery ingrained in our DNA. We work in agile teams to deliver tangible features, end to end, utilising the latest technology. This means that as an engineer in Lenses you get exposed to all aspects of the product to ensure delivery of features, including design, UX, UI, APIs, DevOps, testing and of course writing lots of awesome code!</p>  <p>Backed by industry experts defining and driving the DataOps vision, are you ready to work with Apache Kafka, Apache Pulsar, Redis, Kubernetes, ReactJS, every data system imaginable and all major Clouds?</p>  <p>If you're curious, love challenges, and have a great sense of humour then Lenses is the place for you!</p>",
    "requirements": "<p><strong>As a Lenses.io SDET you will:</strong></p><ul> <li>Work in an agile environment to deliver robust quality products sprint after sprint, release after release</li> <li>Champion testing practices within teams and help shape their testing strategy</li> <li>Keep the team focused on the value and quality of User stories and highlight testability concerns in applying quality criteria to improve understanding and estimation</li> <li>Identify what should, could and should not be automated and liaise closely with colleagues to ensure sufficient coverage while avoiding duplication of test effort</li> <li>Design and implement test automation frameworks that standardise approaches and guide good practices</li> <li>Keep automation current and flexible by discussing, innovating, evolving and maintaining the patterns, tooling and direction</li> <li>Increase automated test coverage to support and streamline the testing effort</li> <li>Build quality gates into Continuous Delivery pipelines so that automated tests are run often and fail fast to provide earlier feedback</li> <li>Identify test environments and datasets according to the type of testing being conducted</li> <li>Build tools to generate test data and provision test environments with datasets</li> <li>Utilise and develop test-double tooling to facilitate unit and integration testing</li> <li>Conduct Exploratory testing to discover important bugs more quickly</li> <li>Investigate and reproduce bugs reported by customers</li> <li>Create automated tests to verify bug fixes</li> <li>Help upskill and mentor existing team members in test automation best practices through coaching and pair programming</li> </ul><p><strong>What we are looking for in a SDET:</strong>  </p><ul> <li>Enjoys working in a collaborative atmosphere where new ideas are valued</li> <li>Self-starter who is motivated to deliver and improve knowledge constantly</li> <li>Consider themselves an SDET first but are cross-functional and can wear many different hats</li> <li>Has a proven track record in bringing testing to the forefront of the development lifecycle</li> <li>Plans using the agile testing quadrants and can explain the main concern of each and different types of testing</li> <li>Can easily identify what should, could and should not be automated and can explain a healthy balance of automated testing</li> <li>Demonstrates an understanding of when and how to implement Risk-based testing approaches</li> <li>Has a good understanding of testing techniques such as Equivalence Partitioning, Boundary Value Analysis and Pairwise and can discuss how they have applied them</li> <li>Proficient in any of Typescript, Golang or Scala</li> <li>Has applied patterns such as Page Object, Journey, Screenplay and Mission and can discuss and compare their purposes and explain the advantages of one over another</li> <li>Has experience with CI/CD tools such as Jenkins and has written pipeline as code with a focus on building quality gates into stages</li> <li>Has experience using Docker to manage and replicate test environments</li> <li>Has experience of using Test Double tooling such as WireMock and understands when and why you would use them</li> <li>Can design and build their own tooling to support the testing effort where gaps in the capabilities of popular tools exist</li> <li>Appreciates that not all testing should be automated</li> <li>Collects metrics to continuously improve testing</li> </ul>",
    "link": "https://apply.workable.com/lensesio/j/24D6E38A35"
}
]