[
{
    "id": 1709959,
    "title": "Product Marketing Manager - REMOTE (North America)",
    "company": "lensesio",
    "department": "",
    "location": "New York",
    "description": "<p><strong>Who are we?</strong></p><p>At Lenses.io we are on a mission to democratize streaming data, helping businesses to operate in real-time.</p> <p>Our technology allows organizations to practice DataOps, anew way of consuming, processing and moving data. Our product makes working with cutting-edge open-source technologies more accessible to users and operationalizes them for enterprises. Our customers, who range from household names like Daimler-Benz and Adidas to cloud-native startups, use Lenses to help run their strategic streaming and software applications: think IoT, fraud-detection AI engines and cutting-edge consumer-facing microservices.</p><p><strong>Looking to make a difference?</strong><br></p><p><strong><strong>This is an amazing moment to join one the fastest growing data tech startups as the first Product Marketing Manager.</strong><br></strong></p><p>In the role, you will be a valued and critical contributor to our Go-To-Market team. You will work closely with our customers, engineering, sales and of course our marketing teams to contribute to our product strategy, lead its delivery to market and wake the world up to the possibilities of DataOps. </p><p>If you are creative, passionate &amp; hungry to market a product loved by tens of thousands of developers; if you’re excited to make Lenses.io the category king in DataOps then this is the home for you.</p>",
    "requirements": "<p><strong>What your day-to-day looks like:</strong></p><ul> <li>Manage product go-to-market strategy and execution</li> <li>Contribute to our product roadmap and develop customer personas</li> <li>Work closely with engineering, sales and leadership to communicate differentiators and build value propositions for specific markets</li> <li>Develop integrated campaigns with our Demand Generation team</li> <li>Engage with customers and prospects in the field</li> <li>Partner with Communications teams to brief analysts and the press</li> <li>Support our Content team by developing assets including videos</li> </ul><p><strong>What you will bring</strong>: <br></p><ul> <li>Hands-on experience in marketing to software/data engineering</li> <li>Proven track record of taking products to market</li> <li>Background in engineering</li> <li>Experience working closely with sales team</li> <li>Success executing campaigns across multiple channels and tactics</li> <li>Great literacy skills and articulate in presentation</li> <li>Creative marketing ideas and concepts</li> </ul><p><strong>Passionate about</strong><br></p><ul> <li>Technology</li> <li>Customer Success</li> <li>Trying new tactics and messaging</li> <li>Being part of a team</li> <li>Sharing success with others</li> <li>Inspiring people</li> </ul>",
    "link": "https://apply.workable.com/lensesio/j/A71B1BF0F5"
},
{
    "id": 1767278,
    "title": "SRE/Platform, SRE/DevOps - Europe (remote)",
    "company": "lensesio",
    "department": "",
    "location": "",
    "description": "<p><strong>Who are we?</strong></p><p>At Lenses.io we are on a mission to democratize streaming data, helping businesses to operate in real-time.</p> <p>Our technology allows organizations to practice DataOps, a new way of consuming, processing, and moving data. Our product makes working with cutting-edge open-source technologies more accessible to users and operationalizes them for enterprises. Our customers, who range from household names like Daimler-Benz and Adidas to cloud-native startups, use Lenses to help run their strategic streaming and software applications: think IoT, fraud-detection AI engines, and cutting-edge consumer-facing microservices.</p> <p><strong>Looking to make a difference?</strong></p> <p>The Lenses.io SRE team is expanding, and you could be our next, new valuable member!</p> <p>More often than not, SRE, DevOps, and Ops stand for <em>way too many responsibilities to list on a single page</em>. We are not going to lie, it’s the same for us, and our little shared secret is that we do enjoy our role —and hopefully, the same stands for you because we have a ton of work ahead of us.</p> <p>There are three roles currently open:</p><ul> <li> <strong>SRE/Platform</strong> with solid abilities in SaaS and managed services (senior)</li> <li> <strong>SRE/Platform,</strong> preferably with experience in Apache Kafka (mid/senior)</li> <li> <strong>SRE/DevOps</strong> (mid/senior)</li> </ul><p>We also welcome junior applicants who are eager to evolve their careers.</p> <p>If you are curious, open-minded, hungry, and eager to learn then Lenses.io is the place for you!</p> <p>Let’s go over the role descriptions. Note that all our SREs take tasks from both tracks —that’s what we call them, platform and devops—, but the respective track is favored when it comes to architectural tasks or challenging problems.</p>",
    "requirements": "<p><strong>What your day-to-day looks like:</strong></p> <p><strong>SRE/Platform</strong></p><p>You are focused on providing and supporting services for the company, our clients, and users. Obviously, it has to be fast, secure, scalable, and robust though we keep these descriptions for our presentations. In day-to-day life this means building blocks of infrastructure, implementing new functionality, automating, orchestrating, provisioning, keeping things up-to-date, and maintaining.</p> <p><strong>SRE/Platform with solid abilities in SaaS and managed services</strong></p><p>We want to offer Lenses as a managed service. We have an awesome team building our portal and we are looking into the SRE who will lead the Lenses deployment architecture and implementation. The work has already started but you will play a key role in shaping the Lenses cloud. Our software connects to customers’ systems, has access to data and secrets. It will be your responsibility to make it secure. Words like SoC2 and ISO 270001 should not scare you.</p> <p><strong>SRE/DevOps</strong></p><p>You will be supporting our product directly. Although devops is a culture, DevOps engineers are valuable members who accelerate developers by taking charge of the tough challenges for the delivery process like CICD, release automation and packaging. Mind you that these challenges are not only tough, but they are ongoing. As the product evolves, so does the delivery process.</p> <p><strong>Primary Technology Stack</strong></p><p>The most common parts of our current stack include:</p><ul> <li>Docker</li> <li>Kubernetes</li> <li>Terraform</li> <li>Jenkins</li> <li>Google Cloud</li> <li>Amazon AWS</li> <li>Bash scripts</li> <li>Go language</li> <li>Linux servers</li> <li>Apache Kafka</li> <li>Helm</li> </ul> <p>Of course, we touch way more technologies than just these. Our product is developed primarily using the technologies below, so part of your DevOps tasks will include interacting with them:</p><ul> <li>Scala (JVM), sbt</li> <li>Javascript (React, Angular), yarn</li> </ul><p><strong>What will you bring</strong></p><p>Hopefully, we are going to spend many years working together. It’s important that we are compatible:</p><ul> <li>You love being an SRE and are eager to learn and become better</li> <li>You have some experience in computer science (or similar) and distributed systems</li> <li>You are not afraid to ask questions, give and receive feedback</li> <li>You have experience in most of our primary technology stack</li> <li>You have strong problem-solving skills, which for us means not only you can solve a problem but also you can explain how you did it and why your solution is correct</li> <li>You are security, performance, and best-practice conscious</li> <li>You are able to take responsibilities and own projects (implementation or even design-wise)</li> <li>You like working in a team and you are able to push through language and cultural barriers to work with engineers all over the world</li> <li>You want to automate everything</li> <li>No task is beneath or above you. Documentation, support, and even little tasks are things we all do often. This applies even to our CEO!</li> </ul><p><br></p>",
    "link": "https://apply.workable.com/lensesio/j/F270E5F9D3"
}
]