[
{
    "id": 1483426,
    "title": "Senior Frontend Engineer (React/JavaScript/TypeScript)-REMOTE or Athens Office",
    "company": "lensesio",
    "department": "",
    "location": "Athens",
    "description": "<p><br></p>    <p>At Lenses.io We believe the future is data-driven. Building and operating data platforms must be accessible to everyone. Lenses provides a simple way to operate data with confidence, governance and security, allowing users to accelerate delivery.</p>  <p>Do you have what it takes?</p>  <p>The engineering culture at Lenses takes pride in technical excellence, we want the best, but we also have quality and delivery ingrained in our DNA. We work in flexible scrum-based teams to deliver tangible features, end to end, utilizing the latest technology. This means that as an engineer in Lenses you get exposed to all aspects of the product to ensure delivery of features, including design, UX, UI, APIs, DevOps, integration testing and of course writing lots of awesome code!</p>  <p>Backed by industry experts defining and driving the DataOps vision, are you ready to work with Apache Kafka, Apache Pulsar, Redis, Kubernetes, ReactJS, every data system imaginable and all major Clouds?</p>  <p>If you're curious, love challenges, and have a great sense of humor then Lenses is the place for you!</p>",
    "requirements": "<p><strong>As a Lenses.io Senior Front-End Engineer you will:</strong></p>  <ul> <li>Take part in all stages of the development process, from requirements gathering to implementation and testing</li> <li>Work in multidisciplinary teams and collaborate closely with neighbouring disciplines, such as UX Designers, BackEnd Developers, DevOps, Product Managers</li> <li>Participate in an Agile environment, with clear goals and fast releases</li> <li>Take part in knowledge sharing sessions with the rest of the UI Engineers or in company-wide ones</li> <li>Make use of the latest tools, libs and frameworks available in the Front-End space</li> <li>Help build the DataOps platform of the future</li> </ul><p><strong>What we are looking for in a Senior Front-End Engineer:</strong></p><ul> <li>Self-driven and motivated to deliver and improve his/her knowledge constantly</li> <li>Extensive front end development experience, with a focus on building single-page web applications</li> <li>Understands JavaScript well, from its closures, scopes and up to the later ES6+ features</li> <li>Has experience building optimized, responsive and fully tested UI components &amp; screens from scratch using ReactJS</li> <li>Cares about consistency throughout the code base and isn’t shy to refactor and improve it</li> <li>Goes beyond just reading the 3rd party library documentation and wants to know how it works “behind the scene”</li> <li>Knowledge of the Front-End Development ecosystem, web tooling such as NPM, YARN, Lerna</li> <li>Ability to debug code, investigate performance issues, track issues, fix them and put tests in place to avoid them in the future</li> <li>Excellent spoken / written communication in English</li> </ul><p><br></p><p><strong>Good to have experience with:<br></strong></p><ul> <li>TypeScript, Rx.js, Redux, Ramda</li> <li>Cypress or other E2E testing frameworks</li> <li>WebSockets or other type of streaming data</li> <li>Knowledge of React Hooks</li> <li>Experience working with a live Component Library such as Fractal or Storybook</li> </ul>",
    "link": "https://apply.workable.com/lensesio/j/A5181EEC70"
}
]