[
{
    "id": 1709959,
    "title": "Product Marketing Manager - REMOTE (North America)",
    "company": "lensesio",
    "department": "",
    "location": "New York",
    "description": "<p><strong>Who are we?</strong></p><p>At Lenses.io we are on a mission to democratize streaming data, helping businesses to operate in real-time.</p> <p>Our technology allows organizations to practice DataOps, anew way of consuming, processing and moving data. Our product makes working with cutting-edge open-source technologies more accessible to users and operationalizes them for enterprises. Our customers, who range from household names like Daimler-Benz and Adidas to cloud-native startups, use Lenses to help run their strategic streaming and software applications: think IoT, fraud-detection AI engines and cutting-edge consumer-facing microservices.</p><p><strong>Looking to make a difference?</strong><br></p><p><strong><strong>This is an amazing moment to join one the fastest growing data tech startups as the first Product Marketing Manager.</strong><br></strong></p><p>In the role, you will be a valued and critical contributor to our Go-To-Market team. You will work closely with our customers, engineering, sales and of course our marketing teams to contribute to our product strategy, lead its delivery to market and wake the world up to the possibilities of DataOps. </p><p>If you are creative, passionate &amp; hungry to market a product loved by tens of thousands of developers; if you’re excited to make Lenses.io the category king in DataOps then this is the home for you.</p>",
    "requirements": "<p><strong>What your day-to-day looks like:</strong></p><ul> <li>Manage product go-to-market strategy and execution</li> <li>Contribute to our product roadmap and develop customer personas</li> <li>Work closely with engineering, sales and leadership to communicate differentiators and build value propositions for specific markets</li> <li>Develop integrated campaigns with our Demand Generation team</li> <li>Engage with customers and prospects in the field</li> <li>Partner with Communications teams to brief analysts and the press</li> <li>Support our Content team by developing assets including videos</li> </ul><p><strong>What you will bring</strong>: <br></p><ul> <li>Hands-on experience in marketing to software/data engineering</li> <li>Proven track record of taking products to market</li> <li>Background in engineering</li> <li>Experience working closely with sales team</li> <li>Success executing campaigns across multiple channels and tactics</li> <li>Great literacy skills and articulate in presentation</li> <li>Creative marketing ideas and concepts</li> </ul><p><strong>Passionate about</strong><br></p><ul> <li>Technology</li> <li>Customer Success</li> <li>Trying new tactics and messaging</li> <li>Being part of a team</li> <li>Sharing success with others</li> <li>Inspiring people</li> </ul>",
    "link": "https://apply.workable.com/lensesio/j/A71B1BF0F5"
},
{
    "id": 1767278,
    "title": "SRE/Platform, SRE/DevOps - Europe (remote)",
    "company": "lensesio",
    "department": "",
    "location": "",
    "description": "<p><strong>Who are we?</strong></p><p>At Lenses.io we are on a mission to democratize streaming data, helping businesses to operate in real-time.</p> <p>Our technology allows organizations to practice DataOps, a new way of consuming, processing, and moving data. Our product makes working with cutting-edge open-source technologies more accessible to users and operationalizes them for enterprises. Our customers, who range from household names like Daimler-Benz and Adidas to cloud-native startups, use Lenses to help run their strategic streaming and software applications: think IoT, fraud-detection AI engines, and cutting-edge consumer-facing microservices.</p> <p><strong>Looking to make a difference?</strong></p> <p>The Lenses.io SRE team is expanding, and you could be our next, new valuable member!</p> <p>More often than not, SRE, DevOps, and Ops stand for <em>way too many responsibilities to list on a single page</em>. We are not going to lie, it’s the same for us, and our little shared secret is that we do enjoy our role —and hopefully, the same stands for you because we have a ton of work ahead of us.</p> <p>There are three roles currently open:</p><ul> <li> <strong>SRE/Platform</strong> with solid abilities in SaaS and managed services (senior)</li> <li> <strong>SRE/Platform,</strong> preferably with experience in Apache Kafka (mid/senior)</li> <li> <strong>SRE/DevOps</strong> (mid/senior)</li> </ul><p>We also welcome junior applicants who are eager to evolve their careers.</p> <p>If you are curious, open-minded, hungry, and eager to learn then Lenses.io is the place for you!</p> <p>Let’s go over the role descriptions. Note that all our SREs take tasks from both tracks —that’s what we call them, platform and devops—, but the respective track is favored when it comes to architectural tasks or challenging problems.</p>",
    "requirements": "<p><strong>What your day-to-day looks like:</strong></p> <p><strong>SRE/Platform</strong></p><p>You are focused on providing and supporting services for the company, our clients, and users. Obviously, it has to be fast, secure, scalable, and robust though we keep these descriptions for our presentations. In day-to-day life this means building blocks of infrastructure, implementing new functionality, automating, orchestrating, provisioning, keeping things up-to-date, and maintaining.</p> <p><strong>SRE/Platform with solid abilities in SaaS and managed services</strong></p><p>We want to offer Lenses as a managed service. We have an awesome team building our portal and we are looking into the SRE who will lead the Lenses deployment architecture and implementation. The work has already started but you will play a key role in shaping the Lenses cloud. Our software connects to customers’ systems, has access to data and secrets. It will be your responsibility to make it secure. Words like SoC2 and ISO 270001 should not scare you.</p> <p><strong>SRE/DevOps</strong></p><p>You will be supporting our product directly. Although devops is a culture, DevOps engineers are valuable members who accelerate developers by taking charge of the tough challenges for the delivery process like CICD, release automation and packaging. Mind you that these challenges are not only tough, but they are ongoing. As the product evolves, so does the delivery process.</p> <p><strong>Primary Technology Stack</strong></p><p>The most common parts of our current stack include:</p><ul> <li>Docker</li> <li>Kubernetes</li> <li>Terraform</li> <li>Jenkins</li> <li>Google Cloud</li> <li>Amazon AWS</li> <li>Bash scripts</li> <li>Go language</li> <li>Linux servers</li> <li>Apache Kafka</li> <li>Helm</li> </ul> <p>Of course, we touch way more technologies than just these. Our product is developed primarily using the technologies below, so part of your DevOps tasks will include interacting with them:</p><ul> <li>Scala (JVM), sbt</li> <li>Javascript (React, Angular), yarn</li> </ul><p><strong>What will you bring</strong></p><p>Hopefully, we are going to spend many years working together. It’s important that we are compatible:</p><ul> <li>You love being an SRE and are eager to learn and become better</li> <li>You have some experience in computer science (or similar) and distributed systems</li> <li>You are not afraid to ask questions, give and receive feedback</li> <li>You have experience in most of our primary technology stack</li> <li>You have strong problem-solving skills, which for us means not only you can solve a problem but also you can explain how you did it and why your solution is correct</li> <li>You are security, performance, and best-practice conscious</li> <li>You are able to take responsibilities and own projects (implementation or even design-wise)</li> <li>You like working in a team and you are able to push through language and cultural barriers to work with engineers all over the world</li> <li>You want to automate everything</li> <li>No task is beneath or above you. Documentation, support, and even little tasks are things we all do often. This applies even to our CEO!</li> </ul><p><br></p>",
    "link": "https://apply.workable.com/lensesio/j/F270E5F9D3"
},
{
    "id": 1820899,
    "title": "Developer Advocate",
    "company": "lensesio",
    "department": "",
    "location": "New York",
    "description": "<p><strong>Who are we?</strong></p><p>At Lenses.io, we are on a mission to democratize streaming data, helping businesses to operate in real-time.</p>    <p>Our technology allows organizations to practice DataOps, a new and disruptive way of consuming, processing and moving data. </p>    <p>Our product delivers an amazing developer experience for building &amp; operating streaming data applications. It makes working with leading open-source technologies such as Apache Kafka &amp; Kubernetes more accessible for engineers and operationalizes them for enterprises. </p>    <p>Today, 10s of thousands of developers and 100s of customers use Lenses.io open-source tools and enterprise software. </p>    <p>Our customers, who range from household names like Daimler-Benz and Adidas to cloud-native start-ups, use Lenses to help run their strategic streaming and software applications: IoT, fraud-detection AI engines and cutting-edge consumer-facing applications.</p>    <p><strong>Looking to make a difference?</strong></p>    <p>This is an amazing moment to join one the fastest growing data tech start-ups as the first Developer Advocate.</p>    <p>In the role, you will be a valued member of the Lenses and Kafka community. As part of the marketing team, you will engage, educate and enthuse a community of open-source developers with Lenses.io enterprise software and open-source projects. </p>    <p>So, if you are creative and passionate about engineering and building a community of developers then this is the home for you. </p>  <strong>What your day-to-day looks like:</strong>  <ul> <li>Presenting at industry meetups, conferences and community events</li> <li>Contributing to Lenses’ open-source projects </li> <li>Creating technical material such as blogs and videos that help educate developers on Lenses, Kafka and other open-source technologies. </li> <li>Maximizing the reach and the impact of this content, through social media, public forums and special events.</li> <li>Nurturing the community, with engaging activities and content</li> <li>Building and growing relationships with key members of the community</li> <li>Engaging with customers and prospects in the field </li> <li>Feeding back ideas from the community to the Lenses engineering team</li> </ul>",
    "requirements": "<p><strong>What you will bring</strong></p><ul> <li>Experience in working in a software/data engineering team</li> <li>Track record of developing education content</li> <li>Development of video content</li> </ul>      <ul> <li>Great literacy skills and articulate in presentation</li> <li>Creative marketing ideas and concepts</li> <li>Excellent knowledge of Apache Kafka and building streaming applications in languages and frameworks such Kafka Streams, Python and Go. </li> <li>Very good knowledge of other open-source data technologies and cloud infrastructure.</li> </ul>        <strong>Passionate about</strong>  <ul> <li>Engineering &amp; streaming data technologies</li> <li>Sharing knowledge</li> <li>Customer success</li> <li>Being part of a community</li> <li>Sharing success with others</li> <li>Inspiring people</li> </ul>",
    "link": "https://apply.workable.com/lensesio/j/E9C43A3CD7"
},
{
    "id": 1820890,
    "title": "Developer Advocate, London, UK and/OR Europe Remote",
    "company": "lensesio",
    "department": "",
    "location": "London",
    "description": "<p><strong>Who are we?</strong></p><p>At Lenses.io, we are on a mission to democratize streaming data, helping businesses to operate in real-time.</p>    <p>Our technology allows organizations to practice DataOps, a new and disruptive way of consuming, processing and moving data. </p>    <p>Our product delivers an amazing developer experience for building &amp; operating streaming data applications. It makes working with leading open-source technologies such as Apache Kafka &amp; Kubernetes more accessible for engineers and operationalizes them for enterprises. </p>    <p>Today, 10s of thousands of developers and 100s of customers use Lenses.io open-source tools and enterprise software. </p>    <p>Our customers, who range from household names like Daimler-Benz and Adidas to cloud-native start-ups, use Lenses to help run their strategic streaming and software applications: IoT, fraud-detection AI engines and cutting-edge consumer-facing applications.</p>    <p><strong>Looking to make a difference?</strong></p>    <p>This is an amazing moment to join one the fastest growing data tech start-ups as the first Developer Advocate.</p>    <p>In the role, you will be a valued member of the Lenses and Kafka community. As part of the marketing team, you will engage, educate and enthuse a community of open-source developers with Lenses.io enterprise software and open-source projects. </p>    <p>So, if you are creative and passionate about engineering and building a community of developers then this is the home for you. </p>  <strong>What your day-to-day looks like:</strong>  <ul> <li>Presenting at industry meetups, conferences and community events</li> <li>Contributing to Lenses’ open-source projects </li> <li>Creating technical material such as blogs and videos that help educate developers on Lenses, Kafka and other open-source technologies. </li> <li>Maximizing the reach and the impact of this content, through social media, public forums and special events.</li> <li>Nurturing the community, with engaging activities and content</li> <li>Building and growing relationships with key members of the community</li> <li>Engaging with customers and prospects in the field </li> <li>Feeding back ideas from the community to the Lenses engineering team</li> </ul>",
    "requirements": "<p><strong>What you will bring</strong></p><ul> <li>Experience in working in a software/data engineering team</li> <li>Track record of developing education content</li> <li>Development of video content</li> </ul>      <ul> <li>Great literacy skills and articulate in presentation</li> <li>Creative marketing ideas and concepts</li> <li>Excellent knowledge of Apache Kafka and building streaming applications in languages and frameworks such Kafka Streams, Python and Go. </li> <li>Very good knowledge of other open-source data technologies and cloud infrastructure.</li> </ul>        <strong>Passionate about</strong>  <ul> <li>Engineering &amp; streaming data technologies</li> <li>Sharing knowledge</li> <li>Customer success</li> <li>Being part of a community</li> <li>Sharing success with others</li> <li>Inspiring people</li> </ul>",
    "link": "https://apply.workable.com/lensesio/j/F60A95303A"
},
{
    "id": 1820871,
    "title": "Senior Scala engineer - London, UK and/or REMOTE",
    "company": "lensesio",
    "department": "",
    "location": "London",
    "description": "<p><strong>Who are we?</strong></p><p>At Lenses.io we are on a mission to democratize streaming data, helping businesses to operate in real-time.</p><p>Our technology allows organizations to practice DataOps, a new way of consuming, processing and moving data. Our product makes working with cutting-edge open-source technologies more accessible to users and operationalizes them for enterprises. Our customers, who range from household names like Daimler-Benz and Adidas to cloud-native startups, use Lenses to help run their strategic streaming and software applications: think IoT, fraud-detection AI engines and cutting-edge consumer-facing microservices.</p><strong>Looking to make a difference?</strong><p>Are you someone that gets excited about building things? Keen to see your ideas and knowledge shine as they directly impact our product? This is your moment to join a high-growth tech startup on the first floor.</p><p>The engineering culture at Lenses takes pride in technical excellence, we want the best, but we also have quality and delivery ingrained in our DNA. We work in agile teams to deliver tangible features, end to end, utilising the latest technology. This means that as an engineer in Lenses you get exposed to all aspects of the product to ensure delivery of features, including design, UX, UI, APIs, DevOps, testing and of course writing lots of awesome code!</p><p>Backed by industry experts defining and driving the DataOps vision, are you ready to work with Apache Kafka, Apache Pulsar, Redis, Kubernetes, ReactJS, every data system imaginable and all major Clouds?</p><p><strong>If you're curious, love challenges, and have a great sense of humour then Lenses is the place for you!</strong></p><strong>What your day-to-day looks like:</strong><ul> <li>Work in an agile environment to deliver robust quality products release after release</li> <li>Champion best practices within the Scala chapter</li> <li>Participate in product initiatives and decisions</li> <li>Design, implement and own the technical approach for new product initiatives</li> <li>Spike new ideas or new approaches to improve existing functionality and code base</li> <li>Investigate and reproduce bugs reported by customers</li> <li>Interact with our customers, as part of 2nd level support rota, to gather feedback and improve our product</li> <li>Help upskill and mentor existing team members through coaching and pair programming</li> </ul>",
    "requirements": "<p><strong>What you will bring</strong></p><ul> <li>Enjoys working in a collaborative atmosphere where new ideas are valued</li> <li>Self-starter who is motivated to deliver and improve knowledge constantly</li> <li>Enjoys writing code in a functional programming style but also has appreciation for other paradigms: most of our business logic is written using cats-effect, fs2 and other Typelevel libraries, but we heavily integrate with traditional java APIs.</li> <li>Experience using Docker, Kubernetes, clouds (ie. GCE, AWS, Azure)</li> <li>Experience using RDBMS databases. Any other storage solutions like Cassandra, MongoDB, InfluxDb it is a plus</li> <li>Experience using Messaging Systems (Apache Kafka in particular, Apache Pulsar, JMS)</li> <li>Experience in writing understandable, testable and maintainable code</li> <li>Experience using Lucene will be an advantage</li> <li>Experience as an Open Source Contributor and/or Speaker in the Streaming will be a huge asset</li> </ul>",
    "link": "https://apply.workable.com/lensesio/j/BF94C4087D"
},
{
    "id": 1833951,
    "title": "Business Development Representative (BDR)",
    "company": "lensesio",
    "department": "",
    "location": "London",
    "description": "<p><strong>Who are we?</strong></p> <p>At Lenses.io, we are helping organisations develop digital services on real-time data. Our product, Lenses, provides DataOps, a new and disruptive way of consuming, processing and moving data. </p><p>Lenses delivers an amazing developer experience for working with streaming data. It makes working with leading open-source technologies such as Apache Kafka &amp; Kubernetes more accessible for engineers and operationalizes them for enterprises. </p><p>Household names like Daimler-Benz and Adidas and cloud-native such as Babylon Health use Lenses to deliver their strategic streaming data projects: from fraud-detection AI engines to cutting-edge consumer-facing applications.</p> <p><strong>Looking to make a difference?</strong></p> <p>Are you someone that gets excited about taking leading-edge technology to market, putting solutions on the map for enterprises to make millions in revenue? This is your moment to join a high-growth tech startup on the ground floor.</p> <p>We are looking for Business Development Representatives (BDRs) to partner with the Field Sales and Marketing teams to convert prospects. The BDR leverages outbound prospecting, lead generation, and follow up to help build our fast-growing customer-base. This is an amazing opportunity to take on a new market with tons of greenspace and opportunity. </p> <p>If you are curious, hungry, and eager to learn then Lenses.io is the place for you!</p> <p><strong>What your day-to-day looks like:</strong></p> <ul> <li>Research accounts and prospects to develop compelling and tailored value propositions </li> <li>Prospect, educate, qualify, and develop target accounts from lead-generation activities, such as outbound cold-calling, emailing, and direct mailers into targeted accounts</li> <li>Engage with prospects via phone, email, and social selling tools</li> <li>Distribute qualified new opportunities to sales</li> <li>Collaborate with Account Executives to optimize outbound efforts</li> <li>Work closely with marketing to capitalize on warm engagement from demand generation and marketing initiatives</li> <li>Maintain notes and activity tracking of accounts and engagement in SFDC</li> <li>Implement strategy for acquiring new business and traction in your assigned territory</li> <li>Attain specific metrics to grow the business and help the sales team achieve their goals</li> <li>Develop in-depth knowledge about the real-time data space</li> <li>Build the foundations of the sales development program, including communications and procedure</li> </ul>",
    "requirements": "<p><strong>What you will bring</strong></p> <ul> <li>Hands on experience as a SDR/BDR and ability to work in fast paced, constantly evolving environment</li> <li>Excellent verbal and written communication skills</li> <li>Exceptional ability to organize work and tasks</li> <li>A strong curiosity to understand the unique challenges that companies in different industries face</li> <li>Desire to build a career in tech sales</li> </ul>",
    "link": "https://apply.workable.com/lensesio/j/A040693618"
},
{
    "id": 1833948,
    "title": "Business Development Representative (BDR)",
    "company": "lensesio",
    "department": "",
    "location": "New York",
    "description": "<p><strong>Who are we?</strong></p> <p>At Lenses.io, we are helping organisations develop digital services on real-time data. Our product, Lenses, provides DataOps, a new and disruptive way of consuming, processing and moving data. </p><p>Lenses delivers an amazing developer experience for working with streaming data. It makes working with leading open-source technologies such as Apache Kafka &amp; Kubernetes more accessible for engineers and operationalizes them for enterprises. </p><p>Household names like Daimler-Benz and Adidas and cloud-native such as Babylon Health use Lenses to deliver their strategic streaming data projects: from fraud-detection AI engines to cutting-edge consumer-facing applications.</p> <p><strong>Looking to make a difference?</strong></p> <p>Are you someone that gets excited about taking leading-edge technology to market, putting solutions on the map for enterprises to make millions in revenue? This is your moment to join a high-growth tech startup on the ground floor.</p> <p>We are looking for Business Development Representatives (BDRs) to partner with the Field Sales and Marketing teams to convert prospects. The BDR leverages outbound prospecting, lead generation, and follow up to help build our fast-growing customer-base. This is an amazing opportunity to take on a new market with tons of greenspace and opportunity. </p> <p>If you are curious, hungry, and eager to learn then Lenses.io is the place for you!</p> <p><strong>What your day-to-day looks like:</strong></p> <ul> <li>Research accounts and prospects to develop compelling and tailored value propositions </li> <li>Prospect, educate, qualify, and develop target accounts from lead-generation activities, such as outbound cold-calling, emailing, and direct mailers into targeted accounts</li> <li>Engage with prospects via phone, email, and social selling tools</li> <li>Distribute qualified new opportunities to sales</li> <li>Collaborate with Account Executives to optimize outbound efforts</li> <li>Work closely with marketing to capitalize on warm engagement from demand generation and marketing initiatives</li> <li>Maintain notes and activity tracking of accounts and engagement in SFDC</li> <li>Implement strategy for acquiring new business and traction in your assigned territory</li> <li>Attain specific metrics to grow the business and help the sales team achieve their goals</li> <li>Develop in-depth knowledge about the real-time data space</li> <li>Build the foundations of the sales development program, including communications and procedure</li> </ul>",
    "requirements": "<p><strong>What you will bring</strong></p> <ul> <li>Hands on experience as a SDR/BDR and ability to work in fast paced, constantly evolving environment</li> <li>Excellent verbal and written communication skills</li> <li>Exceptional ability to organize work and tasks</li> <li>A strong curiosity to understand the unique challenges that companies in different industries face</li> <li>Desire to build a career in tech sales</li> </ul>",
    "link": "https://apply.workable.com/lensesio/j/4081DD08F9"
}
]