[
{
    "id": "job-323188",
    "title": "Frontend Developer",
    "company": "netdata",
    "department": "Engineering",
    "location": "Remote job",
    "description": "<p>Netdata is looking for talented frontend developers to join our distributed (remote) engineering team.</p>\n<p>As a frontend developer at Netdata, you will need to be passionate about web technology, declarative/reactive programming paradigms, testable code and extreme performance. You will live and breathe within the Chrome/Firefox/Safari Developer/React/Redux Tools and make sure we deliver a world-class experience to the millions of people using our product on a daily basis.</p>\n<p> </p>\n<p><strong>Responsibilities</strong></p>\n<ul>\n\t<li>Use modern Web technologies and frameworks to develop our frontend platform, components and libraries. At Netdata we use React with Recoil</li>\n\t<li>Write testable, documented code that is highly maintainable</li>\n\t<li>Develop for maximum performance, compatibility and a world-class user experience, across devices and form-factors.</li>\n\t<li>Collaborate with UX/UI designers to improve usability and accessibility</li>\n\t<li>Automate repetitive tasks when possible</li>\n\t<li>Stay up-to-date on emerging technologies and frameworks</li>\n</ul>\n<p><strong>Why join Netdata</strong></p>\n<ul>\n\t<li>We are a team of industry veterans and senior engineers that prioritize performance and ease of use over anything else.</li>\n\t<li>We embrace remote work and great work-life balance.</li>\n\t<li>We are solving hard problems that affect thousands of organisations worldwide.</li>\n\t<li>We are deeply committed to Open Source and love our community.</li>\n\t<li>We deeply care about system performance.</li>\n</ul>\n<p><strong>When you join Netdata, you can expect</strong></p>\n<ul>\n\t<li>A competitive salary.</li>\n\t<li>A generous stock plan.</li>\n\t<li>To join a venture-backed startup working with some of the most sophisticated investors of Silicon Valley.</li>\n\t<li>To be part of our world-class team and interact with an amazing community.</li>\n\t<li>To see first-hand how to grow and succeed in an engineering-first, open source-based company.</li>\n\t<li>To find a culture that rewards doers.</li>\n</ul>\n<p><em>Netdata is an Equal Opportunity Employer. We are committed to providing an inclusive work environment free of discrimination and harassment for everyone, regardless of race, color, religion, national or ethnic origin, sex, age, sexual orientation, gender identity, disability, marital status, military service or other non-merit factor.</em></p>\n<p> </p>",
    "requirements": "<p><strong>Required experience</strong></p>\n<ul>\n\t<li>Proven work experience of 2+ years as a Frontend developer.</li>\n\t<li>Strong experience with modern JavaScript (ES6+).</li>\n\t<li>At least some experience with TypeScript.</li>\n\t<li>Experience with React, Webpack.</li>\n\t<li>Experience with CSS, including CSS preprocessors.</li>\n\t<li>Familiarity with browser testing and debugging.</li>\n\t<li>In-depth understanding of the entire web development process (design, development and deployment.)</li>\n\t<li>Understanding of layout aesthetics.</li>\n\t<li>Knowledge of SEO principles.</li>\n\t<li>An ability to perform well in a fast-paced environment.</li>\n\t<li>Excellent analytical and multitasking skills.</li>\n\t<li>Excellent command of spoken and written English.</li>\n</ul>\n<p><strong>Preferred experience</strong></p>\n<ul>\n\t<li>Experience with Redux, Immutable.js, Ramda and SASS</li>\n\t<li>Experience with backend development work is considered a bonus</li>\n\t<li>Experience with the Google Cloud Platform</li>\n\t<li>Experience with analytics tools like Google Analytics or Mixpanel</li>\n\t<li>Familiarity with graphic-design software (e.g. Figma, Sketch, Gimp, Adobe Suite) and content management systems</li>\n\t<li>BSc degree in Computer Science or relevant field</li>\n</ul>",
    "link": "https://netdata.recruitee.com/o/frontend-developer"
},
{
    "id": "job-323227",
    "title": "Senior Site Reliability / DevOps Engineer (Cloud)",
    "company": "netdata",
    "department": "Engineering",
    "location": "Remote job",
    "description": "<p>Netdata is looking for Senior Site Reliability / DevOps Engineers proficient in CI/CD methodologies, coupled with strong experience in software written in Javascript, Go, C, Python or other scripting languages, to join our distributed (remote) engineering team.</p>\n<p> </p>\n<p>As a Senior SRE/DevOps engineer you will focus on supporting our netdata cloud offerings, augmenting our existing development infrastructure by implementing the automations necessary to catalyze further development of both our open-source project and our commercial offerings and last, but certainly not least, participating in the development of Netdata by making sure it's a first class citizen in various operating environments (e.g. orchestrated containers, IoT devices etc.)</p>\n<p><br></p>\n<p>Your work will include building CI/CD pipelines, packaging, installation facilities and operational processes as well as developing custom solutions for our various teams and systems. As a Netdata SRE/DevOps engineer you will also be assisting engineers across our company, enabling them to provide world-class solutions for numerous platforms; as well as our community, open-source contributors and team-members with your deep knowledge of systems and troubleshooting skills.</p>\n<p> </p>\n<p><strong>Responsibilities</strong></p>\n<ul>\n\t<li>Develop our automated CI/CD, packaging, deployment and execution environment infrastructure.</li>\n\t<li>Develop automation tools to catalyse existing development or operational processes</li>\n\t<li>Evaluate, architect and develop technology options for our infrastructure and systems</li>\n\t<li>Troubleshoot, maintain, enhance and augment our platform</li>\n\t<li>Automate tasks wherever possible</li>\n\t<li>Stay up-to-date on emerging technologies</li>\n</ul>\n<p><strong>Why join Netdata</strong></p>\n<ul>\n\t<li>We are a team of industry veterans and senior engineers that prioritize performance and ease of use over anything else.</li>\n\t<li>We embrace remote work and great work-life balance.</li>\n\t<li>We are solving hard problems that affect thousands of organisations worldwide.</li>\n\t<li>We are deeply committed to Open Source and love our community.</li>\n\t<li>We deeply care about system performance.</li>\n</ul>\n<p><strong>When you join Netdata, you can expect</strong></p>\n<ul>\n\t<li>A competitive salary.</li>\n\t<li>A generous stock plan.</li>\n\t<li>To join a venture-backed startup working with some of the most sophisticated investors of Silicon Valley.</li>\n\t<li>To be part of our world-class team and interact with an amazing community.</li>\n\t<li>To see first-hand how to grow and succeed in an engineering-first, open source-based company.</li>\n\t<li>To find a culture that rewards doers.</li>\n</ul>\n<p><em>Netdata is an Equal Opportunity Employer. We are committed to providing an inclusive work environment free of discrimination and harassment for everyone, regardless of race, color, religion, national or ethnic origin, sex, age, sexual orientation, gender identity, disability, marital status, military service or other non-merit factor.</em></p>\n<p> </p>",
    "requirements": "<p><strong>Required experience</strong></p>\n<ul>\n\t<li>A bachelor's degree in Computer Science or equivalent</li>\n\t<li>Extensive knowledge and experience with Infrastructure as code (Terraform), Container orchestration with Kubernetes and Helm</li>\n<li>3+ years of experience on CI/CD tools (Travis, Gitlab CI, AWS, Azure, etc) and methodologies</li>\n\t<li>Minimum 3 years of Linux systems development and/or administration.</li>\n\t<li>Minimum 2 years of experience with at least one scripting language, coupled with related automation projects</li>\n\t<li>Previous experience with cloud-based technologies and surrounding operational processes</li>\n\t<li>Self motivated, conscientious, with a problem-solving, hands-on mindset.</li>\n\t<li>Perfectionist where it matters, but also pragmatic, with effective time management skills.</li>\n\t<li>Team player, eager to help.</li>\n\t<li>Excellent analytical skills.</li>\n\t<li>Excellent command of spoken and written English.</li>\n</ul>\n<p> </p>\n<p><strong>Preferred experience</strong><br></p>\n<ul>\n\t\n\t<li>Expert on Continuous Integration/Continuous Deployment</li>\n\t<li>5+ years of shell scripting experience, on at least 2 languages (BASH, python, perl, ruby, etc.)</li>\n\t<li>Minimum 2 years of experience with Kubernetes</li>\n\t<li>Experience on configuration management and tools to support it (Ansible, puppet, etc.)</li>\n\t<li>Experience with monitoring solutions and service assurance in general</li>\n\t<li>Agile Development Methodology</li>\n</ul>",
    "link": "https://netdata.recruitee.com/o/senior-site-reliability-devops-engineer-cloud"
},
{
    "id": "job-671782",
    "title": "Senior Software Engineer (Go specialist/Messaging)",
    "company": "netdata",
    "department": "Engineering",
    "location": "Remote job",
    "description": "<h2>Job description</h2>\n<p>Netdata is looking for senior software engineers, with particular expertise and interest in the Go Programming Language to join our distributed (remote) engineering team.</p>\n<p>The position is 100% remote, but with your location's timezone limited from UTC -3 to UTC +5.</p>\n<p>We are building a modern microservices-based platform to complement our open-source project. As a Senior Software Engineer you will be expected to program in several languages, focusing on, but not limited to, Go. You will need to be familiar with architecting and developing production-grade microservices and distributed systems, REST, message brokers (e.g. Kafka, RabbitMQ, ActiveMQ, etc.) as well as writing testable, maintainable code.</p>\n<h3>Responsibilities</h3>\n<p><br></p>\n<ul>\n<li><p>Design and implement cloud-based microservices and APIs that complement our edge agents.</p></li>\n<li><p>Write clean, maintainable and testable code.</p></li>\n<li><p>Troubleshoot and debug applications.</p></li>\n<li><p>Operate the platform within our security and privacy guidelines.</p></li>\n<li><p>Collaborate with frontend developers to integrate user-facing elements with server side logic.</p></li>\n<li><p>Gather and address technical and design requirements.</p></li>\n<li><p>Build reusable code and libraries for future use.</p></li>\n<li><p>Automate tasks wherever possible.</p></li>\n<li><p>Liaise with developers, designers and system administrators to identify new features.</p></li>\n<li><p>Follow emerging technologies and frameworks.</p></li>\n</ul>\n<p><br><strong>Why join Netdata</strong></p>\n<ul>\n<li><p>Rare opportunity to deal with the unique challenges and opportunities of a fully distributed workforce.</p></li>\n<li><p>We understand the importance of safeguarding an exceptionally high level of employee engagement.</p></li>\n<li><p>We prioritize culture over process.</p></li>\n<li><p>We embrace remote work and great work-life balance.</p></li>\n<li><p>We are solving hard problems that affect thousands of organizations worldwide.</p></li>\n<li><p>We are deeply committed to Open Source and love our community.</p></li>\n</ul>\n<p><strong>When you join Netdata, you can expect</strong></p>\n<ul>\n<li><p>A competitive salary.</p></li>\n<li><p>A generous stock plan.</p></li>\n<li><p>To join a venture-backed startup working with some of the most sophisticated investors of Silicon Valley.</p></li>\n<li><p>To be part of our world-class team and interact with an amazing community.</p></li>\n<li><p>To see first-hand how to grow and succeed in an engineering-first, open source-based company.</p></li>\n<li><p>To find a culture that rewards doers.</p></li>\n</ul>\n<p><em>Netdata is an Equal Opportunity Employer. We are committed to providing an inclusive work environment free of discrimination and harassment for everyone, regardless of race, color, religion, national or ethnic origin, sex, age, sexual orientation, gender identity, disability, sexual orientation, marital status, military service or other non-merit factor.</em> <br></p>",
    "requirements": "<p><strong>Required experience</strong></p>\n<ul>\n<li><p>Substantial hands on experience with the Go programming language.</p></li>\n<li><p>Experience with programming languages (Go, C, C#, Java, Python, Typescript etc.)</p></li>\n<li><p>Proven experience with Cloud-Native, microservices architectures.</p></li>\n<li><p>Messaging</p></li>\n<li><p>Excellent analytical and time management skills.</p></li>\n<li><p>Teamwork skills with a problem-solving attitude.</p></li>\n<li><p>Excellent command of spoken and written English.</p></li>\n</ul>\n<p><br></p>\n<p><strong>Preferred experience</strong></p>\n<ul>\n<li><p>Substantial hands on experience with the Go programming language</p></li>\n<li><p>Experience with Google Cloud services</p></li>\n<li><p>BSc degree in Computer Science or relevant field</p></li>\n</ul>",
    "link": "https://netdata.recruitee.com/o/senior-software-engineer-go-specialistmessaging"
},
{
    "id": "job-812654",
    "title": "Senior Product Designer",
    "company": "netdata",
    "department": "Product",
    "location": "Remote job",
    "description": "<p>Netdata is looking for an experienced and creative Senior Product Designer to join our distributed (remote) engineering team. </p>\n<p>We are building a modern microservices-based platform to complement our open-source project. As a Senior Product Designer you will be responsible to deliver the best online user experience by creating both functional and appealing features. You will need to be familiar with the best UI/UX design practices, wireframe tools, design tools and design of monitoring systems. </p>\n<p><br></p>\n<p>Your role will be extremely important for our success and ensuring our community satisfaction and loyalty. </p>\n<p><br></p>\n<p>Responsibilities </p>\n<p>● Gather and evaluate user requirements in collaboration with the product manager and engineers </p>\n<p>● Illustrate design ideas using storyboards, process flows and sitemaps </p>\n<p>● Design graphic user interface elements </p>\n<p>● Prepare and present rough drafts to internal teams and key stakeholders ● Identify and troubleshoot UX problems </p>\n<p>● Optimise existing user interface designs </p>\n<p>● Conduct layout adjustments based on user feedback </p>\n<p>● Adhere to style standards on fonts, colours and images </p>\n<p><br></p>\n<p>Why join Netdata </p>\n<p>● We are a team of industry veterans and senior engineers that prioritise performance and ease of use over anything else. </p>\n<p>● We embrace remote work and great work-life balance. </p>\n<p>● We are solving hard problems that affect thousands of organisations worldwide. ● We are deeply committed to Open Source and love our community. </p>\n<p>● We deeply care about system performance. </p>\n<p>When you join Netdata, you can expect </p>\n<p>● A competitive salary. </p>\n<p>● A generous stock plan. </p>\n<p>● To join a venture-backed startup working with some of the most sophisticated investors of Silicon Valley. </p>\n<p>● To be part of our world-class team and interact with an amazing community. </p>\n<p>● To see first-hand how to grow and succeed in an engineering-first, open source-based company. </p>\n<p>● To find a culture that rewards doers.</p>\n<p><em>Netdata is an Equal Opportunity Employer. We are committed to providing an inclusive work</em> <em>environment free of discrimination and harassment for everyone, regardless of race, color, religion,</em> <em>national or ethnic origin, sex, age, sexual orientation, gender identity, disability, sexual orientation,</em><em> marital status, military service or other non-merit factor. </em></p>\n<p><br></p>",
    "requirements": "<p>Required experience </p>\n<p>● At least 5 years of proven experience as a Product designer of online software products, for web and mobile solutions. </p>\n<p>● BSc in Design, Computer Science or relevant field </p>\n<p>● Experience with ML and Data Products </p>\n<p>● Portfolio of design projects </p>\n<p>● Knowledge of wireframe tools </p>\n<p>● Up-to-date knowledge of design software like Sketch, Figma etc. </p>\n<p>● Team spirit; strong communication skills to collaborate with various stakeholders ● Ability to discuss and explain design options </p>\n<p>● Detail oriented and critical thinker </p>\n<p>● Good time-management skills</p>\n<p><br></p>",
    "link": "https://netdata.recruitee.com/o/senior-product-designer"
},
{
    "id": "job-826002",
    "title": "Technical Customer Success Manager",
    "company": "netdata",
    "department": "Product",
    "location": "Remote job",
    "description": "<p>Netdata is looking for an experienced Technical Customer Success Manager to drive customer loyalty, adoption and their implementation of Netdata Solutions. Reporting to the Director of Customer Success, you will create deep and impactful relationships with our customers and ensure their satisfaction, and thereby contribute greatly to Netdata’s growth.</p>\n<p>All candidates for this position should be comfortable communicating with both technical and business-oriented roles within a company and across a spectrum that consists of developers as well as IT VP’s and Directors.</p>\n<p>The Technical Customer Success Manager will enable customers to be successful on our platform and achieve their desired outcomes, by driving product adoption, building strong customer relationships and providing a feedback loop to the rest of the organization.<br><strong><br></strong></p>\n<p><strong>Responsibilities</strong></p>\n<ul>\n<li><p>Understand, analyze and work on high-touch and low-touch campaigns to improve engagement, adoption, and retention and reduce customer churn.</p></li>\n<li><p>Establish Customer Success Practices</p></li>\n<li><p>Demonstrate product knowledge and ensure broad adoption of Netdata solutions.</p></li>\n<li><p>Serve as the voice of the customer and collect feedback to drive continuous improvement across all areas including the product.</p></li>\n<li><p>Analyse statistics and compile accurate reports.</p></li>\n<li><p>Mediate between customers and the organization.</p></li>\n<li><p>Handle and resolve customer requests and complaints.</p></li>\n<li><p>Provide technical guidance to users around best practices on how to utilize Netdata</p></li>\n</ul>\n<p><span style=\"font-size:12px;\"><span style=\"font-size:14px;\"><span style=\"color:rgb(127, 127, 127);\"><span style=\"color:rgb(89, 89, 89);\"><br></span></span></span></span></p>\n<p><br></p>",
    "requirements": "<p><strong>Requirements</strong></p>\n<ul>\n<li><p>2+ years of experience in Customer Success</p></li>\n<li><p>Familiarity with Linux, container technologies (cgroups, docker, etc.), and scripting languages (e.g. Python, Bash etc.) </p></li>\n<li><p>Curiosity to learn all about infrastructure monitoring and troubleshooting solutions</p></li>\n<li><p>Previous B2B SaaS software experience </p></li>\n<li><p>Experience with customer success/ customer support tools</p></li>\n<li><p>Ability to quickly identify and solve technical and business challenges </p></li>\n<li><p>Ability to relate technical concepts to customers of all technical backgrounds</p></li>\n<li><p>A desire for action and willingness to work in a roll-up-your-sleeves fashion.</p></li>\n<li><p>An enthusiastic and dedicated approach to connect with customers and understand their needs, ensuring they understand and realize the full value of our solutions.</p></li>\n<li><p>Ability to develop deep customer relationships that result in high levels of customer satisfaction.</p></li>\n<li><p>Expert in deploying technology or support services with companies.</p></li>\n<li><p>Possess creativity when it comes to educating customers on Netdata solutions.</p></li>\n<li><p>A process-focused mindset that has a true love for customers.</p></li>\n<li><p>Ability to leverage your business acumen to assess client needs and drive positive outcomes.</p></li>\n<li><p>Extremely data driven; ability to understand user feedback and leverage it to help drive positive customer outcomes and adoption.</p></li>\n<li><p>Excellent collaborator with the skills needed to engage across multiple teams (Product, Engineering, Marketing, etc.) and multiple geographies to drive the outcomes needed to ensure success</p></li>\n<li><p>Professional, executive presence internally and externally.</p></li>\n<li><p>Experience in working with complex technologies (IT infrastructures preferred).</p></li>\n<li><p>Proven success working in a fast-paced, dynamic and rapidly changing startup environment.</p></li>\n</ul>\n<p> </p>\n<p> </p>\n<p><br></p>\n<p>Why join Netdata?</p>\n<ul>\n<li><p>We are a team of industry veterans and senior tech pro’s that prioritize performance and ease of use over anything else.</p></li>\n<li><p>We embrace remote work and great work-life balance.</p></li>\n<li><p>We are solving hard problems that affect thousands of users and organizations worldwide.</p></li>\n<li><p>We are deeply committed to Open Source and love our community.</p></li>\n<li><p>We deeply care about system performance.</p></li>\n</ul>\n<p><br></p>\n<p>When you join Netdata, you can expect</p>\n<ul>\n<li><p>A competitive salary.</p></li>\n<li><p>A generous stock plan.</p></li>\n<li><p>To join a venture-backed startup working with some of the most sophisticated investors of Silicon Valley.</p></li>\n<li><p>To be part of our world-class team and interact with an amazing community.</p></li>\n<li><p>To see first-hand how to grow and succeed in an engineering-first, open source-based company.</p></li>\n<li><p>To find a culture that rewards doers.</p></li>\n</ul>\n<p><em>Netdata is an Equal Opportunity Employer. We are committed to providing an inclusive work environment free of discrimination and harassment for everyone, regardless of race, colour, religion, national or ethnic origin, sex, age, sexual orientation, gender identity, disability, sexual orientation, marital status, military service or other non-merit factor.</em></p>\n<p><br></p>",
    "link": "https://netdata.recruitee.com/o/technical-customer-success-manager"
}
]