[
{
    "id": "job-323188",
    "title": "Senior Frontend Engineer",
    "company": "netdata",
    "department": "Engineering",
    "location": "Remote job",
    "description": "<p>Netdata is looking for a talented Senior Frontend Engineer to join our distributed (remote) engineering team.</p>\n<p>As a Senior Frontend Engineer at Netdata, you will need to be passionate about web technology, declarative/reactive programming paradigms, testable code and extreme performance. You will live and breathe within the Chrome/Firefox/Safari Developer/React Tools and make sure we deliver a world-class experience to the millions of people using our product on a daily basis.</p>\n<p> </p>\n<p><strong>Responsibilities</strong></p>\n<ul>\n\t<li>Use modern Web technologies and frameworks to develop our frontend platform, components and libraries. At Netdata we use React with Recoil</li>\n\t<li>Write testable, documented code that is highly maintainable</li>\n\t<li>Develop for maximum performance, compatibility and a world-class user experience, across devices and form-factors.</li>\n\t<li>Collaborate with UX/UI designers to improve usability and accessibility</li>\n\t<li>Automate repetitive tasks when possible</li>\n\t<li>Stay up-to-date on emerging technologies and frameworks</li>\n</ul>\n<p><strong>Why join Netdata</strong></p>\n<ul>\n\t<li>We are a team of industry veterans and senior engineers that prioritize performance and ease of use over anything else.</li>\n\t<li>We embrace remote work and great work-life balance.</li>\n\t<li>We are solving hard problems that affect thousands of organisations worldwide.</li>\n\t<li>We are deeply committed to Open Source and love our community.</li>\n\t<li>We deeply care about system performance.</li>\n</ul>\n<p><strong>When you join Netdata, you can expect</strong></p>\n<ul>\n\t<li>A competitive salary.</li>\n\t<li>A generous stock plan.</li>\n\t<li>To join a venture-backed startup working with some of the most sophisticated investors of Silicon Valley.</li>\n\t<li>To be part of our world-class team and interact with an amazing community.</li>\n\t<li>To see first-hand how to grow and succeed in an engineering-first, open source-based company.</li>\n\t<li>To find a culture that rewards doers.</li>\n</ul>\n<p><em>Netdata is an Equal Opportunity Employer. We are committed to providing an inclusive work environment free of discrimination and harassment for everyone, regardless of race, colour, religion, national or ethnic origin, sex, age, sexual orientation, gender identity, disability, marital status, military service or other non-merit factor.</em></p>\n<p> </p>",
    "requirements": "<p><strong>Required experience</strong></p>\n<ul>\n\t<li>Proven work experience of 4+ years as a Frontend developer.</li>\n\t<li>Strong experience with modern JavaScript (ES6+).</li>\n\t<li>At least some experience with TypeScript.</li>\n\t<li>Experience with React, Webpack.</li>\n\t<li>Experience with CSS, including CSS preprocessors.</li>\n\t<li>Familiarity with browser testing and debugging.</li>\n\t<li>In-depth understanding of the entire web development process (design, development and deployment.)</li>\n\t<li>Understanding of layout aesthetics.</li>\n\t<li>Knowledge of SEO principles.</li>\n\t<li>An ability to perform well in a fast-paced environment.</li>\n\t<li>Excellent analytical and multitasking skills.</li>\n\t<li>Excellent command of spoken and written English.</li>\n</ul>\n<p><strong>Preferred experience</strong></p>\n<ul>\n\t<li>Experience with Recoil, Immutable.js, Ramda and SASS</li>\n\t<li>Experience with backend development work is considered a bonus</li>\n\t<li>Experience with the Google Cloud Platform</li>\n\t<li>Experience with analytics tools like Google Analytics or Mixpanel</li>\n\t<li>Familiarity with graphic-design software (e.g. Figma, Sketch, Gimp, Adobe Suite) and content management systems</li>\n\t<li>BSc degree in Computer Science or relevant field</li>\n</ul>",
    "link": "https://netdata.recruitee.com/o/senior-frontend-engineer"
},
{
    "id": "job-323407",
    "title": "Senior Software Engineer in Test (SET)",
    "company": "netdata",
    "department": "Engineering",
    "location": "Remote job",
    "description": "<p>Netdata is looking for talented Software Engineers in Test (SET) to join our distributed (remote) engineering team. As a SET at Netdata, you will need to be passionate about Software Quality Assurance, capable of both exploratory manual testing and authoring of test suites for automated testing. Our products include a go-based stack of microservices, reactive web applications and our open source c-based agent. Your knowledge and experience in test automation across the 'test pyramid', in various platforms combined with your excellent communication and teamwork skills will actively contribute to the quality of the Netdata platform.<br></p>\n<p><br></p>\n<p><strong>Responsibilities</strong></p>\n<ul>\n\t<li>Collaborate with software and DevOps engineers across the company to understand, develop and automate test and deployment processes.</li>\n<li>Author, optimize and maintain comprehensive integration and end-to-end (system) test suites for the Netdata platform, including our open-source offering.Your work will entail significant scripting work in order to automate processes and setup testing environments.</li>\n<li>Perform manual exploratory end-to-end (system) and integration testing for newly created features — and then create the respective test automation scenarios for those manual tests.</li>\n\t<li>Be an advocate for Test Driven Development (TDD) and software development best practices across Netdata, through the introduction and observance of 'shift left' principles.</li>\n<li>Educate software engineers on how to author efficient unit and component tests for their code, by demonstrating proper techniques, frameworks and tools.</li>\n<li>Communicate Code Quality metrics to all stakeholders.</li>\n<li>Understand and review complex systems already in existence.</li>\n<li>Actively participate in the planning phases of new systems under development.</li>\n</ul>\n<p><strong>Why join Netdata</strong></p>\n<ul>\n\t<li>We are a team of industry veterans and senior engineers that prioritize performance and ease of use over anything else.</li>\n\t<li>We embrace remote work and great work-life balance.</li>\n\t<li>We are solving hard problems that affect thousands of organizations worldwide.</li>\n\t<li>We are deeply committed to Open Source and love our community.</li>\n\t<li>We deeply care about system performance.</li>\n</ul>\n<p><strong>When you join Netdata, you can expect</strong></p>\n<ul>\n\t<li>A competitive salary.</li>\n\t<li>A generous stock plan.</li>\n\t<li>To join a venture-backed startup working with some of the most sophisticated investors of Silicon Valley.</li>\n\t<li>To be part of our world-class team and interact with an amazing community.</li>\n\t<li>To see first-hand how to grow and succeed in an engineering-first, open source-based company.</li>\n\t<li>To find a culture that rewards doers.</li>\n</ul>\n<p><em>Netdata is an Equal Opportunity Employer. We are committed to providing an inclusive work environment free of discrimination and harassment for everyone, regardless of race, color, religion, national or ethnic origin, sex, age, sexual orientation, gender identity, disability, marital status, military service or other non-merit factor.</em></p>\n<p> </p>",
    "requirements": "<p><strong>Required experience</strong><br></p>\n<ul>\n<li>Previous working experience as a Software in Test for at least 2 year(s)</li>\n<li>Familiarity with UNIX-like systems and environments.</li>\n<li>Familiarity with scripting languages.</li>\n<li>Familiarity with modern CI/CD pipelines.</li>\n<li>Experience in Test Automation. We expect all candidates to have proven experience with the implementation, maintenance, optimization and extension of large test suites in Selenium, TestNG, REST-assured, or equivalent frameworks.</li>\n\t<li>An ability to perform well in a fast-paced environment.</li>\n\t<li>Excellent analytical and multitasking skills.</li>\n\t<li>Excellent command of spoken and written English.</li>\n</ul>\n<p><strong>Preferred experience</strong><strong><br></strong></p>\n<ul>\n\t<li>Familiarity with microservice-based integration and systems testing is a significant plus.</li>\n\t\n\t<li>BSc degree in Computer Science or relevant field</li>\n</ul>",
    "link": "https://netdata.recruitee.com/o/senior-software-engineer-in-test-set"
},
{
    "id": "job-671782",
    "title": "Senior Software Engineer (Go specialist/Messaging)",
    "company": "netdata",
    "department": "Engineering",
    "location": "Remote job",
    "description": "<h2>Job description</h2>\n<p>Netdata is looking for senior software engineers, with particular expertise and interest in the Go Programming Language to join our distributed (remote) engineering team.</p>\n<p>The position is 100% remote, but with your location's timezone limited from UTC -3 to UTC +5.</p>\n<p>We are building a modern microservices-based platform to complement our open-source project. As a Senior Software Engineer you will be expected to program in several languages, focusing on, but not limited to, Go. You will need to be familiar with architecting and developing production-grade microservices and distributed systems, REST, message brokers (e.g. Kafka, RabbitMQ, ActiveMQ, etc.) as well as writing testable, maintainable code.</p>\n<h3>Responsibilities</h3>\n<p><br></p>\n<ul>\n<li><p>Design and implement cloud-based microservices and APIs that complement our edge agents.</p></li>\n<li><p>Write clean, maintainable and testable code.</p></li>\n<li><p>Troubleshoot and debug applications.</p></li>\n<li><p>Operate the platform within our security and privacy guidelines.</p></li>\n<li><p>Collaborate with frontend developers to integrate user-facing elements with server side logic.</p></li>\n<li><p>Gather and address technical and design requirements.</p></li>\n<li><p>Build reusable code and libraries for future use.</p></li>\n<li><p>Automate tasks wherever possible.</p></li>\n<li><p>Liaise with developers, designers and system administrators to identify new features.</p></li>\n<li><p>Follow emerging technologies and frameworks.</p></li>\n</ul>\n<p><br><strong>Why join Netdata</strong></p>\n<ul>\n<li><p>Rare opportunity to deal with the unique challenges and opportunities of a fully distributed workforce.</p></li>\n<li><p>We understand the importance of safeguarding an exceptionally high level of employee engagement.</p></li>\n<li><p>We prioritize culture over process.</p></li>\n<li><p>We embrace remote work and great work-life balance.</p></li>\n<li><p>We are solving hard problems that affect thousands of organizations worldwide.</p></li>\n<li><p>We are deeply committed to Open Source and love our community.</p></li>\n</ul>\n<p><strong>When you join Netdata, you can expect</strong></p>\n<ul>\n<li><p>A competitive salary.</p></li>\n<li><p>A generous stock plan.</p></li>\n<li><p>To join a venture-backed startup working with some of the most sophisticated investors of Silicon Valley.</p></li>\n<li><p>To be part of our world-class team and interact with an amazing community.</p></li>\n<li><p>To see first-hand how to grow and succeed in an engineering-first, open source-based company.</p></li>\n<li><p>To find a culture that rewards doers.</p></li>\n</ul>\n<p><em>Netdata is an Equal Opportunity Employer. We are committed to providing an inclusive work environment free of discrimination and harassment for everyone, regardless of race, color, religion, national or ethnic origin, sex, age, sexual orientation, gender identity, disability, sexual orientation, marital status, military service or other non-merit factor.</em> <br></p>",
    "requirements": "<p><strong>Required experience</strong></p>\n<ul>\n<li><p>Substantial hands on experience with the Go programming language.</p></li>\n<li><p>Experience with programming languages (Go, C, C#, Java, Python, Typescript etc.)</p></li>\n<li><p>Proven experience with Cloud-Native, microservices architectures.</p></li>\n<li><p>Messaging</p></li>\n<li><p>Excellent analytical and time management skills.</p></li>\n<li><p>Teamwork skills with a problem-solving attitude.</p></li>\n<li><p>Excellent command of spoken and written English.</p></li>\n</ul>\n<p><br></p>\n<p><strong>Preferred experience</strong></p>\n<ul>\n<li><p>Substantial hands on experience with the Go programming language</p></li>\n<li><p>Experience with Google Cloud services</p></li>\n<li><p>BSc degree in Computer Science or relevant field</p></li>\n</ul>",
    "link": "https://netdata.recruitee.com/o/senior-software-engineer-go-specialistmessaging"
},
{
    "id": "job-859033",
    "title": "Digital Marketing/Martech Lead",
    "company": "netdata",
    "department": "Marketing",
    "location": "Remote job",
    "description": "<p>This is an exciting, hands-on opportunity to join our growing Marketing team and contribute to the next development phase of the marketing function to help accelerate the company’s growth. This role will work closely with other departments, including Product Management/Marketing, Customer Success, Documentation, and Community Management. <br></p>\n<p>Netdata is a well-funded software start-up, fully remote, working across 20 time zones around the globe. We provide a groundbreaking open-source IT infrastructure performance monitoring and troubleshooting tool, which uniquely reduces the complexity of monitoring and troubleshooting for experts and non-experts alike. Our vision is to build a global community equipped to troubleshoot the technology that runs the world.</p>\n<p><br></p>\n<p><strong>Responsibilities</strong></p>\n<p>As a marketing implementation specialist, you will be responsible for the development and management of the marketing technology stack. The role will help to establish digital marketing best practices across the organization that will drive improvements in the efficiency and effectiveness of marketing and customer communications initiatives.<br></p>\n<p>You will combine your analytical thinking, data management skills, and marketing expertise to drive change and growth through the automation, scaling, and performance reporting of marketing.</p>",
    "requirements": "<ul>\n<li><p>Understanding of marketing methodologies for website conversion funnels, tracking and optimizing the website user experience for new sign-ups and retention, lead nurture programs, and analytic modeling for marketing efforts and campaigns. </p></li>\n<li><p>Responsible for evaluating current marketing tools, researching, selecting, implementing, and integrating new best-of-breed tools.</p></li>\n<li><p>Maintaining the CRM by enriching a highly accurate lead database and managing the processes and tools integrated into it.</p></li>\n<li><p>Provide reliable dashboards and reports to track sales and marketing qualified leads performance, with attribution modeling, as they move through the lifecycle. </p></li>\n<li><p>Knowledge preferred of HubSpot administration, Google Tag Manager, Marketo, PostHog, ClearBit, ZoomInfo, SQL, and other similar marketing analytic tools.   </p></li>\n<li><p>Experience with the AdTech/MarTech ecosystem, with an understanding of how technology platforms integrate with media buying tools (e.g. Google Ads/Programmatic, etc.)</p></li>\n<li><p>Experience with or knowledge of monitoring and observability tools, SaaS and open source products is a major plus.</p></li>\n</ul>\n<div>\n<p><strong>Why join Netdata?</strong></p>\n<ul>\n<li>We are a team of industry veterans and senior tech pro’s that prioritize performance and ease of use over anything else.</li>\n<li>We embrace remote work and great work-life balance.</li>\n<li>We are solving hard problems that affect thousands of users and organizations worldwide.</li>\n<li>We are deeply committed to Open Source and love our community.</li>\n<li>We deeply care about system performance.</li>\n</ul>\n<p><strong>When you join Netdata, you can expect</strong></p>\n<ul>\n<li>A competitive salary.</li>\n<li>A generous stock plan.</li>\n<li>To join a venture-backed startup working with some of the most sophisticated investors of Silicon Valley.</li>\n<li>To be part of our world-class team and interact with an amazing community.</li>\n<li>To see first-hand how to grow and succeed in an engineering-first, open source-based company.</li>\n<li>To find a culture that rewards doers.</li>\n</ul>\n<p><em>Netdata is an Equal Opportunity Employer. We are committed to providing an inclusive work environment free of discrimination and harassment for everyone, regardless of race, colour, religion, national or ethnic origin, sex, age, sexual orientation, gender identity, disability, sexual orientation, marital status, military service or other non-merit factor.</em></p>\n</div>",
    "link": "https://netdata.recruitee.com/o/digital-marketingmartech-lead"
}
]