[
{
    "id": 1571199,
    "title": "Senior Backend Software Engineer",
    "company": "orfium",
    "department": "",
    "location": "Athens",
    "description": "<h3>A few things about <a href=\"https://orfium.tech/\" rel=\"nofollow noreferrer noopener\" class=\"external\">Orfium</a> </h3><p>In Orfium we are building the digital future of the Music and Media Industry, by providing complete solutions to generate and manage their revenue, promote their content and analyze their business.</p><p>YouTube, Spotify, Apple, Netflix, and various other platforms have changed the experience of the audience. On our part, we are building the technology to find content in digital platforms, recognize it and match it with the catalogs of the owners. We are developing solutions based on Big Data, Machine Learning, and Business Intelligence to provide Enterprise services and complete SaaS solutions.</p><p>Orfium currently serves some of the biggest clients in Entertainment, as the leading Copyrights Management and Information Technology company. With our HQ in Malibu, CA and our R&amp;D department in Athens, Greece, we are able to serve the biggest markets while we innovate fast.</p><p>If you believe you can make a difference by joining one of the fastest-growing tech companies in the world, you should definitely apply!</p><p><br></p><p><strong>WHAT WE NEED</strong></p><p>We are looking for a Senior Django Backend Engineer to join our Greek branch in Koukaki, Athens.</p><p><strong>WHAT YOU'LL BE DOING</strong></p><p>You will be part of an Agile Team and will:</p><ul> <li>Maintain as well as build new features for our B2B products.</li> <li>Participate in team meetings and propose solutions.</li> <li>Code Review your collaborators' code(everyone does it).</li> <li>Properly document your work by both technical and/or business perspective.</li> </ul>",
    "requirements": "<p><strong>NEEDED SKILLS</strong><br></p><ul> <li>At least 4+ years of working experience in creating and maintaining software systems in production environments.</li> <li>At least 2 years of working experience with Django or a modern Web Development Framework.</li> <li>Experience in Test-Driven Development (TDD).</li> <li>Hands-On  SQL  Experience(preferably with PostgreSQL).</li> <li>Ability to write organised and clean code.</li> <li>Good understanding of Version Control (preferably with Git).</li> <li>Understanding  of  Modern  System  Architectures,  Design  Patterns,  Data  Structures.</li> <li>Willingness to continuously learn and become better.</li> <li>Ability to work as part of a team.</li> <li>Excellent communication skills.</li> <li>Good written and verbal communication skills in English.</li> </ul><p><br></p><p><strong>EXTRA POINTS:</strong></p><ul> <li>Expertise in Django/Django REST Framework.</li> <li>Familiarity with AWS.</li> <li>Experience with ElasticSearch.</li> <li>Experience with consuming third-party APIs.</li> <li>Love for music.</li> </ul>",
    "link": "https://apply.workable.com/orfium/j/BD16733869"
},
{
    "id": 1624447,
    "title": "Music Copyright Administrator",
    "company": "orfium",
    "department": "Operations",
    "location": "Malibu",
    "description": "<p><strong>Company Summary:</strong></p><p>Orfium is a fast-growing music technology company representing some of the biggest music companies in the world. We are looking for talented, hard-working people to join our rights management team who are passionate about protecting the value of music. Our office is located in Malibu, CA with a beautiful ocean view overlooking the Malibu Pier. Some of our clients include: Warner Music Group, Sony Music Group, Sony Music Publishing, Warner Chappell Music Publishing, Global Music Rights, Ingrooves, Red Bull and many more.</p><p><strong>Position Summary: </strong>The Music Copyright Administrator’s responsibility is to manage our client’s assets and data by performing various tasks involving asset conflict resolution, music research, data analysis and thoughtful problem-solving. Primary tasks include CMS Masterlist / Backpay review, conflict resolution, ZenDesk communications between clients and 3rd parties.</p><p><strong>Duties/Responsibilities:</strong></p><ul> <li>Manage client’s assets in the CMS through conflict resolution.</li> <li>Research metadata, music catalogs and song histories.</li> <li>Maintain or exceed daily goals as set by management.</li> <li>Troubleshoot issues as they arise and communicate questions to their team lead.</li> <li>Review full-management client Masterlist / Backpay reports.</li> <li>Stay up-to-date with Orfium, client and industry partner policies.</li> <li>Perform other duties and responsibilities, as assigned.</li> </ul>",
    "requirements": "<p>Qualifications:</p><ul> <li>Preferred experience claiming for 1 year.</li> <li>Customer service or team management experience is a plus.</li> <li>Excellent time management skills with a proven ability to meet deadlines.</li> <li>Strong analytical, logical and problem-solving skills.</li> <li>Ability to function effectively in an at-home work environment (autonomous, self-starter, remote communication with team and management).</li> <li>Advanced computer skills and familiarity with G-Suite, Excel. Ability to quickly adapt to unfamiliar, internal Orfium interfaces.</li> <li>Excellent verbal and written communication skills; extremely detail-oriented.</li> <li>Extensive musical knowledge with an exceptional “ear” for auditory detail.</li> <li>Preferred BA or BS degree from an accredited college or university.</li> </ul><p><br></p><p>Supervisory Responsibilities:</p><p>This position does not supervise. </p><p>Essential Work &amp; Physical Requirements:</p><p>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. While performing the duties of this job, the employee is regularly required to talk and hear.</p><ul> <li>Available to work a minimum of 40 hours per week and a minimum of 5 days per week. </li> <li>Prolonged periods of sitting at a desk and working on a computer.</li> </ul><ul><li>Must be able to lift up to 15 pounds at times. </li></ul><p><br></p><p>Orfium is an Equal Opportunity Employer.</p>",
    "link": "https://apply.workable.com/orfium/j/BCFB334867"
},
{
    "id": 1716423,
    "title": "Junior Backend Software Engineer",
    "company": "orfium",
    "department": "",
    "location": "Athens",
    "description": "<p>In Orfium we are building the digital future of the Music and Media Industry, by providing complete solutions to generate and manage their revenue, promote their content and analyze their business.</p> <p>YouTube, Spotify, Apple, Netflix, and various other platforms have changed the experience of the audience. On our part, we are building the technology to find content in digital platforms, recognize it and match it with the catalogs of the owners. We are developing solutions based on Big Data, Machine Learning, and Business Intelligence to provide Enterprise services and complete SaaS solutions.</p> <p>Orfium currently serves some of the biggest clients in Entertainment, as the leading Copyrights Management and Information Technology company. With our HQ in Malibu, CA and our R&amp;D department in Athens, Greece, we are able to serve the biggest markets while we innovate fast.</p> <p>If you believe you can make a difference by joining one of the fastest-growing tech companies in the world, you should definitely apply!</p>",
    "requirements": "<p>What we need</p><ul> <li>A strong, collaborative team player.</li> <li>Computer science fundamentals and an understanding of modern development best practices - you’ve most likely got a degree in computer science or a related field.</li> <li>Experience with Python</li> <li>DB programming experience (SQL/NoSQL) </li> </ul><p><br></p><p>What you will be doing </p><ul> <li>Work in an agile environment, learn different technologies and work methodologies.</li> <li>Contribute to the complete software life cycle, maintain as well build new features for our products.</li> <li>Participate in brainstorming internal meetings and propose solutions.</li> </ul>",
    "link": "https://apply.workable.com/orfium/j/B1206E8A78"
},
{
    "id": 1098448,
    "title": "DevOps Engineer (AWS / Python)",
    "company": "orfium",
    "department": "Information Technology",
    "location": "Koukaki",
    "description": "<h3>A few things about <a href=\"https://orfium.tech/\" rel=\"nofollow noreferrer noopener\" class=\"external\">Orfium</a><br> </h3><p>In Orfium we are building the digital future of the Music and Media Industry, by providing complete solutions to generate and manage revenue, promote content and provide business insights.</p><p>YouTube, Spotify, Apple, Netflix and various other platforms have changed the experience of the audience. On our part, we are building the technology to find content in digital platforms, recognize it and match it with the catalogs of the owners. We are developing solutions based on Big Data, Machine Learning, and Business Intelligence to provide Enterprise services and complete SaaS solutions.</p><p>Orfium currently serves some of the biggest clients in Entertainment, as the leading Copyrights Management and Information Technology company. With our HQ in Malibu, CA and our R&amp;D department in Athens, Greece, we are able to serve the biggest markets while we innovate fast.</p><p>If you believe you can make a difference by joining one of the fastest-growing tech companies in the world, you should definitely apply!</p><h3></h3><p><br></p><h3>What we need</h3><p>We are looking for a DevOps Engineer to join our Engineering team of the Greek branch in Koukaki, Attica. We strongly believe that a DevOps culture can greatly accelerate an engineering team and improve its performance. As we've doubled in size during the last year, our ideal candidate is someone with a strong automation mindset to help us empower every engineering team and make it autonomous using DevOps practices.</p>",
    "requirements": "<h3>What you will be doing</h3><ul> <li>Help us build and develop amazing applications in AWS</li> <li>Manage cloud infrastructure</li> <li>Package software suites for SaaS offerings</li> <li>Automate deployment and monitoring of cloud applications and services</li> <li>Create development environments in AWS utilizing CloudFormation</li> <li>Work closely with engineering teams to constantly improve our development workflows</li> </ul><h3>Needed skills</h3><ul> <li>Automation enthousiast</li> <li>Very good knowledge and understanding of SDLC and CI/CD</li> <li>Hands-on experience with Cloud Providers (AWS, GCP, Azure)</li> <li>Comfortable with Docker</li> <li>Experience with Infrastructure as Code</li> <li>Experience with Python and shell scripting</li> <li>Experience in monitoring and troubleshooting production systems</li> <li>Familiar with Linux administration</li> </ul><h3>Nice to have</h3><ul> <li>BSc/BA in Computer Science, Engineering or relevant field</li> <li>Hands-on experience with AWS ECS, RDS, EKS, S3, EC2</li> <li>CloudFormation, Terraform, Ansible</li> <li>Kubernetes</li> <li>AWS Certificates (Solutions Architect, DevOps)</li> </ul>",
    "link": "https://apply.workable.com/orfium/j/9AF1E29DD3"
},
{
    "id": 1352598,
    "title": "Music Copyright Specialist",
    "company": "orfium",
    "department": "",
    "location": "Malibu",
    "description": "<p><strong>Company Summary:</strong></p><p>Orfium is a fast-growing music technology company representing some of the biggest music companies in the world. We are looking for talented, hardworking people to join our rights management team who are passionate about protecting the value of music. Our office is located in Malibu, CA with a beautiful ocean view overlooking the Malibu Pier. Some of our clients include: Warner Music Group, Sony Music Group, Sony/ATV Music Publishing, Warner Chappell Music Publishing, Global Music Rights, Ingrooves, Red Bull, and many more.</p><p><strong>Position Summary: </strong>The Music Copyrights Specialist is responsible for identifying videos that indicate copyright music/infringement through Youtube’s content management system (CMS). This role requires the analysis of music and revenue data as well staying up to date with industry trends in entertainment. This is a entry-level professional with limited prior experience, but can learn to use professional concepts to resolve problems of limited scope and complexity.</p><p><br></p>",
    "requirements": "<p><strong>Duties/Responsibilities:</strong><br></p><ul> <li>Employees are expected to acquire the skills and knowledge necessary to perform work necessary for the role through defined training and development planning. </li> <li>Analyze music on a harmonic, melodic, lyrical, and sonic level. </li> <li>Extreme attention to detail, data-driven, excellent communication skills, and a self-starter.</li> <li>Identify videos using copyrighted music through YouTube’s content management system.</li> <li>Support the policing of piracy and copyright infringement by monitoring the unauthorized exploitation of our clients’ copyrights. </li> <li>Remain up to date with industry topics and music. </li> <li>Collect and analyze revenue data to discover valuable content for our clients. </li> <li>Other duties that may be assigned to help the company meet goals.</li> <li>Growth opportunities within this role based on performance    </li> <li>Employees should perform at a minimum, milestone 1 for a minimum of 12 months from date of hire as designated by their manager. </li> <li>Perform other duties and responsibilities, as assigned.</li> </ul><p><strong>Qualifications:</strong></p><ul> <li>Excellent verbal and written communication skills; extremely detail-oriented.</li> <li>Exhibits professional demeanor and sound judgment.</li> <li>Follows up on delegated assignments through completion.</li> <li>Self-starter, who takes initiative and is resourceful; takes ownership of tasks and projects.</li> <li>Ability to adjust to changes of the industry, new guidelines made either internally or by our clients</li> <li>Ability to multitask and prioritize; works well under pressure.</li> <li>Ability to work autonomously and collaboratively.</li> <li>Excellent typing and computer skills, including in Word, Excel, Outlook.</li> </ul><ul> <li>Advanced computer experience: Microsoft WordExcel, Internet search, Google trends.</li> <li>Intermediate musical experience with an exceptional ear.</li> </ul><ul><li>High school diploma required, preferred BA or BS degree from an accredited college or university. </li></ul><p>Supervisory Responsibilities:</p><p>This position does not directly supervise. <br></p><p>Essential Work &amp; Physical Requirements:<br></p><p>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. While performing the duties of this job, the employee is regularly required to talk and hear.</p><ul> <li>Available to work a minimum of 40 hours per week and a minimum of 5 days per week. </li> <li>Prolonged periods of sitting at a desk and working on a computer.</li> <li>Must be able to lift up to 15 pounds at times. </li> </ul> <p><br></p><p>Orfium is an Equal Opportunity Employer. </p>",
    "link": "https://apply.workable.com/orfium/j/D7CFCF5325"
},
{
    "id": 1384596,
    "title": "Assistant Music Copyright Lead",
    "company": "orfium",
    "department": "",
    "location": "Malibu",
    "description": "<p>Company Summary:</p><p>Orfium is a fast-growing music technology company representing some of the biggest record labels and music publishers in the world. We are looking for talented, hard working people to join our rights management team who are growth-minded and are passionate about music. Our office is located in Malibu, CA with a beautiful ocean view overlooking the Malibu Pier. Some of our clients include Sony/ATV, EMI, Warner Chappell, Red Bull, and more. </p><p><strong>Internal Applicants only! <br></strong></p><p>Duties/Responsibilities: </p><ul> <li>Support claimers company-wide if they have questions about claims or account specifics. </li> <li>Ensure claimer is aware of their daily responsibilities (creating video groups, updating revenue, filling out Claim Report at EOD). </li> <li>Delegate tasks and set deadlines for the team in order to maximize efficiency with the guidance of Team Lead. </li> <li>Communicate with Team Lead and team members daily and give feedback, whether that’s positive feedback or making a claimer aware that they need to improve performance</li> <li>Monitor productivity and effectiveness of each team member throughout the day to ensure they’re utilizing good time management skills every day. </li> <li>Checking direct reports claims daily, checking for mistakes, and using it as a resource to ensure claim follow-through.</li> <li>Provide strong lead generation for the team, and send claimable content daily, as resources to teach claimers how to find valuable claimable content autonomously especially if they are struggling.</li> <li>Work closely with Team Lead to gathers, analyze and report daily, weekly and monthly data from claimers to business unit leadership for maximum transparency and insight into performance.</li> <li>If a claimer is starting to show poor performance, communicate and work with them to see why that might be and how we can improve. </li> <li>Ensure claimers know how to utilize all available software and tools to maximize revenue.</li> <li>Foster a healthy, positive team environment where each person feels comfortable sharing concerns about their performance with the team lead and also sharing leads with the other claimers should they find one. </li> </ul><ul> <li>Support Team Leads as needed</li> <li>Perform other duties and responsibilities, as assigned.</li> </ul> <p><br></p>",
    "requirements": "<p>Qualifications:</p><ul> <li>Music Copyright experience a plus i.e. customer service, music instructor, supervisor</li> <li>Excellent time management skills with a proven ability to meet deadlines.</li> <li>Strong analytical and problem-solving skills</li> <li>Strong supervisory and leadership skills</li> <li>Ability to prioritize tasks and to delegate them when appropriate.</li> <li>Ability to function well in a high-paced and at times stressful environment.</li> <li>Stay up to date with guidelines set by Orfium, the clients and industry partners</li> <li>Advanced computer experience</li> <li>Excellent verbal and written communication skills; extremely detail-oriented</li> <li>Extensive musical experience with an exceptional ear</li> <li>Preferred BA or BS degree from an accredited college or university</li> </ul><p>Supervisory Responsibilities:</p><p>This position does indirectly supervise. </p><p>Essential Work &amp; Physical Requirements:</p><p>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. While performing the duties of this job, the employee is regularly required to talk and hear.</p><ul> <li>Available to work a minimum of 40 hours per week and a minimum of 5 days per week. </li> <li>Prolonged periods of sitting at a desk and working on a computer.</li> </ul><ul><li>Must be able to lift up to 15 pounds at times. </li></ul><p>Orfium is an Equal Opportunity Employer. </p><p><br></p>",
    "link": "https://apply.workable.com/orfium/j/0EFBCCC159"
},
{
    "id": 1556558,
    "title": "Mid Backend Software Engineer",
    "company": "orfium",
    "department": "",
    "location": "Athens",
    "description": "<h3>A few things about <a href=\"https://orfium.tech/\" rel=\"nofollow noreferrer noopener\" class=\"external\">Orfium</a> </h3><p>In Orfium we are building the digital future of the Music and Media Industry, by providing complete solutions to generate and manage their revenue, promote their content and analyze their business.</p><p>YouTube, Spotify, Apple, Netflix, and various other platforms have changed the experience of the audience. On our part, we are building the technology to find content in digital platforms, recognize it and match it with the catalogs of the owners. We are developing solutions based on Big Data, Machine Learning, and Business Intelligence to provide Enterprise services and complete SaaS solutions.</p><p>Orfium currently serves some of the biggest clients in Entertainment, as the leading Copyrights Management and Information Technology company. With our HQ in Malibu, CA and our R&amp;D department in Athens, Greece, we are able to serve the biggest markets while we innovate fast.</p><p>If you believe you can make a difference by joining one of the fastest-growing tech companies in the world, you should definitely apply!</p><p><br></p><p><strong>WHAT WE NEED</strong></p><p>We are looking for a Mid Django Backend Engineer to join our Greek branch in Koukaki, Attica.</p><p><strong>WHAT YOU'LL BE DOING</strong></p><p>You will be part of an Agile Team and will:</p><ul> <li>Maintain as well as build new features for our B2B products.</li> <li>Participate in team meetings and propose solutions.</li> <li>Code Review your collaborators' code(everyone does it).</li> <li>Properly document your work by both technical and/or business perspective.</li> </ul>",
    "requirements": "<p><strong>NEEDED SKILLS</strong><br></p><ul> <li>At least 2-3 years of working experience in creating and maintaining software systems in production environments.</li> <li>At least 1 year of working experience with Django or a modern Web Development Framework.</li> <li>Experience in Test-Driven Development (TDD).</li> <li>Hands-On  SQL  Experience(preferably with PostgreSQL).</li> <li>Ability to write organised and clean code.</li> <li>Good understanding of Version Control (preferably with Git).</li> <li>Understanding  of  Modern  System  Architectures,  Design  Patterns,  Data  Structures.</li> <li>Willingness to continuously learn and become better.</li> <li>Ability to work as part of a team.</li> <li>Excellent communication skills.</li> <li>Good written and verbal communication skills in English.</li> </ul><p><br></p><p><strong>EXTRA POINTS:</strong></p><ul> <li>Expertise in Django/Django REST Framework.</li> <li>Familiarity with AWS.</li> <li>Experience with ElasticSearch.</li> <li>Experience with consuming third-party APIs.</li> <li>Love for music.</li> </ul>",
    "link": "https://apply.workable.com/orfium/j/224F2B693A"
},
{
    "id": 1555973,
    "title": "Business Operations Administrator",
    "company": "orfium",
    "department": "Operations",
    "location": "Athens",
    "description": "<h3>A few things about <a href=\"https://orfium.tech/\" rel=\"nofollow noreferrer noopener\" class=\"external\">Orfium</a><br> </h3><p>In Orfium we are building the digital future of the Music and Media Industry, by providing complete solutions to generate and manage their revenue, promote their content and analyze their business.</p><p>YouTube, Spotify, Apple, Netflix, and various other platforms have changed the experience of the audience. On our part, we are building the technology to find content in digital platforms, recognize it and match it with the catalogs of the owners. We are developing solutions based on Big Data, Machine Learning, and Business Intelligence to provide Enterprise services and complete SaaS solutions.</p><p>Orfium currently serves some of the biggest clients in Entertainment, as the leading Copyrights Management and Information Technology company. With our HQ in Malibu, CA and our R&amp;D department in Athens, Greece, we are able to serve the biggest markets while we innovate fast.</p><p>If you believe you can make a difference by joining one of the fastest-growing tech companies in the world, you should definitely apply!</p><p><br></p><p>WHAT WE NEED</p><p>We are looking for a Business Operation Administrator to assist the Rights Management platform Product Team in daily data analysis and operational tasks needed for the servicing of Full Management client contracts and evolution of the product.</p><p><br></p><p><br></p><h3>What you will be doing</h3><ul> <li>Handle daily data mining (using custom queries) and reporting tasks related to full (client) Management contracts in coordination with the Rights Management platform Product Manager, Engineering and Business teams</li> <li>Handle daily and monthly operational tasks related to full (client) Management contracts, in coordination with the Operations and Business teams</li> <li>Perform bespoke data analysis to assist the Rights Management platform Product Manager and Engineering team</li> <li>Maintains good understanding of the Rights Management platform database model and YouTube reports data structures</li> <li>Assist the Data team in shared Rights Management platform - Data projects, by supplying knowledge of the product-specific data structures</li> <li>Analyze, interpret and monitor organizational and clients' recommendations based on administrative data</li> <li>Develop and provide high-level administrative, statistical, and management reports using standard and specialized software applications.</li> <li>Providing administrative support to other departments or projects as needed.</li> <li>Performing other duties as assigned.</li> </ul>",
    "requirements": "<ul><li>Degree in Business Administration, Business Analytics, IT or a related field preferred.</li></ul><ul> <li>2+ years of experience as an Operations Administrator or in a similar position.</li> <li>Strong organizational and administrative skills.</li> <li>Excellent communication skills in English, both written and verbal.</li> <li>Detail-oriented with strong analytical and problem-solving skills.</li> <li>Ability to multitask</li> <li>Basic scripting knowledge</li> <li>Very Good Knowledge of SQL (queries, exports from db, tools used- superset)  </li> <li>Experience with Jupyter notebook and pandas, or equivalent</li> <li>Familiar with AWS environment  (s3,ssh keys ingestions) </li> </ul><p>Desired skills:</p><ul><li>Proficiency in Microsoft Office, Google Suite and data management software.</li></ul><p><br></p>",
    "link": "https://apply.workable.com/orfium/j/310F72F953"
},
{
    "id": 1571208,
    "title": "Engineering Manager",
    "company": "orfium",
    "department": "",
    "location": "Athens",
    "description": "<p><strong>A few things about <a href=\"https://orfium.tech/\" rel=\"nofollow noreferrer noopener\" class=\"external\">Orfium</a></strong></p>  <p>In Orfium we are building the digital future of the Music and Media Industry, by providing complete solutions to generate and manage their revenue, promote their content and analyze their business.</p><p>YouTube, Spotify, Apple, Netflix, and various other platforms have changed the experience of the audience. On our part, we are building the technology to find content in digital platforms, recognize it and match it with the catalogs of the owners. We are developing solutions based on Big Data, Machine Learning, and Business Intelligence to provide Enterprise services and complete SaaS solutions.</p><p>Orfium currently serves some of the biggest clients in Entertainment, as the leading Copyrights Management and Information Technology company. With our HQ in Malibu, CA and our R&amp;D department in Athens, Greece, we are able to serve the biggest markets while we innovate fast.</p><p>If you believe you can make a difference by joining one of the fastest-growing tech companies in the world, you should definitely apply!</p><p><br></p><p><strong>WHAT WE NEED</strong></p><p>We are looking for an Engineering Manager to join our Greek branch in Koukaki, Athens (near the Syggrou Fix station).</p><p><br></p><p><strong>WHAT YOU'LL BE DOING</strong></p><p>You will be leading an agile engineering team and will:</p><ul> <li>Drive architecture design and technical discussions within the engineering team.</li> <li>Communicate with business, product, and operations departments.</li> <li>Work closely with the leadership of the engineering department and other tech leads to realize our vision of making Orfium the primary technology provider of the music industry.</li> <li>Ensure the delivery of the end product.</li> <li>Motivate &amp; coach team members while creating a nice atmosphere in the team.</li> <li>Improve the quality of the end product by leading code reviews, assuring code quality, and promoting best practices.</li> <li>Lead by example by contributing to the codebase yourself whenever possible.</li> <li>Be willing to learn more &amp; more about technology and engineering teams every day!</li> </ul>",
    "requirements": "<p><strong>NEEDED SKILLS</strong></p>  <ul> <li>At least 4 years of working experience in creating and maintaining software systems in production environments.</li> <li>At least 2 years of working experience either as a Backend or Frontend Web Development Framework (preferably with expertise in Django or ReactJS respectively).</li> <li>Excellent communication skills.</li> <li>Ability to design and enforce engineering processes.</li> <li>Deep understanding of Modern System Architectures, Design Patterns, Data Structures.</li> <li>Willingness to continuously learn and become better.</li> <li>Ability to lead an engineering team.</li> <li>Excellent communication skills.</li> <li>Excellent written and verbal communication skills in English.</li> </ul><p><strong>EXTRA POINTS:</strong></p>  <ul> <li>Previous experience in leading engineering teams.</li> <li>Experience with AWS.</li> <li>Experience with consuming third-party APIs.</li> <li>Embracing the DevOps culture.</li> <li>Love for music.</li> </ul>",
    "link": "https://apply.workable.com/orfium/j/DFF595D538"
},
{
    "id": 1792985,
    "title": "Business Intelligence Analyst",
    "company": "orfium",
    "department": "Data Team",
    "location": "Athens",
    "description": "<h3>A few things about <a href=\"https://orfium.tech/\" rel=\"nofollow noreferrer noopener\" class=\"external\">Orfium</a> </h3><p>In Orfium we are building the digital future of the Music and Media Industry, by providing complete solutions to generate and manage their revenue, promote their content and analyze their business.</p><p>YouTube, Spotify, Apple, Netflix, and various other platforms have changed the experience of the audience. On our part, we are building the technology to find content in digital platforms, recognize it and match it with the catalogs of the owners. We are developing solutions based on Big Data, Machine Learning, and Business Intelligence to provide Enterprise services and complete SaaS solutions.</p><p>Orfium currently serves some of the biggest clients in Entertainment, as the leading Copyrights Management and Information Technology company. With our HQ in Malibu, CA and our R&amp;D department in Athens, Greece, we are able to serve the biggest markets while we innovate fast.</p><p>If you believe you can make a difference by joining one of the fastest-growing tech companies in the world, you should definitely apply!</p><p><br></p><p><strong>WHAT WE NEED</strong><br></p><p>We are looking for a proactive BI Analyst with experience in analysing complex data sets and communicating value-adding information to enable decision-making across the business. You will be part of the BI, Finance team working closely with the international Finance department, including the CFO, to design, develop and maintain KPIs, end-user reporting, self-service dashboards, along with other ad-hoc analytics. If your passion is to apply your analytical skills to uncover financial insights and find solutions to business problems, then we want to learn more about you!</p>",
    "requirements": "<p><strong>Your Key Responsibilities will include:</strong> </p><ul> <li>Translate business needs to technical specifications.</li> <li>Turn large datasets into business insights and trends.</li> <li>Research, develop, and implement data-gathering methods.</li> <li>Facilitate workshops with cross-functional teams to define goals and KPIs.</li> <li>Explore and analyze financial statements to support strategic planning. </li> <li>Design, build, deploy and maintain intuitive dashboards.</li> <li>Bring creative ideas to the table to improve the performance of BI solutions.</li> </ul><p><br></p><p><strong>Qualifications:</strong></p><ul> <li>BSc in Computer Science, Mathematics, Statistics or related field from an accredited university.</li> <li>2-3 years of proven working experience in a data analysis role. </li> <li>Solid experience in scripting with SQL and designing ETL flows.</li> <li>Hands-on experience on at least one Data Visualization Tool, preferably Tableau.</li> <li>Interest in Financial Analysis, Ratios and Reporting.</li> <li>Good time management skills with a proven ability to meet deadlines.</li> <li>Ability to embrace new technologies, applications and solutions.</li> <li>Collaborative mindset with ability to contribute both independently and as part of a team.</li> <li>Structured way of thinking with attention to detail.</li> <li>Proven abilities to take initiative and be innovative.</li> </ul><p><strong>EXTRA POINTS:</strong></p><ul> <li>Hands-on experience on Python or R </li> <li>Knowledge of AWS and/or Snowflake</li> <li>Familiarity with Financial Statements </li> </ul><p></p>",
    "link": "https://apply.workable.com/orfium/j/11CD6245BB"
},
{
    "id": 1802255,
    "title": "General Counsel",
    "company": "orfium",
    "department": "",
    "location": "Malibu",
    "description": "<p><strong>Company Summary:</strong></p><p>Orfium is a fast-growing music technology company representing some of the biggest music companies in the world. We are looking for talented, hardworking people to join our rights management team who are passionate about protecting the value of music. Our office is located in Malibu, CA with a beautiful ocean view overlooking the Malibu Pier. Some of our clients include: Warner Music Group, Sony Music Group, Sony/ATV Music Publishing, Warner Chappell Music Publishing, Global Music Rights, Ingrooves, Red Bull, and many more.</p><p><strong>Position Summary:</strong> The General Counsel is responsible for leading, directing, and overseeing all legal matters relating to the company, which includes, all corporate governance, human resources, and commercial matters.</p><p><strong>Duties/Responsibilities: </strong></p><ul> <li>Lead, direct, and oversee all legal matters relating to the company.</li> <li>Structuring, negotiating, documenting and managing of the Company’s commercial activities.</li> <li>Collaborate with the business team on commercial endeavors.</li> <li>Develop and manage internal governance policies and procedures.</li> <li>Manage legal compliance and statutory filings for the company.</li> <li>Manage the company’s employee compensation plan.</li> <li>Liaison with outside counsel regarding their assignments.</li> <li>Create new entities and manage the organization's intellectual property.</li> <li>Maintain knowledge of organization’s commercial and legal documents.</li> <li>Preserve all corporate records.</li> <li>Lead, guide, direct, and evaluate the work of other employees, such as Senior Directors and Managers, and ensure a healthy working environment.</li> <li>Examine and create draft agreements as needed.</li> <li>Perform other duties and responsibilities, as assigned.</li> </ul>",
    "requirements": "<p><strong>Qualifications:</strong></p><ul> <li>10+ years of practice with an established law firm or company preferred.</li> <li>Legal experience in venture capital financing and M&amp;A preferred.</li> <li>Experience in working with international organizations and in a multicultural environment. </li> <li>Experience with corporate governance issues and corporate secretarial duties.</li> <li>Excellent verbal and written communication skills.</li> <li>Knowledge of statutes, rules, and regulations pertaining to businesses.</li> <li>Proficient understanding of business sensitivities and confidentiality.</li> <li>Excellent time management skills with a proven ability to meet deadlines.</li> <li>Strong analytical and problem-solving skills.</li> <li>Strong supervisory and leadership skills.</li> <li>Ability to prioritize tasks and delegate them when appropriate.</li> <li>Ability to function well in a high-paced and at times stressful environment.</li> <li>Excellent verbal and written communication skills; extremely detail-oriented.</li> <li>Juris Doctor degree from accredited, top-tier law school.</li> </ul><p>Supervisory Responsibilities:</p><p>This position does directly supervise.</p><p>Essential Work &amp; Physical Requirements:</p><p>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. While performing the duties of this job, the employee is regularly required to talk and hear.</p><ul> <li>Available to work a minimum of 40 hours per week and a minimum of 5 days per week. </li> <li>Prolonged periods of sitting at a desk and working on a computer.</li> </ul><ul><li>Must be able to lift up to 15 pounds at times. </li></ul> <p><em>Orfium is an Equal Opportunity Employer</em></p>",
    "link": "https://apply.workable.com/orfium/j/7F4B4B611B"
},
{
    "id": 1791960,
    "title": "Senior Product Manager",
    "company": "orfium",
    "department": "Product",
    "location": "Athens",
    "description": "<h3>A few things about <a href=\"https://orfium.tech/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Orfium</a> </h3><p>In Orfium we are building the digital future of the Music and Media Industry, by providing complete solutions to generate and manage revenue, promote content, and provide business insights.</p><p>YouTube, Spotify, Apple, Netflix, and various other platforms have changed the media experience. On our part, we are building the technology to find content on digital platforms, recognize it, and match it with the catalogs of the owners. We are developing solutions based on Big Data, Machine Learning, and Business Intelligence to provide Enterprise services and build complete SaaS solutions.</p><p>Orfium currently serves some of the biggest clients in Entertainment, as the leading Copyrights Management and Information Technology company. With our HQ in Malibu, CA, and our R&amp;D department in Athens, Greece, we are able to serve the biggest markets while we innovate fast on technological and business levels.</p><p>If you believe you can make a difference by joining one of the fastest-growing tech companies in Greece, you should definitely apply!</p><p><br></p><p>WHAT WE ARE LOOKING FOR</p><p>A skillful and passionate Senior Product Manager that will manage two of our main B2B products that focus on centralizing music usage in various formats and music industry standards, provided by various media platforms, digital service providers, and other licensees. The other aspect of these products is the matching process of this music usage against a defined dataset (repertoire) by utilizing machine learning algorithms based on complicated metadata matching procedures. </p><p>We are looking for a candidate with a good understanding of enterprise software, a data-driven mindset, and the management of a product lifecycle.</p><p>The ideal candidate will have a startup mindset along with analytical thinking skills and will be willing to take initiatives and execute the product strategy effectively and report back with ideas that will improve our Product Suite and Operations.</p><p><br></p><p>WHAT YOU'LL BE DOING</p><p>You will be a part of a Design-driven, Agile Product Team and will:</p><ul> <li>Drive a multi-disciplinary team of engineers to solve big problems in the music industry with Big Data and AI characteristics.</li> <li>Work along with the Unit Director of Products for high-level requirements</li> <li>Collaborate with the Product and Design Team to build and deliver a Product Roadmap</li> <li>Analyze business requirements and prioritize tickets for the relevant teams</li> <li>Incorporate feedback from customers and business into the product strategy</li> <li>Develop a long-term vision and strategy for your products</li> <li>Monitor the performance of products</li> <li>Deep dive into the music industry standards </li> <li>Collaborate with Tech Leaders in order to achieve deadlines and deliver products efficiently</li> <li>Align with the Operations department in order to locate any possible issues and deficiencies</li> <li>Explore opportunities for new products, new business models and prepare the roadmap for new versions of existing products</li> </ul>",
    "requirements": "<p>NEEDED SKILLS</p><ul> <li>Proven experience as a product manager or product owner</li> <li>Proven knowledge of Agile methodologies</li> <li>Passion for innovation and impact</li> <li>Good design perception</li> <li>Strong written and verbal Greek and English communication skills</li> </ul><p><br></p><p>EXTRA POINTS:</p><ul> <li>Love for music!</li> <li>Agile certifications</li> <li>An academic background in computer science, or proven programming skills</li> <li>Previous experience in a startup company</li> <li>Familiarity with Programming Languages and Frameworks (Python, Django framework, React Framework, and more)</li> <li>Experience in Big Data, Analytics, or Payment projects or products</li> <li>MBA or Master in Business</li> </ul>",
    "link": "https://apply.workable.com/orfium/j/2F5A04E759"
},
{
    "id": 1811500,
    "title": "Senior Accountant",
    "company": "orfium",
    "department": "",
    "location": "Malibu",
    "description": "<p><strong>Company Summary:</strong></p><p>Orfium is a fast-growing music technology company representing some of the largest music companies in the world. We are looking for talented, hardworking people to join our rights management team who are passionate about protecting the value of music. Our office is located in Malibu, CA with a beautiful ocean view overlooking the Malibu Pier. Some of our clients include: Warner Music Group, Sony Music Group, Sony/ATV Music Publishing, Warner Chappell Music Publishing, Global Music Rights, Ingrooves, Red Bull, and many more. </p><p><strong>Position Summary:</strong> The Senior Accountant is responsible for maintaining the general ledger, managing the accounts payable function, and processing payroll.  This role also works closely with the Accounting Manager to support monthly, quarterly, half year, and year-end financial close and the preparation of financial reports as requested by management.</p><p><strong>Duties/Responsibilities: </strong></p><ul> <li>Manage all activities in the accounts payable function including the invoice approval process, timely payment of vendor invoices, and accurate posting of transactions from the bank feed and credit cards.</li> <li>Maintain accurate records over the general ledger including monthly bank, credit card and account reconciliations to identify and correct any errors.</li> <li>Process payroll and invoices in HRIS for all employees and contractors.</li> <li>Assist in the onboarding of new employees and contractors.</li> <li>Compile, analyze and report financial information to management and government agencies.</li> <li>Develop, implement and maintain systems, policies, and procedures within the accounts payable function to ensure adherence to company guidelines, department budgets, and internal controls.</li> <li>Provide accounting assistance to project managers and operations staff; respond to financial questions/concerns to meet business needs.</li> <li>Support timely monthly, quarterly, half-year, and year-end financial close and preparation of financial statements, including journal entries, account reconciliations, accruals, and overall maintenance of all operational management accounts.</li> <li>Prepare financial reports as requested by management by collecting, analyzing, and summarizing account information and trends primarily within Accounts Payable.</li> <li>Maintain vendor records and perform 1099 filings on an annual basis.</li> <li>Develop processes to increase efficiency and accuracy.</li> <li>Assist with audits and tax returns.</li> <li>Perform other duties and responsibilities, as assigned.</li> </ul>",
    "requirements": "<p><strong>Qualifications:</strong></p><ul> <li>Bachelor’s or master’s degree in accounting, finance or related major.</li> <li>Minimum 2 years of accounting experience (experience in public accounting preferred).</li> <li>Advanced MS Excel skills including, but not limited to Vlookups and pivot tables.</li> <li>CPA is preferred.</li> <li>In-depth understanding of GAAP, financial reporting, corporate finance principles and accounts payable procedures.</li> <li>Experience with QuickBooks, Sage Intacct, Expensify, and Adaptive Planning or similar systems.</li> <li>Excellent verbal and written communication skills; extremely detail-oriented.</li> <li>Commitment to ethical behavior.</li> <li>Excellent time management skills with a proven ability to meet deadlines.</li> <li>Strong analytical, multitasking, and problem-solving skills.</li> <li>Ability to analyze information and processes.</li> <li>Ability to function well in a high-paced and at times stressful environment.</li> <li>Stay up to date with guidelines set by Orfium, the clients and industry partners.</li> <li>Experience in the entertainment industry with knowledge of accounting for royalties is a plus.</li> <li>Knowledge of computer programming languages (i.e. Python, VBA) also a plus.</li> </ul> <p><strong>Supervisory Responsibilities:</strong></p><p>This position does not supervise. </p> <p><strong>Essential Work &amp; Physical Requirements:</strong></p><p>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. While performing the duties of this job, the employee is regularly required to talk and hear.</p><ul> <li>Available to work a minimum of 40 hours per week and a minimum of 5 days per week. </li> <li>Prolonged periods of sitting at a desk and working on a computer.</li> </ul><ul><li>Must be able to lift up to 15 pounds at times. </li></ul><p>Orfium is an Equal Opportunity Employer. </p>",
    "link": "https://apply.workable.com/orfium/j/873F7C9562"
},
{
    "id": 1676503,
    "title": "Product Manager",
    "company": "orfium",
    "department": "Product",
    "location": "Athens",
    "description": "<h3>A few things about <a href=\"https://orfium.tech/\" rel=\"nofollow noreferrer noopener\" class=\"external\">Orfium</a> </h3><p>In Orfium we are building the digital future of the Music and Media Industry, by providing complete solutions to generate and manage revenue, promote content, and provide business insights.</p><p>YouTube, Spotify, Apple, Netflix, and various other platforms have changed the experience of the audience. On our part, we are building the technology to find content on digital platforms, recognize it, and match it with the catalogs of the owners. We are developing solutions based on Big Data, Machine Learning, and Business Intelligence to provide Enterprise services and complete SaaS solutions.</p><p>Orfium currently serves some of the biggest clients in Entertainment, as the leading Copyrights Management and Information Technology company. With our HQ in Malibu, CA, and our R&amp;D department in Athens, Greece, we are able to serve the biggest markets while we innovate fast.</p><p>If you believe you can make a difference by joining one of the fastest-growing tech companies in the world, you should definitely apply!</p><p><br></p><p>WHAT WE ARE LOOKING FOR</p><p>A skillful and passionate Product Manager that will manage one of our main B2B products for delivering value on YouTube. That means that we need a good understanding of the enterprise software, a data-driven mindset, and the management of a product lifecycle.</p><p>The ideal candidate will have a startup mindset along with analytical thinking skills and will be willing to take initiatives and execute the product strategy effectively and report back with ideas that will improve our Product Suite and Operations.</p><p><br></p><p>WHAT YOU'LL BE DOING</p><p>You will be a part of a Design-driven, Agile Product Team and will:</p><ul> <li>Drive a multi-disciplinary team of engineers to solve big problems in the music industry with Big Data and AI characteristics. </li> <li>Analyze business requirements and prioritize tickets for the relevant teams</li> <li>Monitor the performance of products</li> <li>Collaborate with the Product Management and Design Team to build a Product Roadmap.</li> <li>Collaborate with Tech Leaders in order to achieve deadlines and deliver products efficiently </li> <li>Align with the Operations department in order to locate any possible issues and deficiencies for B2B products</li> <li>Design and run experiments</li> <li>Explore opportunities for new products, new business models and prepare the roadmap for new versions of existing products</li> </ul>",
    "requirements": "<p>NEEDED SKILLS<br></p><ul> <li>Proven experience as a product manager or product owner</li> <li>Proven knowledge of Agile methodologies</li> <li>Passion for innovation and impact</li> <li>Good design perception</li> <li>Strong written and verbal Greek and English communication skills</li> </ul><p>EXTRA POINTS:</p><ul> <li>Love for music!</li> <li>Agile certifications</li> <li>An academic background in computer science, or proven programming skills</li> <li>Previous experience in a startup company</li> <li>Familiarity with Programming Languages and Frameworks (Python, Django framework, React Framework, and more)</li> <li>Experience in Big Data, Analytics or Payment projects or products</li> <li>MBA or Master in Business</li> </ul>",
    "link": "https://apply.workable.com/orfium/j/54B2E15690"
}
]