[
{
    "id": 1555922,
    "title": "Front-end Developer : ReactJS",
    "company": "orfium",
    "department": "",
    "location": "Athens",
    "description": "<h3>A few things about <a href=\"https://orfium.tech/\" rel=\"nofollow noreferrer noopener\" class=\"external\">Orfium</a><br> </h3><p>In Orfium we are building the digital future of the Music and Media Industry, by providing complete solutions to generate and manage their revenue, promote their content and analyze their business.</p><p>YouTube, Spotify, Apple, Netflix, and various other platforms have changed the experience of the audience. On our part, we are building the technology to find content in digital platforms, recognize it and match it with the catalogs of the owners. We are developing solutions based on Big Data, Machine Learning, and Business Intelligence to provide Enterprise services and complete SaaS solutions.</p><p>Orfium currently serves some of the biggest clients in Entertainment, as the leading Copyrights Management and Information Technology company. With our HQ in Malibu, CA and our R&amp;D department in Athens, Greece, we are able to serve the biggest markets while we innovate fast.</p><p>If you believe you can make a difference by joining one of the fastest-growing tech companies in the world, you should definitely apply!</p>",
    "requirements": "<p><strong>WHAT WE NEED</strong></p><p>We are looking for a React Front-End Developer to join our Greek branch in Koukaki, Attica.</p><p><br></p><p><strong>WHAT YOU'LL BE DOING</strong></p><p>This developer will:</p><ul> <li>Collaborate with the team that is responsible for our B2Β platforms and will contribute to new versions, written entirely in React.</li> <li>Closely cooperate with our Designers in order to add new features to the platform.</li> <li>Be involved in the user experience process, from wireframes and mockups, to testing and release.</li> <li>Suggest - in coordination with our designers &amp; product manager - elegant solutions to interesting problems.</li> <li>Contribute to the creation of a UI library and other JS tools, that our Front-End team will use across different products.</li> <li>Help define and maintain the visual guidelines, ensuring cross-app consistency.</li> </ul><p><strong>     NEEDED SKILLS<br></strong></p><ul> <li>At least 2-3 years of experience in Front-End programming.</li> <li>Deep understanding of Javascript as a language.</li> <li>Deep exposure to ReactJS, Redux and Webpack.</li> <li>Hands-on experience on apps with a modern stack (ES6, Flexbox, CSS Modules etc.)</li> <li>Ability to write organised and clean code</li> <li>Good understanding of Version Control (preferably with Git)</li> <li>Willingness to continuously learn and become better</li> <li>Experience collaborating on software projects with a decoupled Front-end &amp; Back-end handled by different teams. </li> <li>Ability to work as part of a team</li> <li>Excellent communication skills</li> <li>Good written and verbal communication skills in English</li> </ul><ul> <li>EXTRA POINTS:<ul> <li>Experience with React in a production environment</li> <li>A nice Github account, with interesting projects or contributions</li> <li>Good debugging skills (Chrome DevTools)</li> <li>Sense of Humour</li> </ul> </li> </ul>",
    "link": "https://apply.workable.com/orfium/j/0BB9BD268F"
},
{
    "id": 1571222,
    "title": "QA Engineer",
    "company": "orfium",
    "department": "QA",
    "location": "Athens",
    "description": "<h3>A few things about <a href=\"https://orfium.tech/\" rel=\"nofollow noreferrer noopener\" class=\"external\">Orfium</a><br> </h3><h3></h3><p>In Orfium we are building the digital future of the Music and Media Industry, by providing complete solutions to generate and manage their revenue, promote their content and analyze their business.</p><p>YouTube, Spotify, Apple, Netflix, and various other platforms have changed the experience of the audience. On our part, we are building the technology to find content in digital platforms, recognize it and match it with the catalogs of the owners. We are developing solutions based on Big Data, Machine Learning, and Business Intelligence to provide Enterprise services and complete SaaS solutions.</p><p>Orfium currently serves some of the biggest clients in Entertainment, as the leading Copyrights Management and Information Technology company. With our HQ in Malibu, CA and our R&amp;D department in Athens, Greece, we are able to serve the biggest markets while we innovate fast.</p><p>If you believe you can make a difference by joining one of the fastest-growing tech companies in the world, you should definitely apply!</p><h3><br></h3><h3>What we need</h3><p>We are looking for a proactive and passionate QA Engineer to join our team in Athens, Greece.</p><p>You will be part of a fast-growth quality assurance team and will:</p><ul> <li>Collaborate across all departments and more closely with the Product Development team to ensure consistent project execution</li> <li>Review requirements, specifications, and technical design documents to provide timely and meaningful feedback</li> <li>Design and execute manual and automated test suites</li> <li>Develop and maintain end-to-end automation scripts</li> <li>Test the backend infrastructure (API &amp; Databases)</li> <li>Validate data against requirements from different sources (report sheets, APIs, etc)</li> <li>Create detailed, comprehensive, and well-structured test plans and test cases</li> </ul>",
    "requirements": "<p>Needed skills</p><ul> <li>2+ years of experience in the Software Industry (preferably in Testing)</li> <li>BSc/BA in Computer Science, Engineering or relevant field</li> <li>Strong knowledge of software QA methodologies, tools and processes</li> <li>Excellent analytical and problem-solving skills, with attention to details</li> <li>Hands-on experience with automated testing tools (Backend &amp; End-to-end)</li> <li>Data validation skills</li> </ul><p><br></p><p>Considered a plus</p><ul> <li>Coding knowledge (preferably Python)</li> <li>Selenium webdriver experience.</li> <li>API testing tools knowledge (Postman)</li> <li>Database querying (SQL)</li> <li>ISTQB certification</li> <li>Knowledge of Agile development processes and scrum roles and responsibilities</li> </ul><p><br></p><p>What we offer:</p><p><br></p><ul> <li>Exposure to new tools and technologies</li> <li>A chance to develop your automation skills</li> </ul>",
    "link": "https://apply.workable.com/orfium/j/3DC9788C5A"
},
{
    "id": 1352598,
    "title": "Music Copyrights Specialist I",
    "company": "orfium",
    "department": "",
    "location": "Malibu",
    "description": "<p><strong>Company Summary:</strong></p><p>Orfium is a fast-growing music technology company representing some of the biggest music companies in the world. We are looking for talented, hardworking people to join our rights management team who are passionate about protecting the value of music. Our office is located in Malibu, CA with a beautiful ocean view overlooking the Malibu Pier. Some of our clients include: Warner Music Group, Sony Music Group, Sony/ATV Music Publishing, Warner Chappell Music Publishing, Global Music Rights, Ingrooves, Red Bull, and many more.</p><p><strong>Position Summary: </strong>The Music Copyrights Specialist is responsible for identifying and claiming videos that indicate copyright music/infringement through Youtube’s content management system (CMS). This role requires the analysis of music and revenue data as well staying up to date with industry trends in entertainment. This is a entry-level professional with limited prior experience, but can learn to use professional concepts to resolve problems of limited scope and complexity.</p><p><br></p>",
    "requirements": "<p><strong>Duties/Responsibilities:</strong><br></p><ul> <li>Employees are expected to acquire the skills and knowledge necessary to perform work necessary for the role through defined training and development planning. </li> <li>Analyze music on a harmonic, melodic, lyrical, and sonic level. </li> <li>Extreme attention to detail, data-driven, excellent communication skills, and a self-starter.</li> <li>Identify and claim videos using copyrighted music through YouTube’s content management system.</li> <li>Support the policing of piracy and copyright infringement by monitoring the unauthorized exploitation of our clients’ copyrights. </li> <li>Remain up to date with industry topics and music. </li> <li>Collect and analyze revenue data to discover valuable content for our clients. </li> <li>Other duties that may be assigned to help the company meet goals.</li> <li>Growth opportunities within this role based on performance    </li> <li>Employees should perform at a minimum, milestone 1 for a minimum of 12 months from date of hire as designated by their manager. </li> <li>Perform other duties and responsibilities, as assigned.</li> </ul><p><strong>Qualifications:</strong></p><ul> <li>Excellent verbal and written communication skills; extremely detail-oriented.</li> <li>Exhibits professional demeanor and sound judgment.</li> <li>Follows up on delegated assignments through completion.</li> <li>Self-starter, who takes initiative and is resourceful; takes ownership of tasks and projects.</li> <li>Ability to adjust to changes of the industry, new guidelines made either internally or by our clients</li> <li>Ability to multitask and prioritize; works well under pressure.</li> <li>Ability to work autonomously and collaboratively.</li> <li>Excellent typing and computer skills, including in Word, Excel, Outlook.</li> </ul><ul> <li>Advanced computer experience: Microsoft WordExcel, Internet search, Google trends.</li> <li>Intermediate musical experience with an exceptional ear.</li> </ul><ul><li>High school diploma required, preferred BA or BS degree from an accredited college or university. </li></ul><p>Supervisory Responsibilities:</p><p>This position does not directly supervise. <br></p><p>Essential Work &amp; Physical Requirements:<br></p><p>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. While performing the duties of this job, the employee is regularly required to talk and hear.</p><ul> <li>Available to work a minimum of 40 hours per week and a minimum of 5 days per week. </li> <li>Prolonged periods of sitting at a desk and working on a computer.</li> <li>Must be able to lift up to 15 pounds at times. </li> </ul> <p><br></p><p>Orfium is an Equal Opportunity Employer. </p>",
    "link": "https://apply.workable.com/orfium/j/D7CFCF5325"
},
{
    "id": 1384596,
    "title": "Assistant Team Lead",
    "company": "orfium",
    "department": "",
    "location": "Malibu",
    "description": "<p>Company Summary:</p><p>Orfium is a fast-growing music technology company representing some of the biggest record labels and music publishers in the world. We are looking for talented, hard working people to join our rights management team who are growth-minded and are passionate about music. Our office is located in Malibu, CA with a beautiful ocean view overlooking the Malibu Pier. Some of our clients include Sony/ATV, EMI, Warner Chappell, Red Bull, and more. </p><p><strong>Internal Applicants only! <br></strong></p><p>Duties/Responsibilities: </p><ul> <li>Support claimers company-wide if they have questions about claims or account specifics. </li> <li>Ensure claimer is aware of their daily responsibilities (creating video groups, updating revenue, filling out Claim Report at EOD). </li> <li>Delegate tasks and set deadlines for the team in order to maximize efficiency with the guidance of Team Lead. </li> <li>Communicate with Team Lead and team members daily and give feedback, whether that’s positive feedback or making a claimer aware that they need to improve performance</li> <li>Monitor productivity and effectiveness of each team member throughout the day to ensure they’re utilizing good time management skills every day. </li> <li>Checking direct reports claims daily, checking for mistakes, and using it as a resource to ensure claim follow-through.</li> <li>Provide strong lead generation for the team, and send claimable content daily, as resources to teach claimers how to find valuable claimable content autonomously especially if they are struggling.</li> <li>Work closely with Team Lead to gathers, analyze and report daily, weekly and monthly data from claimers to business unit leadership for maximum transparency and insight into performance.</li> <li>If a claimer is starting to show poor performance, communicate and work with them to see why that might be and how we can improve. </li> <li>Ensure claimers know how to utilize all available software and tools to maximize revenue.</li> <li>Foster a healthy, positive team environment where each person feels comfortable sharing concerns about their performance with the team lead and also sharing leads with the other claimers should they find one. </li> </ul><ul> <li>Support Team Leads as needed</li> <li>Perform other duties and responsibilities, as assigned.</li> </ul> <p><br></p>",
    "requirements": "<p>Qualifications:</p><ul> <li>Music Copyright experience a plus i.e. customer service, music instructor, supervisor</li> <li>Excellent time management skills with a proven ability to meet deadlines.</li> <li>Strong analytical and problem-solving skills</li> <li>Strong supervisory and leadership skills</li> <li>Ability to prioritize tasks and to delegate them when appropriate.</li> <li>Ability to function well in a high-paced and at times stressful environment.</li> <li>Stay up to date with guidelines set by Orfium, the clients and industry partners</li> <li>Advanced computer experience</li> <li>Excellent verbal and written communication skills; extremely detail-oriented</li> <li>Extensive musical experience with an exceptional ear</li> <li>Preferred BA or BS degree from an accredited college or university</li> </ul><p>Supervisory Responsibilities:</p><p>This position does indirectly supervise. </p><p>Essential Work &amp; Physical Requirements:</p><p>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. While performing the duties of this job, the employee is regularly required to talk and hear.</p><ul> <li>Available to work a minimum of 40 hours per week and a minimum of 5 days per week. </li> <li>Prolonged periods of sitting at a desk and working on a computer.</li> </ul><ul><li>Must be able to lift up to 15 pounds at times. </li></ul><p>Orfium is an Equal Opportunity Employer. </p><p><br></p>",
    "link": "https://apply.workable.com/orfium/j/0EFBCCC159"
},
{
    "id": 1525198,
    "title": "Big Data Engineer",
    "company": "orfium",
    "department": "Data Team",
    "location": "Athens",
    "description": "<h3>A few things about <a href=\"https://orfium.tech/\" rel=\"nofollow noreferrer noopener\" class=\"external\">Orfium</a><br> </h3><p>In Orfium we are building the digital future of the Music and Media Industry, by providing complete solutions to generate and manage their revenue, promote their content and analyze their business.</p><p>YouTube, Spotify, Apple, Netflix, and various other platforms have changed the experience of the audience. On our part, we are building the technology to find content in digital platforms, recognize it and match it with the catalogs of the owners. We are developing solutions based on Big Data, Machine Learning, and Business Intelligence to provide Enterprise services and complete SaaS solutions.</p><p>Orfium currently serves some of the biggest clients in Entertainment, as the leading Copyrights Management and Information Technology company. With our HQ in Malibu, CA and our R&amp;D department in Athens, Greece, we are able to serve the biggest markets while we innovate fast.</p><p>If you believe you can make a difference by joining one of the fastest-growing tech companies in the world, you should definitely apply!</p><p><br></p><p><strong>WHAT WE NEED</strong></p><p>Do you love Big Data &amp; Engineering within the AWS environment using Python, Athena &amp; Presto? We are currently looking for a passionate and experienced Big Data Engineer to design and develop data-driven solutions.</p><p></p><p>You ‘get’ Big Data and Cloud computing and you have experience in handling vast amounts of data – working on database design and development, data integration and ingestion, designing ETL architectures using a variety of ETL tools and techniques.</p><p><br><br></p><h3><strong>What you will be doing</strong></h3><ul> <li>Big Data processing using NoSQL databases</li> <li>Deploying data mining and implementing various machine learning (ML) models</li> <li>Delivering data modeling and ETL practices</li> <li>Architecting the infrastructure for Big Data lakes</li> <li>Delivering data modeling and ETL practices</li> <li>Deploying and maintaining Business Intelligence (BI) systems</li> <li>Design, construction, tests, maintenance and optimization of cloud infrastructure for running large-scale data processing systems</li> <li>Assistance to Data Scientists in implementing various ML models in order to allow the AI to process the data and discover hidden patterns and anomalies.</li> <li>Deployment of various algorithms for normalization of disparate data to leverage various types of Big Data analytics</li> </ul>",
    "requirements": "<h3><strong>NEEDED SKILLS<br></strong></h3><h3><br></h3><ul> <li>Bachelor's degree in computer science, engineering, mathematics, or a related technical discipline</li> <li>5+ years of experience building and operating systems of data extraction, ingestion, and processing of large data sets</li> <li>Solid experience with tools in the larger Python ecosystem (Pandas, Numpy, Jupyter etc.)</li> <li>Ability to deliver on ambiguous projects with incomplete and/or dirty data</li> </ul>        <ul> <li>Demonstrated strength in data modelling, ETL development, and data warehousing</li> <li>Knowledge of data management fundamentals and data storage principles</li> <li>Familiarity with statistical models and/or data mining algorithms and practical experience of applying these to business problems</li> <li>Fluency in English &amp; Greek</li> </ul><p><br></p><p><br></p><p>The aforementioned skills and responsibilities require working with Big Data tools, languages and databases like Hadoop, MongoDB, Redis, Cassandra, Spark, Python, R, and others. Big Data Engineer works with so-called data lakes, namely huge storages and incoming streams of unstructured data.</p><p>The system architecture is flat, meaning all the images, texts and documents along with the other types of data are stored without any hierarchy to enable swift normalization. This ensures easy adaptation to any requirements of highly configurable machine learning algorithms.</p>",
    "link": "https://apply.workable.com/orfium/j/99E5620CFF"
},
{
    "id": 1556558,
    "title": "Mid Backend Software Engineer",
    "company": "orfium",
    "department": "",
    "location": "Athens",
    "description": "<h3>A few things about <a href=\"https://orfium.tech/\" rel=\"nofollow noreferrer noopener\" class=\"external\">Orfium</a> </h3><p>In Orfium we are building the digital future of the Music and Media Industry, by providing complete solutions to generate and manage their revenue, promote their content and analyze their business.</p><p>YouTube, Spotify, Apple, Netflix, and various other platforms have changed the experience of the audience. On our part, we are building the technology to find content in digital platforms, recognize it and match it with the catalogs of the owners. We are developing solutions based on Big Data, Machine Learning, and Business Intelligence to provide Enterprise services and complete SaaS solutions.</p><p>Orfium currently serves some of the biggest clients in Entertainment, as the leading Copyrights Management and Information Technology company. With our HQ in Malibu, CA and our R&amp;D department in Athens, Greece, we are able to serve the biggest markets while we innovate fast.</p><p>If you believe you can make a difference by joining one of the fastest-growing tech companies in the world, you should definitely apply!</p><p><br></p><p><strong>WHAT WE NEED</strong></p><p>We are looking for a Mid Django Backend Engineer to join our Greek branch in Koukaki, Attica.</p><p><strong>WHAT YOU'LL BE DOING</strong></p><p>You will be part of an Agile Team and will:</p><ul> <li>Maintain as well as build new features for our B2B products.</li> <li>Participate in team meetings and propose solutions.</li> <li>Code Review your collaborators' code(everyone does it).</li> <li>Properly document your work by both technical and/or business perspective.</li> </ul>",
    "requirements": "<p><strong>NEEDED SKILLS</strong><br></p><ul> <li>At least 2-3 years of working experience in creating and maintaining software systems in production environments.</li> <li>At least 1 year of working experience with Django or a modern Web Development Framework.</li> <li>Experience in Test-Driven Development (TDD).</li> <li>Hands-On  SQL  Experience(preferably with PostgreSQL).</li> <li>Ability to write organised and clean code.</li> <li>Good understanding of Version Control (preferably with Git).</li> <li>Understanding  of  Modern  System  Architectures,  Design  Patterns,  Data  Structures.</li> <li>Willingness to continuously learn and become better.</li> <li>Ability to work as part of a team.</li> <li>Excellent communication skills.</li> <li>Good written and verbal communication skills in English.</li> </ul><p><br></p><p><strong>EXTRA POINTS:</strong></p><ul> <li>Expertise in Django/Django REST Framework.</li> <li>Familiarity with AWS.</li> <li>Experience with ElasticSearch.</li> <li>Experience with consuming third-party APIs.</li> <li>Love for music.</li> </ul>",
    "link": "https://apply.workable.com/orfium/j/224F2B693A"
},
{
    "id": 1564623,
    "title": "Music Copyrights Specialist I - Nevada Applicants Only",
    "company": "orfium",
    "department": "",
    "location": "Reno",
    "description": "<p>Company Summary:</p><p>Orfium is a fast-growing music technology company representing some of the biggest music companies in the world. We are looking for talented, hardworking people to join our rights management team who are passionate about protecting the value of music. Our office is located in Malibu, CA with a beautiful ocean view overlooking the Malibu Pier. Some of our clients include: Warner Music Group, Sony Music Group, Sony/ATV Music Publishing, Warner Chappell Music Publishing, Global Music Rights, Ingrooves, Red Bull, and many more. </p> <p>Position Summary: The Music Copyrights Specialist is responsible for identifying and claiming videos that indicate copyright music/infringement through Youtube’s content management system (CMS). This role requires the analysis of music and revenue data as well as staying up to date with industry trends in entertainment. This is an advanced professional with a high degree of knowledge in the overall field and recognized expertise in specific areas; problem‐solving frequently requires analysis of unique issues/problems without precedent and/or structure.</p><p><br></p><h3>                                                This position is only open to Nevada residents only<br> </h3><p><br></p><p>Duties/Responsibilities:</p><ul> <li>Employees are expected to acquire the skills and knowledge necessary to perform work necessary for the role through defined training and development planning. </li> <li>Analyze music on a harmonic, melodic, lyrical, and sonic level. </li> <li>Extreme attention to detail, data-driven, excellent communication skills, and a self-starter.</li> <li>Identify and claim videos using copyrighted music through YouTube’s content management system.</li> <li>Support the policing of piracy and copyright infringement by monitoring the unauthorized exploitation of our clients’ copyrights. </li> <li>Remain up to date with industry topics and music. </li> <li>Collect and analyze revenue data to discover valuable content for our clients. </li> <li>Other duties that may be assigned to help the company meet goals.</li> <li>Growth opportunities within this role based on performance    </li> <li>Employees should perform at a minimum, milestone 4 for a minimum of 12 months from the date of hire as designated by their manager. </li> <li>Perform other duties and responsibilities, as assigned.</li> </ul>",
    "requirements": "<p>Qualifications:</p><ul> <li>Excellent verbal and written communication skills; extremely detail-oriented.</li> <li>Exhibits professional demeanor and sound judgment.</li> <li>Follows up on delegated assignments through completion.</li> <li>Self-starter, who takes initiative and is resourceful; takes ownership of tasks and projects.</li> <li>Ability to adjust to changes of the industry, new guidelines made either internally or by our clients</li> <li>Ability to multitask and prioritize; works well under pressure.</li> <li>Ability to work autonomously and collaboratively.</li> <li>Excellent typing and computer skills, including in Word, Excel, Outlook.</li> </ul><ul> <li>Advanced computer experience: Microsoft WordExcel, Internet search, Google trends.</li> <li>Intermediate musical experience with an exceptional ear.</li> </ul><ul><li>High school diploma required, preferred BA or BS degree from an accredited college or university. <br> </li></ul><p>Supervisory Responsibilities:</p><p>This position does not directly supervise. </p><p><br></p> <p>Essential Work &amp; Physical Requirements:</p><p>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. While performing the duties of this job, the employee is regularly required to talk and hear.</p><ul> <li>Available to work a minimum of 40 hours per week and a minimum of 5 days per week. </li> <li>Prolonged periods of sitting at a desk and working on a computer.</li> <li>Must be able to lift up to 15 pounds at times. </li> </ul> <p>Orfium is an Equal Opportunity Employer. </p>",
    "link": "https://apply.workable.com/orfium/j/40472702AF"
},
{
    "id": 1555973,
    "title": "Business Operations Technician/ Administrator",
    "company": "orfium",
    "department": "Operations",
    "location": "Athens",
    "description": "<h3>A few things about <a href=\"https://orfium.tech/\" rel=\"nofollow noreferrer noopener\" class=\"external\">Orfium</a><br> </h3><p>In Orfium we are building the digital future of the Music and Media Industry, by providing complete solutions to generate and manage their revenue, promote their content and analyze their business.</p><p>YouTube, Spotify, Apple, Netflix, and various other platforms have changed the experience of the audience. On our part, we are building the technology to find content in digital platforms, recognize it and match it with the catalogs of the owners. We are developing solutions based on Big Data, Machine Learning, and Business Intelligence to provide Enterprise services and complete SaaS solutions.</p><p>Orfium currently serves some of the biggest clients in Entertainment, as the leading Copyrights Management and Information Technology company. With our HQ in Malibu, CA and our R&amp;D department in Athens, Greece, we are able to serve the biggest markets while we innovate fast.</p><p>If you believe you can make a difference by joining one of the fastest-growing tech companies in the world, you should definitely apply!</p><p><br></p><p>WHAT WE NEED</p><p>We are looking for a Business Operation Administrator to assist the Rights Management platform Product Team in daily data analysis and operational tasks needed for the servicing of Full Management client contracts and evolution of the product.</p><p><br></p><p><br></p><h3>What you will be doing</h3><ul> <li>Handle daily data mining and reporting tasks related to full (client) Management contracts in coordination with the Rights Management platform Product Manager, Engineering and Business teams</li> <li>Handle daily and monthly operational tasks related to full (client) Management contracts, in coordination with the Operations and Business teams</li> <li>Perform bespoke data analysis to assist the Rights Management platform Product Manager and Engineering team</li> <li>Maintains good understanding of the Rights Management platform database model, YouTube API object model and YouTube reports data structures</li> <li>Assist the Data team in shared Rights Management platform - Data projects, by supplying knowledge of the product-specific data structures</li> <li>Analyze, interpret and monitor organizational and clients' recommendations based on administrative data </li> <li>Develop and provide high-level administrative, statistical, and management reports using standard and specialized software applications.</li> <li>Providing administrative support to other departments or projects as needed.</li> <li>Performing other duties as assigned.</li> </ul>",
    "requirements": "<p><br></p><ul> <li>Degree in Business Administration, Business Analytics, IT or a related field preferred.</li> <li>2+ years of experience as an Operations Administrator or in a similar position.</li> <li>Strong organizational and administrative skills.</li> <li>Excellent communication skills, both written and verbal.</li> <li>Proficiency in Microsoft Office, Google Suite and data management software.</li> <li>Detail-oriented with strong analytical and problem-solving skills.</li> <li>Ability to multitask</li> <li>Knowledge of SQL</li> <li>Basic scripting knowledge</li> <li>Experience with Jupyter notebook and pandas, or equivalent</li> </ul>",
    "link": "https://apply.workable.com/orfium/j/310F72F953"
},
{
    "id": 1571208,
    "title": "Software Engineering Team Leader / \"Tech Lead\"",
    "company": "orfium",
    "department": "",
    "location": "Athens",
    "description": "<p><strong>A few things about <a href=\"https://orfium.tech/\" rel=\"nofollow noreferrer noopener\" class=\"external\">Orfium</a></strong></p>  <p>In Orfium we are building the digital future of the Music and Media Industry, by providing complete solutions to generate and manage their revenue, promote their content and analyze their business.</p><p>YouTube, Spotify, Apple, Netflix, and various other platforms have changed the experience of the audience. On our part, we are building the technology to find content in digital platforms, recognize it and match it with the catalogs of the owners. We are developing solutions based on Big Data, Machine Learning, and Business Intelligence to provide Enterprise services and complete SaaS solutions.</p><p>Orfium currently serves some of the biggest clients in Entertainment, as the leading Copyrights Management and Information Technology company. With our HQ in Malibu, CA and our R&amp;D department in Athens, Greece, we are able to serve the biggest markets while we innovate fast.</p><p>If you believe you can make a difference by joining one of the fastest-growing tech companies in the world, you should definitely apply!</p><p><br></p><p><strong>WHAT WE NEED</strong></p><p>We are looking for a Tech Lead to join our Greek branch in Koukaki, Athens (near the Syggrou Fix station).</p><p><br></p><p><strong>WHAT YOU'LL BE DOING</strong></p><p>You will be leading an agile engineering team and will:</p><ul> <li>Drive architecture design and technical discussions within the engineering team.</li> <li>Communicate with business, product, and operations departments.</li> <li>Work closely with the leadership of the engineering department and other tech leads to realize our vision of making Orfium the primary technology provider of the music industry.</li> <li>Ensure the delivery of the end product.</li> <li>Motivate &amp; coach team members while creating a nice atmosphere in the team.</li> <li>Improve the quality of the end product by leading code reviews, assuring code quality, and promoting best practices.</li> <li>Lead by example by contributing to the codebase yourself whenever possible.</li> <li>Be willing to learn more &amp; more about technology and engineering teams every day!</li> </ul>",
    "requirements": "<p><strong>NEEDED SKILLS</strong></p>  <ul> <li>At least 4 years of working experience in creating and maintaining software systems in production environments.</li> <li>At least 2 years of working experience either as a Backend or Frontend Web Development Framework (preferably with expertise in Django or ReactJS respectively).</li> <li>Excellent communication skills.</li> <li>Ability to design and enforce engineering processes.</li> <li>Deep understanding of Modern System Architectures, Design Patterns, Data Structures.</li> <li>Willingness to continuously learn and become better.</li> <li>Ability to lead an engineering team.</li> <li>Excellent communication skills.</li> <li>Excellent written and verbal communication skills in English.</li> </ul><p><strong>EXTRA POINTS:</strong></p>  <ul> <li>Previous experience in leading engineering teams.</li> <li>Experience with AWS.</li> <li>Experience with consuming third-party APIs.</li> <li>Embrassing the DevOps culture.</li> <li>Love for music.</li> </ul>",
    "link": "https://apply.workable.com/orfium/j/DFF595D538"
},
{
    "id": 1571199,
    "title": "Senior Backend Software Engineer",
    "company": "orfium",
    "department": "",
    "location": "Athens",
    "description": "<h3>A few things about <a href=\"https://orfium.tech/\" rel=\"nofollow noreferrer noopener\" class=\"external\">Orfium</a> </h3><p>In Orfium we are building the digital future of the Music and Media Industry, by providing complete solutions to generate and manage their revenue, promote their content and analyze their business.</p><p>YouTube, Spotify, Apple, Netflix, and various other platforms have changed the experience of the audience. On our part, we are building the technology to find content in digital platforms, recognize it and match it with the catalogs of the owners. We are developing solutions based on Big Data, Machine Learning, and Business Intelligence to provide Enterprise services and complete SaaS solutions.</p><p>Orfium currently serves some of the biggest clients in Entertainment, as the leading Copyrights Management and Information Technology company. With our HQ in Malibu, CA and our R&amp;D department in Athens, Greece, we are able to serve the biggest markets while we innovate fast.</p><p>If you believe you can make a difference by joining one of the fastest-growing tech companies in the world, you should definitely apply!</p><p><br></p><p><strong>WHAT WE NEED</strong></p><p>We are looking for a Senior Django Backend Engineer to join our Greek branch in Koukaki, Athens.</p><p><strong>WHAT YOU'LL BE DOING</strong></p><p>You will be part of an Agile Team and will:</p><ul> <li>Maintain as well as build new features for our B2B products.</li> <li>Participate in team meetings and propose solutions.</li> <li>Code Review your collaborators' code(everyone does it).</li> <li>Properly document your work by both technical and/or business perspective.</li> </ul>",
    "requirements": "<p><strong>NEEDED SKILLS</strong><br></p><ul> <li>At least 4+ years of working experience in creating and maintaining software systems in production environments.</li> <li>At least 2 years of working experience with Django or a modern Web Development Framework.</li> <li>Experience in Test-Driven Development (TDD).</li> <li>Hands-On  SQL  Experience(preferably with PostgreSQL).</li> <li>Ability to write organised and clean code.</li> <li>Good understanding of Version Control (preferably with Git).</li> <li>Understanding  of  Modern  System  Architectures,  Design  Patterns,  Data  Structures.</li> <li>Willingness to continuously learn and become better.</li> <li>Ability to work as part of a team.</li> <li>Excellent communication skills.</li> <li>Good written and verbal communication skills in English.</li> </ul><p><br></p><p><strong>EXTRA POINTS:</strong></p><ul> <li>Expertise in Django/Django REST Framework.</li> <li>Familiarity with AWS.</li> <li>Experience with ElasticSearch.</li> <li>Experience with consuming third-party APIs.</li> <li>Love for music.</li> </ul>",
    "link": "https://apply.workable.com/orfium/j/BD16733869"
},
{
    "id": 1525177,
    "title": "Senior Software Engineer, Data Services",
    "company": "orfium",
    "department": "Data Team",
    "location": "Athens",
    "description": "<h3>A few things about <a href=\"https://orfium.tech/\" rel=\"nofollow noreferrer noopener\" class=\"external\">Orfium</a><br> </h3><p>In Orfium we are building the digital future of the Music and Media Industry, by providing complete solutions to generate and manage their revenue, promote their content and analyze their business.</p><p>YouTube, Spotify, Apple, Netflix, and various other platforms have changed the experience of the audience. On our part, we are building the technology to find content in digital platforms, recognize it and match it with the catalogs of the owners. We are developing solutions based on Big Data, Machine Learning, and Business Intelligence to provide Enterprise services and complete SaaS solutions.</p><p>Orfium currently serves some of the biggest clients in Entertainment, as the leading Copyrights Management and Information Technology company. With our HQ in Malibu, CA and our R&amp;D department in Athens, Greece, we are able to serve the biggest markets while we innovate fast.</p><p>If you believe you can make a difference by joining one of the fastest-growing tech companies in the world, you should definitely apply!</p><p><br></p><h3>What we need</h3><p>Our Data Services and Machine Learning (ML) sit at the core of our efforts to automate future work. We turn ML lab experiments into enterprise–ready AI solutions to solve complex machine learning, deep learning, and natural language understanding problems, and we’re looking for amazing people to join us. We're looking to grow our Data Science team with the addition of a Senior Software Engineer. You will be working directly with our Data Scientists, Data Engineers, BI Analysts, and ML Engineers, in Athens and will help deploy and maintain our ML Products and the overarching Platform.<br></p><p><strong>What you will be doing</strong>·       </p><ul> <li>Be responsible for the deployment and integration of our Data Services</li> <li>Setup and utilise cloud infrastructure required for the service deployment, we are currently using AWS</li> <li>Work with data scientists to improve our code quality, define and follow best practices</li> <li>Develop custom tooling to automate our DS workflow</li> <li>Manage large, production-quality systems</li> <li>Investigate and resolve technical issues across our Data Services estate</li> <li>Lead a team of Software Engineers inside the Data Science team. Currently planning for a team of two, with the possibility of expanding it further</li> </ul>",
    "requirements": "<p>Needed skills</p><ul> <li>BS in Computer Science or similar.</li> <li>A minimum of 3 years of experience in relevant roles</li> <li>Team player</li> <li>Good problem-solving skills</li> <li>Advanced Design Architect experience</li> <li>Experience on mentoring/coaching and managing a small team</li> <li>Very good interpersonal skills</li> <li>Proficient with a major Programming Language(preferably Python)</li> <li>Experience with continuous deployment, and live monitoring in production</li> <li>Implementation of security best practices</li> </ul><p><br></p><p>Good to have</p><ul> <li>Understanding of ML techniques and concepts</li> <li>Experience with SQL and/or NoSQL Databases</li> <li>Experience with a large Cloud Provider(AWS, Azure, GCP)</li> </ul>",
    "link": "https://apply.workable.com/orfium/j/15BC89EBC5"
},
{
    "id": 1617123,
    "title": "Mid - Senior Product Designer",
    "company": "orfium",
    "department": "Product Design",
    "location": "Athens",
    "description": "<h3>A few things about <a href=\"https://orfium.tech/\" rel=\"nofollow noreferrer noopener\" class=\"external\">Orfium</a><br> </h3><p>In Orfium we are building the digital future of the Music and Media Industry, by providing complete solutions to generate and manage their revenue, promote their content and analyze their business.</p><p>YouTube, Spotify, Apple, Netflix, and various other platforms have changed the experience of the audience. On our part, we are building the technology to find content in digital platforms, recognize it and match it with the catalogs of the owners. We are developing solutions based on Big Data, Machine Learning, and Business Intelligence to provide Enterprise services and complete SaaS solutions.</p><p>Orfium currently serves some of the biggest clients in Entertainment, as the leading Copyrights Management and Information Technology company. With our HQ in Malibu, CA and our R&amp;D department in Athens, Greece, we are able to serve the biggest markets while we innovate fast.</p><p>If you believe you can make a difference by joining one of the fastest-growing tech companies in the world, you should definitely apply!</p><p><br></p><h3>What we are looking for</h3><p>We are looking for a passionate product designer to join our team and focus on designing pixel perfect UIs for our music-industry oriented products. You will also contribute to the design and maintenance of our Design System. You should be able to work in multiple products and deliver on time. Creating low fidelity prototypes is a must. Experience with creating animations and high fidelity prototypes will be considered a plus.</p><p><br></p><h3>What you will be doing</h3><ul> <li>Design polished user interfaces, interactions and prototypes that bring clarity to complex design problems</li> <li>Participate in research to understand users’ goals and figure out “what’s next” for the team</li> <li>Conceptualize specs into wireframes and mockups</li> <li>Simplify abstract use cases to develop easy to understand user flows</li> <li>Present work to teammates and stakeholders to gain buy-in on their ideas</li> <li>Contribute to our Design System</li> </ul>",
    "requirements": "<h3>NEEDED SKILLS</h3><ul> <li>At least 2 years of web and mobile design experience</li> <li>Excellent portfolio of UI design solutions across a spectrum of platforms and services</li> <li>Communication skills in Greek and English (written and spoken)</li> <li>Experience in using design tools (Sketch, Figma)</li> <li>Experience in using collaboration tools like Miro</li> <li>Experience in using Jira and Confluence</li> <li>Highly detail oriented with a drive for perfection down to the last pixel</li> <li>Self-motivated to prioritise, take initiative, manage workload and meet critical project deadlines</li> <li>Experience in working with, and maintaining a design components library</li> </ul><p><br></p><h3>EXTRA POINTS</h3><ul> <li>Experience in complex B2B platforms</li> <li>Experience in music-oriented platforms</li> <li>Html, CSS and front-end frameworks basic understanding</li> <li>Experience in user research, usability studies, personas, user stories and user flows</li> <li>Experience in animation</li> </ul>",
    "link": "https://apply.workable.com/orfium/j/F998E585D5"
},
{
    "id": 842744,
    "title": "Senior UX Designer",
    "company": "orfium",
    "department": "Product Design",
    "location": "Athens",
    "description": "<p>Α FEW THINGS ABOUT ORFIUM</p> <p>In Orfium we are building the digital future of the Music and Media Industry, by providing complete solutions to generate and manage their revenue, promote their content and analyze their business.</p><p>YouTube, Spotify, Apple, Netflix, and various other platforms have changed the experience of the audience. On our part, we are building the technology to find content in digital platforms, recognize it and match it with the catalogs of the owners. We are developing solutions based on Big Data, Machine Learning, and Business Intelligence to provide Enterprise services and complete SaaS solutions.</p><p>Orfium currently serves some of the biggest clients in Entertainment, as the leading Copyrights Management and Information Technology company. With our HQ in Malibu, CA and our R&amp;D department in Athens, Greece, we are able to serve the biggest markets while we innovate fast.</p><p>If you believe you can make a difference by joining one of the fastest-growing tech companies in the world, you should definitely apply!</p><p><br></p><p>WHAT WE ARE LOOKING FOR</p><p>A skilful and passionate UX Designer that will help us extract knowledge from analytics on products, work on prototypes and MVPs to get quick feedback, run workshops to meet our goals more effectively, and help on the design process of new products or features. Overall, we need a perfect fit for our product team that is growing fast.</p><p>WHAT YOU'LL BE DOING</p><p>You will be a part of a Design Thinking team and will:</p><ul> <li>Design wireframes, task flows, and concepts, validate new products or redesigns of existing ones.</li> <li>Analyze product analytics to help build a product roadmap and curate the product backlog.</li> <li>Lead design thinking and workshop facilitation sessions.</li> <li>Run market research both with qualitative and quantitative methods.</li> <li>Participate in team meetings and propose solutions.</li> <li>Communicate to teams and upper hierarchy the customer insights.</li> <li>Work together with Product Managers and Designers.</li> </ul>",
    "requirements": "<p>NEEDED SKILLS<br></p><ul> <li>Proven UI/UX design experience with a strong portfolio.</li> <li>Passion for creating useful, usable, engaging user experiences.</li> <li>Generalist UX chops across interaction design, research, and visual design</li> <li>Deep understanding of user-centered design methods and best practices - and you’re always looking to improve on your and our processes.</li> <li>Enjoy a wide mix of work ranging from consumer-style music app design to complex back-end admin interfaces.</li> <li>Good knowledge in Sketch, Figma, Miro or similar applications.</li> <li>The ability to multi-task, working to deadline across one or more projects.</li> <li>Work with developers and designers to deliver a polished final product.</li> <li>Excellent written and spoken communicator able to present design decisions in a clear and compelling way.</li> <li>Strong written and verbal English communication skills.</li> </ul> <p><br></p><p>EXTRA POINTS:</p><ul> <li>Love for music.</li> <li>An academic background in computer science.</li> <li>Experience in running market research.</li> <li>Good understanding of Agile methodology, especially with respect to UI/UX design.</li> </ul>",
    "link": "https://apply.workable.com/orfium/j/C6AD067F66"
},
{
    "id": 1624447,
    "title": "Music Copyright Administrator",
    "company": "orfium",
    "department": "Operations",
    "location": "Malibu",
    "description": "<p><strong>Company Summary:</strong></p><p>Orfium is a fast-growing music technology company representing some of the biggest music companies in the world. We are looking for talented, hard-working people to join our rights management team who are passionate about protecting the value of music. Our office is located in Malibu, CA with a beautiful ocean view overlooking the Malibu Pier. Some of our clients include: Warner Music Group, Sony Music Group, Sony Music Publishing, Warner Chappell Music Publishing, Global Music Rights, Ingrooves, Red Bull and many more.</p><p><strong>Position Summary: </strong>The Music Copyright Administrator’s responsibility is to manage our client’s assets and data by performing various tasks involving asset conflict resolution, music research, data analysis and thoughtful problem-solving. Primary tasks include CMS Masterlist / Backpay review, conflict resolution, ZenDesk communications between clients and 3rd parties.</p><p><strong>Duties/Responsibilities:</strong></p><ul> <li>Manage client’s assets in the CMS through conflict resolution.</li> <li>Research metadata, music catalogs and song histories.</li> <li>Maintain or exceed daily goals as set by management.</li> <li>Troubleshoot issues as they arise and communicate questions to their team lead.</li> <li>Review full-management client Masterlist / Backpay reports.</li> <li>Stay up-to-date with Orfium, client and industry partner policies.</li> <li>Perform other duties and responsibilities, as assigned.</li> </ul>",
    "requirements": "<p>Qualifications:</p><ul> <li>Preferred experience claiming for 1 year.</li> <li>Customer service or team management experience is a plus.</li> <li>Excellent time management skills with a proven ability to meet deadlines.</li> <li>Strong analytical, logical and problem-solving skills.</li> <li>Ability to function effectively in an at-home work environment (autonomous, self-starter, remote communication with team and management).</li> <li>Advanced computer skills and familiarity with G-Suite, Excel. Ability to quickly adapt to unfamiliar, internal Orfium interfaces.</li> <li>Excellent verbal and written communication skills; extremely detail-oriented.</li> <li>Extensive musical knowledge with an exceptional “ear” for auditory detail.</li> <li>Preferred BA or BS degree from an accredited college or university.</li> </ul><p><br></p><p>Supervisory Responsibilities:</p><p>This position does not supervise. </p><p>Essential Work &amp; Physical Requirements:</p><p>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. While performing the duties of this job, the employee is regularly required to talk and hear.</p><ul> <li>Available to work a minimum of 40 hours per week and a minimum of 5 days per week. </li> <li>Prolonged periods of sitting at a desk and working on a computer.</li> </ul><ul><li>Must be able to lift up to 15 pounds at times. </li></ul><p><br></p><p>Orfium is an Equal Opportunity Employer.</p>",
    "link": "https://apply.workable.com/orfium/j/BCFB334867"
},
{
    "id": 1632290,
    "title": "Account Management Specialist",
    "company": "orfium",
    "department": "",
    "location": "Malibu",
    "description": "<p><strong>Company Summary:</strong></p><p>Orfium is a fast-growing music technology company representing some of the biggest music companies in the world. We are looking for talented, hardworking people to join our rights management team who are passionate about protecting the value of music. Our office is located in Malibu, CA with a beautiful ocean view overlooking the Malibu Pier. Some of our clients include: Warner Music Group, Sony Music Group, Sony/ATV Music Publishing, Warner Chappell Music Publishing, Global Music Rights, Ingrooves, Red Bull, and many more.</p> <p><strong>Position Summary: </strong>The Account Management Specialist is responsible for servicing clients, building and maintaining relationships with both internal and external departments, vendors, distributors, etc, contract &amp; plan meetings whilst overseeing new marketing initiatives, researching new market and emerging trends, and implementing management plans to ensure our clients are satisfied with our services. This role is heavily focused on marketing efforts for the company’s products. </p> <p><strong>Duties/Responsibilities:</strong></p><ul> <li>Servicing existing clients to ensure their needs are met.</li> <li>Contacting potential clients to establish rapport and arrange meetings.</li> <li>Partnering with other Account Managers on new marketing initiatives.</li> <li>Devising and implementing the strategy for meeting sales performance targets. </li> <li>Finding and developing new markets and improving sales.</li> <li>Attending conferences, meetings, and industry events.</li> <li>Developing quotes and proposals for clients.</li> <li>Building and maintaining relationships with recording with both internal and external sales and marketing departments, vendors, distributors, labels and publishers, and customers.</li> <li>Researching new markets and emerging market trends.</li> <li>Assisting in the implementation of an account management plan to ensure that business relations are properly maintained.</li> <li>Presenting market research to the marketing department and recommending strategies to improve market research.</li> <li>Collecting information in order to prepare proposals in response to requests for proposals (RFPs) for Account Managers review. </li> <li>Advise on strategic industry partnerships.</li> <li>Establish ongoing accounts with labels and publishers in the music industry. </li> <li>Continuously prove a wealth of knowledge about company products.</li> <li>Firm knowledge of Music Metadata and analyzing data sets. </li> <li>Perform other duties and responsibilities, as assigned.</li> </ul><p><br></p>",
    "requirements": "<p><strong>Qualifications:</strong></p><ul> <li>Preferred 3 years of experience in the music industry, sales, marketing, or related field.</li> <li>Strong communication skills.</li> <li>Ability to manage complex projects and multi-task.</li> <li>Excellent verbal and written communication skills; extremely detail-oriented.</li> <li>Exhibits professional demeanor and sound judgment.</li> <li>Self-starter, takes initiative and is resourceful; takes ownership of tasks and projects; works well under pressure.</li> <li>Ability to work autonomously and collaboratively.</li> <li>Thorough knowledge of digital media, advertising technologies, and SaaS business models.</li> <li>Advance computer skills, including in Word, Excel.</li> </ul><ul> <li>Preferred BA or BS degree in business, marketing, or related field.</li> <li>Proficiency in integrated business management and CRM software.</li> <li>Experience in identifying profitable business opportunities and potential clients.</li> <li>Competency in researching sales leads, presenting proposals, and negotiating deals.<br> </li> </ul><p>Supervisory Responsibilities:</p><p>This position does not directly supervise. </p> <p>Essential Work &amp; Physical Requirements:</p><p>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. While performing the duties of this job, the employee is regularly required to talk and hear.</p><ul> <li>Available to work a minimum of 40 hours per week and a minimum of 5 days per week. </li> <li>Prolonged periods of sitting at a desk and working on a computer.</li> </ul><ul> <li>Must be able to lift up to 15 pounds at times. </li> <li>Able to travel domestically and internationally as needed. </li> </ul><p>Orfium is an Equal Opportunity Employer. </p>",
    "link": "https://apply.workable.com/orfium/j/48C59CED8F"
},
{
    "id": 1454676,
    "title": "Senior Product Manager",
    "company": "orfium",
    "department": "Product",
    "location": "Koukaki",
    "description": "<h3>A few things about <a href=\"https://orfium.tech/\" rel=\"nofollow noreferrer noopener\" class=\"external\">Orfium</a> </h3><p>In Orfium we are building the digital future of the Music and Media Industry, by providing complete solutions to generate and manage revenue, promote content and provide business insights. </p><p>YouTube, Spotify, Apple, Netflix and various other platforms have changed the experience of the audience. On our part, we are building the technology to find content in digital platforms, recognize it and match it with the catalogs of the owners. We are developing solutions based on Big Data, Machine Learning, and Business Intelligence to provide Enterprise services and complete SaaS solutions.</p><p>Orfium currently serves some of the biggest clients in Entertainment, as the leading Copyrights Management and Information Technology company. With our HQ in Malibu, CA and our R&amp;D department in Athens, Greece, we are able to serve the biggest markets while we innovate fast.</p><p>If you believe you can make a difference by joining one of the fastest growing tech companies in the world, you should definitely apply!</p><p><br></p><p>WHAT WE ARE LOOKING FOR</p><p>A skillful and passionate Senior Product Manager that will manage one of our main B2B products for delivering value on YouTube. That means that we need a good understanding of the enterprise software, a data-driven mindset, and the management of a product lifecycle.</p><p>The ideal candidate will have a startup mindset along with analytical thinking skills and will be willing to take initiatives and execute the product strategy effectively and report back with ideas that will improve our Product Suite and Operations. Good communication and management skills are also required, as many stakeholders are involved in the process and should be served effectively.</p><p><br></p><p>WHAT YOU'LL BE DOING</p><p>You will be a part of a Design-driven, Agile Product Team and will:</p><ul> <li>Align with product strategy design and formulation</li> <li>Drive a multi-disciplinary team of engineers to solve big problems in the music industry</li> <li>Analyze business requirements and prioritize tickets for the relevant teams</li> <li>Collaborate with the Product Management and Design Team to build a Product Roadmap</li> <li>Collaborate with Tech Leaders in order to achieve deadlines and deliver products efficiently </li> <li>Align with the Operations and Data Intelligence departments in order to locate any possible issues and deficiencies for B2B products</li> <li>Design and run experiments</li> <li>Monitor your product health and performance through analytics and reports</li> <li>Collaborate on the pricing strategy with the relative teams</li> <li>Launch, pitch, grow your product and help to build a sales funnel for our audience</li> <li>Explore opportunities for new products, new business models and prepare the roadmap for new versions of existing products</li> </ul>",
    "requirements": "<p>NEEDED SKILLS<br></p><ul> <li>Proven product management experience, or relevant knowledge</li> <li>Proven knowledge of the Lean methodology</li> <li>Proven knowledge of Agile methodologies, Scrum or Kanban</li> <li>Passion for innovation and impact</li> <li>Good design perception and UX understanding</li> <li>Strong written and verbal Greek and English communication skills</li> <li>Familiarity with Programming Languages, Frameworks and Tools (Python, Django framework, React Framework, SQL, Tableau, Jira, Confluence and more)</li> </ul><p><br></p><p>EXTRA POINTS:</p><ul> <li>Love for music!</li> <li>An academic background in computer science, or proven programming skills</li> <li>Previous experience in a startup company</li> <li>Experience on small/medium business products</li> <li>MBA or Master in Business</li> <li>Digital Marketing skills</li> </ul>",
    "link": "https://apply.workable.com/orfium/j/24FA0DA735"
}
]