[
{
    "id": 1264893,
    "title": "Join Skroutz team",
    "company": "skroutz",
    "department": "",
    "location": "Athens",
    "description": "<p>Do you want to be part of an amazingly growing environment but you don’t see an opening matching your profile? </p><p>Worry not!!!</p>",
    "requirements": "<p>Send us your CV telling us a few words about you, which team interests you and why you want to join Skroutz.</p><p>We will review your application and get back to you in the next two weeks. </p>",
    "link": "https://apply.workable.com/skroutz/j/4FFDCB70B4"
},
{
    "id": 1423854,
    "title": "Senior Backend Engineer - Product (SR 0820)",
    "company": "skroutz",
    "department": "Engineering",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by being incredibly trustworthy, trouble-free, and easy to use. We want to provide this experience not only to our users and partners, but also to our team members.</p><p>We believe that people drive our business forward and we strive daily to build a powerful team with people that share the same passion and enthusiasm for eCommerce and technology.</p><p><strong>What we are looking for</strong></p><p>We are looking for Software Engineers with a strong technical background and a “get-things-done” attitude who are eager to learn new exciting technologies to join our <a href=\"https://www.skroutz.gr/careers#Core-Product\" rel=\"nofollow noreferrer noopener\" class=\"external\">Core Product</a>.<br></p><p><strong>Examples of work you might undertake</strong></p><ul> <li>Develop our content management system (codenamed \"Earth\"), used to maintain specs, descriptions and media for over 10M products.</li> <li>Work on product sizes detection and conversions across 150+ fashion categories, enabling filters and size guides on the Skroutz platform.</li> <li>Optimize our product categorization and clustering pipelines, used to classify over 30k new products daily.</li> <li>Improve the extraction of product attributes (e.g. brand, color, model number) from product titles, descriptions or other semi-structured data.</li> <li>Help automate any time-consuming manual procedure that a machine can perform more efficiently.</li> </ul>",
    "requirements": "<p><strong>What skills and experience you will need</strong></p><ul> <li>At least (5) years of working experience as a Software Engineer in a professional setting.</li> <li>A solid CS background.</li> <li>Intrigued by the product as much as by the technology.</li> <li>Excellent analytical and problem-solving skills.</li> <li>Excellent communication skills and team spirit.</li> </ul><p><strong>We will appreciate if you have</strong></p><ul> <li>Good knowledge of Ruby/Ruby on Rails is a huge plus.</li> <li>Experience with JavaScript frameworks/UI libraries (preferably React).</li> <li>Solid understanding of web architecture.</li> <li>Strong knowledge of database systems (relational, document-based, etc).</li> <li>Familiarity with OOP principles and design patterns.</li> <li>Comfort with TDD and other testing practices.</li> <li>Exposure to architectural patterns and the production system of a large, performance-intensive web application.</li> <li>Contributed to open-source projects</li> <li>Shareable open source contributions or personal projects which will help us in the evaluation process.</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/D7CCCF3013"
},
{
    "id": 1479814,
    "title": "Senior Backend Engineer - Partners (BE 1020)",
    "company": "skroutz",
    "department": "Engineering",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by being incredibly trustworthy, trouble-free, and easy to use. We want to provide this experience not only to our users and partners, but also to our team members.</p><p>We believe that people drive our business forward and we strive daily to build a powerful team with people that share the same passion and enthusiasm for eCommerce and technology.</p><p>We are looking for Software Engineers with a strong technical background and a “get-things-done” attitude, who are eager to learn new exciting technologies to join our Partners team and help build a strong merchants value proposition with new products and services.<br><br></p><p><strong>Examples of work you might undertake</strong></p><ul> <li>Improve our back-office system used by our 6000+ merchants.</li> <li>Work on our Analytics platform which handles over 30 Million requests per day and its adjacent services.</li> <li>Boost our Marketplace service offerings to further expand our e-commerce solution for brick-and-mortar shops.</li> <li>Develop and maintain our in-house affiliate management system.</li> <li>Enhance our billing algorithms, develop monitoring tools and build fraud detection mechanisms.</li> <li>Improve our Merchants' support operations with new services and automated processes.</li> </ul>",
    "requirements": "<p><strong>What skills and experience you will need</strong></p><ul> <li>High productivity on par with significant experience working as a Software Engineer in a professional setting.</li> <li>A solid CS background.</li> <li>Solid understanding of web architecture.</li> <li>Strong knowledge of database systems (relational, document-based, etc).</li> <li>Intrigued by the product as much as by the technology.</li> <li>Excellent analytical and problem-solving skills.</li> <li>Excellent communication skills and team spirit.<br><br> </li> </ul><p><strong>We will appreciate if you have</strong></p><ul> <li>Good knowledge of Ruby/Ruby on Rails is a huge plus.</li> <li>Experience with JavaScript frameworks/UI libraries (preferably React).</li> <li> Familiarity with OOP principles and design patterns.</li> <li>Comfort with TDD and other testing practices.</li> <li>Exposure to architectural patterns and the production system of a large, performance-intensive web application.</li> <li>Contributed to open-source projects</li> <li>Shareable open source contributions or personal projects which will help us in the evaluation process.</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/1D80C27F0E"
},
{
    "id": 1481393,
    "title": "Reviews and Community Curator (RC 1020)",
    "company": "skroutz",
    "department": "UGC",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by being incredibly trustworthy, trouble-free, and easy to use. We want to provide this experience not only to our users and partners, but also to our team members.</p><p>We believe that people drive our business forward and we strive daily to build a powerful team with people that share the same passion and enthusiasm for eCommerce and technology.</p><p>We are looking for a<strong> Reviews &amp; Community Curator</strong> to help our users get the most out of the available public reviews, and ensure that the quality of the user-generated content (UGC) meets our users’ expectations. </p><p>As a Reviews &amp; Community Curator, you’ll join our UGC team, responsible for driving customer engagement through our User Generated Content.</p> <p><strong>Your responsibilities will include:</strong></p> <ul> <li>Ensuring that the daily thousands product reviews and user discussions are going to be published according to our terms and conditions.</li> <li>Take appropriate action to inform our users about any necessary changes on their published content in a timely manner to meet or exceed their expectations.</li> <li>Providing Skroutz’s users with the necessary information, support, and guidance for making the best use of our platform and its features, by interacting with them via various channels of communication -like emails, facebook messages, and inhouse tools.</li> <li>Articulate technical issues, such as reproducing bugs and user remarks, to determine their accuracy, so that you could effectively relay to the rest of the team when needed.</li> <li>Follow the team’s structure on monitoring, organising and analyzing users' feedback &amp; go the extra mile to engage customers.</li> </ul>",
    "requirements": "<ul> <li>Excellent copywriting skills both in Greek and English.</li> <li>Minimum 1 year in online customer support services (preferably in an eCommerce environment).</li> <li>Outstanding communication skills with the ability to articulate technical issues (explore bugs), and active listening.</li> <li>Detail and goal-oriented, creative individual with the ability to manage multiple tasks and prioritize accordingly.</li> <li>Fast-learner with empathy and positivity. Highly organized, and self-motivated worker with ability to take ownership of issues and follow through to resolution</li> <li>Confident and outgoing personality with the ability to communicate effectively both in writing and verbally.</li> <li>Team player, open-minded, enthusiastic and inspirational. </li> </ul><p><strong>Nice to have skills</strong></p><ul> <li>Community management in an eCommerce environment.</li> <li>Forum moderator experience will be considered a plus.</li> <li>Advanced Excel skills</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/197925FA6D"
},
{
    "id": 1470596,
    "title": "Customer Support Lead - Marketplace (CL 1020)",
    "company": "skroutz",
    "department": "Marketplace",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by being incredibly trustworthy, trouble-free, and easy to use. We want to provide this experience not only to our users and partners, but also to our team members.</p><p>We believe that people drive our business forward and we strive daily to build a powerful team with people that share the same passion and enthusiasm for eCommerce and technology.</p><p>Our customers are at the heart of everything we do, which means that we try to always get things right for them. Our Marketplace team strives to make our customer's journey with us something we're proud of.</p><p><strong>What We Are Looking For:</strong></p> <p>We're looking for a Support Team Lead to provide guidance to Marketplace Customer Support agents to deliver superior customer service to Skroutz users and merchants. </p><p>You’ll work with a team of 5-6 agents who operate in rotation including weekends. Your business hours will be on a traditional schedule, and you’ll need to make sure your team is aligned and has the information they need when others aren’t around.</p><p>As a Team Lead, you will need to contribute to creating a healthy inclusive team environment, guided by honesty, trust, and safety. </p> <p><strong>Some things about you:</strong></p><ul> <li>Υou are results driven, persistent and can work independently</li> <li>You can set a positive example and make sure your team is aligned with the department's goals and objectives</li> <li>You aim to maximize individuals’ abilities through clear expectations, feedback, coaching, and recognition</li> <li>You have an analytical mind and can identify process blockers that might be affecting the team work</li> </ul><p><strong>Responsibilities</strong></p><ul> <li>Schedule shifts</li> <li>Answer questions from the team and provide guidance and feedback</li> <li>Hold regular 1:1 meetings with each direct report to determine satisfaction and ensure team’s alignment</li> <li>Address team’s concerns or performance issues as needed</li> <li>Address customer issues and complaints, taking ownership of escalations and following problems through to resolution</li> <li>Take on more complex operational support tasks</li> <li>Work with management to assess and improve processes and policies and minimize reactive support<br> </li> </ul><h3><br></h3>",
    "requirements": "<h3>What skills and experience you will need:</h3><p><strong>Experience</strong><br></p><ul><li>Bachelor’s degree</li></ul><ul> <li>Proven experience of successfully leading a team for at least 1 year</li> <li>Familiarity with customer service tools and CRM systems </li> <li>Experience working with Zendesk will be considered a plus</li> </ul><p><strong>Skills</strong></p><ul> <li>Strong empathetic skills and the ability to put yourself in someone’s shoes</li> <li>Strong customer centricity and focus on customer experience and satisfaction</li> <li>Solid communication and interpersonal skills</li> <li>Ability to multitask, prioritize, and manage time effectively</li> <li>Analytical and problem-solving skills with customer service focus</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/430881C2B3"
},
{
    "id": 1478501,
    "title": "Senior Product Manager (SPM 1020)",
    "company": "skroutz",
    "department": "Product Management",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by being incredibly trustworthy, trouble-free, and easy to use. We want to provide this experience not only to our users and partners, but also to our team members.</p><p>We believe that people drive our business forward and we strive daily to build a powerful team with people that share the same passion and enthusiasm for eCommerce and technology.</p><p><strong>What We Are Looking For</strong></p><p>We are looking for an experienced <strong>Product Manager</strong> who can understand the needs of our users and simplify complex problems. Skroutz Product Teams build thoughtful e-commerce experiences through continuous experimentation and refinement. We want people with a collaborative mindset that can drive a cross-functional team to build the best possible experiences for our users.</p><p><strong>A few examples of what you would do<br></strong></p><ul> <li>Analyse performance of the checkout funnel, locate areas of improvement and drive incremental optimisations.</li> <li>Understand company strategy and take part in quarterly planning in order to set goals and define success metrics.</li> <li>Communicate with internal teams to coordinate the data entry, design and development of a new filter functionality that will help users locate a product among thousands of options.</li> <li>Communicate and understand different approaches on the design of a new feature that exist between stakeholders. Use data and your business acumen to create alignment.</li> <li>Help your team to integrate a new payment method to the checkout process. Communicate with 3rd party payment providers to evaluate offerings. Communicate with internal stakeholders to set requirements.</li> </ul>",
    "requirements": "<p><strong>What Skills and Experience You Will Need</strong><br></p><ul> <li>At least 5 years of experience in a similar position.</li> <li>Ability to collect and analyse data.</li> <li>Great communication and organizational skills.</li> <li>Great understanding of user interaction and experience.</li> <li>Extended experience working closely with development and design teams.</li> </ul><p><strong>We will Appreciate if you have</strong></p><ul> <li>Good knowledge of Google Analytics and related software.</li> <li>Working experience on e-commerce products.</li> <li>Ability to understand technical challenges and adjust specifications.</li> <li>Working experience in an multi-functional environment.</li> </ul><p><em>Please note that this opening concerns an onsite job, located in Athens, Attica, Greece.</em></p>",
    "link": "https://apply.workable.com/skroutz/j/492A3A75C1"
},
{
    "id": 1494264,
    "title": "Senior UI/UX Designer - Product (DN 1020)",
    "company": "skroutz",
    "department": "Design",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by being incredibly trustworthy, trouble-free, and easy to use. We want to provide this experience not only to our users and partners, but also to our team members.</p><p>We believe that people drive our business forward and we strive daily to build a powerful team with people that share the same passion and enthusiasm for eCommerce and technology.</p><p><strong>What We Are Looking For</strong><br></p>We are looking to hire a talented UI / UX Designer, passionate about designing amazing yet simple user-centered experiences. You will be responsible for early-stage research and ideation, through implementation and iteration towards building products for the web, mobile web and apps.<p><strong>What you are expected to do</strong></p><ul> <li>Own all sides of design from concept to launch: storyboards, user flows, mockups, prototypes, and pixel perfect assets</li> <li>Conduct user studies, competitive research and usability tests</li> <li>Work closely with developers to see design through to implementation</li> <li>Request  early feedback through rapid prototypes or low fidelity wireframes </li> <li>Develop, maintain and create pixel perfect designs, mockups and specifications as needed, adhering to brand guidelines</li> <li>Maintain consistency in visual elements and ensure that our design system and philosophy is applied across the product</li> <li>Collaborate with internal teams; communicate thoughts and expertise to the rest of the team</li> <li>Stay on top of new technology and trends in mobile UI/UX designs</li> </ul>",
    "requirements": "<p><strong>What Skills and Experience You Will Need<br></strong></p><p><strong>Experience</strong></p><ul> <li>Minimum 3 years experience in a relevant position</li> <li>Excellent Portfolio of UI/UX design solutions across a spectrum of platforms and services</li> <li>Experience of working in a cross-discipline team environment</li> <li>Experience in user research, usability studies, personas</li> <li>Degree in Digital or Graphic Design (optional)</li> </ul><p><strong>Skills</strong></p><ul> <li>Proficiency in relevant creative tools (Sketch, Adobe XD, Figma)</li> <li>Familiarity with Abstract, Zeplin, Photoshop, Illustrator, prototyping tools</li> <li>Demonstrated experience working with a design system, its curation, maintenance, and dissemination</li> <li>Highly detail oriented with a drive for perfection down to the last pixel</li> <li>Self-motivated to prioritise and manage workload and meet critical project deadlines</li> <li>Positive attitude with a creative, solution-driven mindset</li> <li>Familiarity with HTML, CSS &amp; Javascript (optional)</li> </ul><p><em>*Please make sure that you have included in your application a sample link of your UI/UX Portfolio. Applications with no portfolio will not be assessed further.</em></p><p><em>**<em>Please note that this opening concerns an onsite job, located in Athens, Attica, Greece.</em></em></p>",
    "link": "https://apply.workable.com/skroutz/j/3F825D8E87"
},
{
    "id": 1520560,
    "title": "Senior Security Engineer - Platform (SC 1220)",
    "company": "skroutz",
    "department": "Engineering",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by being incredibly trustworthy, trouble-free, and easy to use. We want to provide this experience not only to our users and partners, but also to our team members.</p><p>We believe that people drive our business forward and we strive daily to build a powerful team with people that share the same passion and enthusiasm for eCommerce and technology.</p><p><strong>What we are looking for</strong></p><p>We are looking for a <strong>Senior Security Engineer</strong> with a Software Engineering background to join our Security Team at Skroutz. The Security Team is part of our Platform division and aims to assist the development teams produce secure code and help the rest of the Platform division secure our infrastructure.</p><p><strong>Examples of work you might undertake</strong></p><ul> <li>Integrate security tools (e.g. dynamic or static analysis tools) in the development process to achieve SDLC</li> <li>Conduct security assessments for internal and external-facing applications</li> <li>Harden the basic OS image we use on our servers</li> <li>Identify threats and provide guidance on hardening a new service</li> <li>Develop and maintain internal tools around security and integrate 3rd party security solutions (e.g. automated security update rollout, infrastructure security intelligence gathering, IAM platform etc.)</li> <li>Continuously educate developer teams around security concepts</li> <li>Assess third-party software &amp; services for inclusion in our infrastructure</li> </ul>",
    "requirements": "<p><strong>What skills and experience you will need</strong></p><ul> <li>At least 4 years of working experience as a Security Engineer/Security Analyst or on a relevant security position, in a professional setting</li> <li>A solid CS background, accompanied by a genuine interest in cybersecurity, continuously growing your skills &amp; knowledge</li> <li>Good working knowledge of at least one programming language (Ruby and/or Python will be considered a plus)</li> <li>Familiarity with Linux &amp; Windows from a security viewpoint and relevant security hardening experience</li> <li>Prior experience with security assessments in mixed environments (whitebox or blackbox penetration testing etc.)</li> <li>Prior experience is security code reviews and drafting of security technical reports</li> <li>Ability to own a cybersecurity project end-to-end, including researching, designing the architecture, implementing, integrating, testing, deploying &amp; monitoring a solution</li> <li>Good communication and interpersonal skills, being a team player</li> <li>Ability to inspire and motivate a team to achieve individual and company­ goals</li> <li>Lead-by-example mentality<br> </li> </ul><strong>We will appreciate if you have</strong><ul> <li>Worked as a DevSecOps or Full-Stack web developer in a professional setting</li> <li>Experience in at least one of the following fields: mobile application security, cloud security, container &amp; virtualization security</li> <li>Experience in utilizing common cybersecurity tools (BurpSuite, Nmap, Nikto, Metasploit/Empire, Nessus/OpenVAS, SIEMs etc.)</li> <li>Acquired &amp; currently hold relevant security certifications (OSCP, OSWE, CEH, CISSP etc.)</li> <li>Contributed to open-source projects; sharing contributions or personal projects will help us in the evaluation process.</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/AF4C582402"
}
]