[
{
    "id": 1657641,
    "title": "Support Account Manager (AM 0321)",
    "company": "skroutz",
    "department": "Commercial",
    "location": "Athens",
    "description": "<p><strong>Who We Are</strong></p><p>At Skroutz, we have a vision to make everyone's life better by being incredibly trustworthy, trouble-free, and easy to use. We want to provide this experience not only to our users and partners, but also to our team members.</p><p>We believe that people drive our business forward and we strive daily to build a powerful team with people that share the same passion and enthusiasm for eCommerce and technology.</p><p><strong>What We Are Looking For</strong><br></p><p>We are looking for a <strong>Support Account Manager</strong> to join our <a href=\"https://www.skroutz.gr/careers#Account-Managers\" rel=\"nofollow noreferrer noopener\" class=\"external\">Account Managers</a> team. <br>Here at Skroutz, the Account Managers Team ensures client satisfaction and they are the point of contact for all our customers. They manage, process/ reply to customer inquiries and resolve customer complaints. They also provide support on commercial &amp; technical oriented issues in order to help e-shops optimize their presence in skroutz.gr.</p><p><br></p><p><strong>What We Want You To Do</strong></p><ul> <li>Manage a portfolio of Clients  </li> <li>Deal with all  customer support aspects of an e-shop participating in <a href=\"http://skroutz.gr/\" rel=\"nofollow noreferrer noopener\" class=\"external\">Skroutz.gr</a> </li> <li>Build and maintain strong, long-lasting relationship with the clients</li> <li>Ensure the timely and successful delivery of new solutions according to company's objectives</li> <li>Participates in continued education on new products and improved sales techniques</li> <li>Generate new business by using an existing network of industry contacts according to the commercial team strategic planning <br> </li> </ul>",
    "requirements": "<p><strong>What Skills and Experience You Will Need</strong></p><p><strong>Experience</strong></p><ul><li>Bachelor’s degree</li></ul><ul> <li>Two (2) years of prior experience in Client Support and/or in Account Management in eCommerce environment</li> <li>Familiarity with Internet and new technologies </li> <li>Familiarity with CRM system environment</li> </ul><p><strong>Skills</strong></p><ul><li>Highly organized and efficient</li></ul><ul> <li>Excellent business communication skills both orally and verbally</li> <li>Strong phone contact handling skills and active listening</li> </ul><ul><li>Self-motivated and able to work independently</li></ul><ul> <li>Critical and analytical thinking</li> <li>Experienced in a fast-paced environment</li> <li>Ability to multi-task, prioritize, and manage time effectively</li> <li>Team player mindset</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/41B479F477"
},
{
    "id": 1664115,
    "title": "Customer Support Agent - Marketplace (CS 0321)",
    "company": "skroutz",
    "department": "Marketplace",
    "location": "Athens",
    "description": "<p><strong>Who We Are</strong></p><p>At Skroutz, we have a vision to make everyone's life better by being incredibly trustworthy, trouble-free, and easy to use. We want to provide this experience not only to our users and partners, but also to our team members.</p><p>We believe that people drive our business forward and we strive daily to build a powerful team with people that share the same passion and enthusiasm for eCommerce and technology.</p><p><strong>What We Are Looking For</strong></p><p>We are looking for a Customer Support Agent to join our <a href=\"https://www.skroutz.gr/careers#Marketplace\" rel=\"nofollow noreferrer noopener\" class=\"external\">Marketplace</a> team. Our Marketplace Support team operates 7/7 (8 hours/shift on rotation, night shifts excluded), in order to timely handle incoming operational issues that our customers might face while using Skroutz Cart.</p><p>Here at Skroutz, our customers are at the heart of everything we do, which means that we try to get things right for them first time, every time. Our Marketplace team strives to make our customer's journey with us something we're proud of.</p><p><strong>What We Want You To Do</strong><br></p><ul> <li>Ensure high levels of customer satisfaction through excellent after sales service.</li> <li>Assess customers needs and provide assistance and information on delivery orders, or returns and refunds.</li> <li>Create positive rapport and working relationships with merchants by providing daily support and guidance.</li> <li>Manage relevant web content by enriching product descriptions, characteristics and specifications.</li> <li>Maintain business relations with partners.</li> </ul>",
    "requirements": "<h3>What skills and experience you will need</h3><p><strong>Experience</strong><br></p><ul><li>Bachelor’s degree</li></ul><ul> <li>Proven work experience in a customer support role in eCommerce environment</li> <li>Excellent PC and typing skills</li> <li>Familiarity with CRM systems, helpdesks and practices</li> </ul><p><strong>Skills</strong></p><ul> <li>Customer orientation and ability to adapt/respond to different types of characters</li> <li>Solid communication and interpersonal skills</li> <li>Ability to multi-task, prioritize, and manage time effectively</li> <li>Basic understanding of sales principles and customer service practices</li> <li>Working knowledge of customer and market dynamics and requirements</li> <li>A friendly and energetic personality with customer service focus</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/31FE389A24"
},
{
    "id": 1537998,
    "title": "Senior Site Reliability Engineer - Core Infrastructure (SRE 1220)",
    "company": "skroutz",
    "department": "Engineering",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by building the most trustworthy, trouble-free, and easy to use online discovery and shopping experience. We want to provide this experience not only to our users and partners, but also to our team members.<br>We believe that people drive our business forward and we strive daily to build a powerful team that shares the same passion and enthusiasm for eCommerce and technology.</p><p><strong>What we are looking<br></strong>We are looking for <strong>Site Reliability Engineers</strong> to join our Core Infrastructure SRE team! Our team lies right at the heart of Skroutz, making sure our services are always up and running, as a leading e-commerce platform should do.</p> <p>From your role, you'll be working together with a  group of people that sets up, scales and operates the infrastructure which supports <a href=\"https://www.skroutz.gr/\" rel=\"nofollow noreferrer noopener\" class=\"external\">skroutz.gr</a> and the systems that surround it. Our infrastructure is self-managed, and we run everything from bare-metal servers and virtual machines to network switches and routers. We operate at around ~500 hosts spanning 3 physical locations and running various workloads including virtualization, load balancing, databases, caching, storage, monitoring, and so on! We are passionate about free software and that’s why we chose to run Debian GNU/Linux everywhere, even on our core routers(!), always looking for ways to contribute back to the community.</p> <p>As a Sr. SRE, we want you to bring a developer's mindset to system administration by looking for ways to automate our manual work and scale our systems to meet tomorrow’s needs; to help us expand our infrastructure by considering and mitigating all possible things that could go wrong, before they do, by focusing on openness, reliability and performance.</p>",
    "requirements": "<p>For this role we are looking for experienced candidates who are proficient with the Linux stack, familiar with networking concepts, and have a good background in software engineering and infrastructure automation scripting; we use Python extensively and Go where we find it more suitable. We definitely don’t expect you to know all our systems from day one, our team will be there to answer all the questions and guide you on our infrastructure and the technologies we use. You might have a CS or an equivalent engineering degree, but you might not. This is definitely not among our top priorities; having prior working experience on high-throughput systems with high availability demands is mainly what we are interested in and not how you get there. </p> <p>Below there’s a list of items which you don't need to possess completely, but mostly cover the tools you’ll need for the work you’ll be mainly assigned.</p><p><strong>Your Skills and Experience</strong></p><ul> <li>More than 5 years managing Linux server infrastructures.</li> <li>In-depth understanding of Linux systems.</li> <li>Strong programming skills in at least one programming language such as Python, Go or Ruby.</li> <li>Experience in deploying, managing, and using observability tools such as Prometheus, Grafana and the ELK stack.</li> <li>Experience with web services (load balancing, HTTP, TLS); we use HAProxy, Varnish, and Nginx.</li> <li>Working knowledge of a configuration management system like Puppet, Ansible, and Chef.</li> <li>A sense of self-drive and solution-oriented attitude; is something broken? You can't help it unless you fix it!</li> <li>Ability to debug, optimize code, and automate routine tasks.</li> <li>Effective communication and written skills with a strong tendency to \"document as you go\"</li> </ul><p><strong>We will appreciate if you have</strong></p><ul> <li>Good knowledge of the Linux networking stack (netfilter, policy routing, advanced interface types)</li> <li>Some experience managing bare-metal hardware (PXE boot, working hands-on with computer hardware)</li> <li>Experience with Docker in a production environment including container orchestration (e.g. Kubernetes, Mesos, Nomad, etc)</li> <li>Personal projects or any shareable open source contributions which will help us during the evaluation process</li> </ul><p><br></p><p><strong>Examples of work you might undertake<br></strong></p><p>Here are some things we’ve worked on recently that might give you a better sense of what you’ll be doing day to day:</p><ul> <li>Maintain the infrastructure and services used by skroutz.gr and the systems that surround it.</li> <li>Improve the monitoring and visibility of our stack (services, networking, hosts), enhance our Prometheus Monitoring system and build new exporters and metrics for it.</li> <li>Design, setup, and execute the migration plan to our next generation of bulk storage pools using Ceph.</li> <li>Revamp our automated OS provisioning to make it more reliable and support newer OS releases.</li> <li>Maintain and be responsible for the upkeep and expansion of our datacenter infrastructure; this typically includes physical presence and working hands-on with computer hardware.</li> </ul><p><strong>Technologies you'll work with</strong></p><ul> <li>Debian Linux for our 500+ hosts (bare metal, VMs, and routers)</li> <li>Ganeti and Qemu for virtualization</li> <li>Puppet CE for configuration management and Ansible for switches</li> <li>Haproxy, Varnish, Nginx</li> <li>MariaDB, Elasticsearch, MongoDB, Redis, Druid</li> <li>Keepalived, BGP, OSPF</li> <li>Python, Go, Bash</li> <li>Kafka, Openstack Swift, and (soon) Ceph for storage</li> <li>ELK stack, Prometheus, Grafana, Icinga, Munin, Graphite and StatsD for observability</li> <li>Juniper QFX and EX-series network switches</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/485671FB1F"
},
{
    "id": 1664166,
    "title": "Customer Support Team Lead - Marketplace (CL 0321)",
    "company": "skroutz",
    "department": "Marketplace",
    "location": "Athens",
    "description": "<p><strong>Who We Are</strong></p><p>At Skroutz, we have a vision to make everyone's life better by being incredibly trustworthy, trouble-free, and easy to use. We want to provide this experience not only to our users and partners, but also to our team members.</p><p>We believe that people drive our business forward and we strive daily to build a powerful team with people that share the same passion and enthusiasm for eCommerce and technology.</p><p><strong>What We Are Looking For</strong></p> <p>We're looking for a Support Team Lead to provide guidance to Marketplace Customer Support agents to deliver superior customer service to Skroutz users and merchants. </p><p>You’ll work with a team of 5-6 agents who operate in rotation including weekends. Your business hours will also follow a rotation schedule so that you could provide the best support and guidance to team members during their afternoon shifts and weekends.</p><p>As a Team Lead, you will need to contribute to creating a healthy inclusive team environment, guided by honesty, trust, and safety. </p> <p><strong>Some things about you</strong></p><ul> <li>Υou are results driven, persistent and can work independently</li> <li>You can set a positive example and make sure your team is aligned with the department's goals and objectives</li> <li>You aim to maximize individuals’ abilities through clear expectations, feedback, coaching, and recognition</li> <li>You have an analytical mind and can identify process blockers that might be affecting the team work</li> </ul><p><strong>Responsibilities</strong></p><ul> <li>Schedule shifts</li> <li>Monitor incoming volumes and backlog during the shift and reallocate resources if necessary</li> <li>Answer questions from the team and provide guidance and feedback</li> <li>Address customer issues and complaints, taking ownership of escalations and following problems through to resolution</li> <li>Contribute to Support internal knowledge base</li> <li>Take on more complex operational support tasks</li> <li>Hold regular 1:1 meetings with each direct report to determine satisfaction and ensure team’s alignment</li> <li>Address team’s concerns or performance issues as needed</li> <li>Work with management to assess and improve processes and policies and minimize reactive support</li> <li>Provide constructive feedback to PMs for the development of support tools</li> </ul>",
    "requirements": "<h3>What skills and experience you will need</h3><p><strong>Experience</strong><br></p><ul><li>Bachelor’s degree</li></ul><ul> <li>Proven experience of successfully leading a support team for at least 1 year</li> <li>Familiarity with customer service tools and CRM systems </li> <li>Experience working with Zendesk will be considered a plus</li> </ul><p><strong>Skills</strong></p><ul> <li>Strong empathetic skills and the ability to put yourself in someone’s shoes</li> <li>Strong customer centricity and focus on customer experience and satisfaction</li> <li>Solid communication and interpersonal skills</li> <li>Ability to multitask, prioritize, and manage time effectively</li> <li>Analytical and problem-solving skills with customer service focus</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/66C7A34784"
},
{
    "id": 1264893,
    "title": "Join Skroutz team",
    "company": "skroutz",
    "department": "",
    "location": "Athens",
    "description": "<p>Do you want to be part of an amazingly growing environment but you don’t see an opening matching your profile? </p><p>Worry not!!!</p>",
    "requirements": "<p>Send us your CV telling us a few words about you, which team interests you and why you want to join Skroutz.</p><p>We will review your application and get back to you in the next two weeks. </p>",
    "link": "https://apply.workable.com/skroutz/j/4FFDCB70B4"
},
{
    "id": 1599460,
    "title": "Support Engineer - Marketplace (SEM 0221)",
    "company": "skroutz",
    "department": "Engineering",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by building the most trustworthy, trouble-free, and easy to use online discovery and shopping experience. We believe that people drive our business forward and we strive daily to build a powerful team that shares the same passion and enthusiasm for eCommerce and technology.</p><p><strong>What We Are Looking For</strong></p><p>We are looking for a Support Engineer with a solid technical background and a “get-things-done” attitude to join our <strong>Marketplace Support Engineering team</strong>.</p><p>Marketplace Support Engineering is part of Skroutz’s Marketplace division, which is responsible for offering the “buy directly through Skroutz” service and builds all the tools and infrastructure needed for order management and fulfillment: from adding a product to cart all the way to package delivery.</p><p>The Support Engineering team works closely with our Customer Support team on retaining an excellent buying and after-sales experience for our customers. With tens of thousands of orders/shipments being processed daily, there are multiple cases that need special handling. The team is responsible for handling operational tasks, providing insights, reports and troubleshooting cases that cannot be handled by existing support tools. </p><p><strong>Examples of work you might undertake</strong></p><ul> <li>Write scripts to manipulate order records for special cases that cannot be handled by support tools. </li> <li>Debug problematic purchase flows, reported by users.</li> <li>Assist our customer support team via mass operations.</li> <li>Provide operational reports for order shipments.</li> <li>Review and provide feedback on documentation and procedures in coordination with the rest of Marketplace Engineering teams</li> </ul>",
    "requirements": "<p><strong>Your Skills and Experience</strong></p><ul> <li>At least (2) year of working experience as a Software/Support Engineer in a professional setting.</li> <li>A solid CS background.</li> <li>Good analytical and problem-solving skills.</li> <li>Good communication skills and team spirit</li> </ul><p><strong>We will appreciate if you have</strong></p><ul> <li>Knowledge of Ruby/Ruby on Rails is a huge plus.</li> <li>Strong knowledge of database systems (relational, document-based, etc).</li> <li>Familiarity with software development lifecycle.</li> <li>Familiarity with OOP principles.</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/D7319BAF38"
},
{
    "id": 1633047,
    "title": "Frontend Developer - Skroutz Last Mile (FD 0321)",
    "company": "skroutz",
    "department": "Last Mile",
    "location": "Athens",
    "description": "<p>Skroutz Last Mile is “running” fast.</p><p>Our vision is to revolutionize the eCommerce Last Mile experience in Greece and become a prominent reason for the end to end consumer experience through <a href=\"https://www.skroutz.gr/\" rel=\"nofollow noreferrer noopener\" class=\"external\">Skroutz</a>. Our mission is to manage and distribute Skroutz Marketplace orders.</p><p>We provide the necessary technical tools in order to manage the fleet and deliver the orders to all Skroutz users quickly and efficiently.</p><p><strong>What we are looking for</strong></p><p>We are looking for a Frontend Engineer with a strong technical background and a “get-things-done” attitude who is eager to learn and apply new exciting technologies. You will be part of a small, talented and motivated team, tackle hard problems and have freedom to innovate and provide novel solutions.</p><p><strong>Technologies we use</strong></p><p>Our main stack is Ruby for the backend - using the Ruby on Rails framework - with Javascript (ES6) and VueJS for the frontend. Our main storage is a Postgres database. Our everyday goal is to pick the best tool possible in order to deliver optimal results!</p><p><strong>Examples of your daily tasks</strong><br></p><ul> <li>Build tools used by other members of the team or clients</li> <li>Identify inefficiencies on the software used by the team and provide better solutions</li> <li>Build efficient interfaces for managing complex operational problems</li> <li>Collaborate with experienced engineers</li> </ul>",
    "requirements": "<p><strong>Your Skills &amp; Experience</strong></p><p><strong>Experience</strong></p><ul> <li>At least (3) years of working experience as a Frontend Engineer in a professional setting</li> <li>Very good knowledge of JavaScript</li> <li>Experience with VueJS</li> <li>Experience with HTTP protocol and APIs</li> <li>Knowledge of current trends and best practices in front-end architecture, including performance optimization, accessibility, and usability</li> <li>Good understanding of UX design principles and methodologies</li> </ul><p><strong>Skills</strong></p><ul> <li>Intrigued by the product as much as by the technology</li> <li>Excellent analytical and problem-solving skills</li> <li>Easy going attitude, good communication skills, and team spirit</li> </ul><p><strong>We would appreciate if you have</strong></p><ul> <li>Familiarity with the latest JavaScript features (ES6+)</li> <li>Familiarity with Vuex</li> <li>Familiarity with CSS and Sass</li> <li>Comfort in TDD and other testing practices</li> <li>Worked with a version control system (preferably Git)</li> <li>An eye for detail and a sense of design </li> <li>Shareable open source contributions or personal projects will help us in the evaluation process</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/FEA634DB86"
},
{
    "id": 1633025,
    "title": "Backend Developer - Skroutz Last Mile (BD 0321)",
    "company": "skroutz",
    "department": "Last Mile",
    "location": "Athens",
    "description": "<p>Skroutz Last Mile is “running” fast. </p><p>Our vision is to revolutionize the eCommerce Last Mile experience in Greece and become a prominent reason for the end to end consumer experience through <a href=\"https://www.skroutz.gr/\" rel=\"nofollow noreferrer noopener\" class=\"external\">Skroutz</a>. Our mission is to manage and distribute Skroutz Marketplace orders. </p><p>We provide the necessary technical tools in order to manage the fleet and deliver the orders to all Skroutz users quickly and efficiently.</p><p><strong>What we are looking for</strong></p><p>We are looking for a Backend Engineer to join our Development team. You are a skilled Software Engineer who likes challenges. Our business has been growing fast in the last year and our systems need to scale, to sustain and promote this growth.</p><p>By joining us, you will work on implementing, scaling, and maintaining the code that powers our production systems. With great freedom to innovate, you will play a key role in creating the next generation courier experience.</p><p><strong>Examples of your daily tasks</strong></p><ul> <li>Improve and add new features to our HR / Asset Administration / Accounting automation and management platform which supports everyday courier service needs</li> <li>Work on the new platform which will be developed to support package delivery services</li> <li>Be part of interesting side projects developed to test and evaluate various business assumptions and scenarios related to any part of the company process</li> <li>Solve or handle technical problems of moderate scope and complexity, sometimes caused by third party services</li> <li>Testing and be confident for features/improvements before production release</li> </ul>",
    "requirements": "<p><strong>Your Skills &amp; Experience</strong></p><p><strong>Experience</strong></p><ul> <li>Professional experience (2+ years) working as a Software Engineer</li> <li>Very good knowledge of relational database systems</li> <li>Solid understanding of web and systems architecture</li> </ul><p><strong>Skills</strong></p><ul> <li>Teamwork</li> <li>Love for automating tasks</li> <li>Good understanding of possible bottlenecks and flaws during design or early implementation process</li> <li>Problem-solving attitude</li> </ul><p><strong>We would appreciate if you have</strong></p><ul> <li>Professional experience on Ruby on Rails framework is highly appreciated</li> <li>Familiarity with design patterns, object-oriented design and architectural principles</li> <li>Passion for TDD and other testing practices</li> <li>Exposure to production deployment or any kind of CI process</li> <li>Understanding or advanced knowledge of Linux Systems</li> <li>Experience using Docker</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/F53952C93C"
},
{
    "id": 1641101,
    "title": "Customer Care Agent - Skroutz Last Mile (CCA 0321)",
    "company": "skroutz",
    "department": "Last Mile",
    "location": "Athens",
    "description": "<p>Skroutz Last Mile is “running” fast.</p><p>Our vision is to revolutionize the eCommerce Last Mile experience in Greece and become a prominent reason for the end to end consumer experience through <a href=\"https://www.skroutz.gr/\" rel=\"nofollow noreferrer noopener\" class=\"external\">Skroutz</a>. Our mission is to manage and distribute Skroutz Marketplace orders.</p><p>We provide the necessary technical tools in order to manage the fleet and deliver the orders to all Skroutz users quickly and efficiently.</p><p><strong>What we are looking for</strong></p><p>We are looking for a Customer Care Agent.</p><p>You will act as a liaison, provide product/services information and resolve any emerging problems that our customers might face with accuracy and efficiency.</p><p>As a Customer Care Agent you are genuinely excited to help customers. You’re patient, empathetic, and passionately communicative. You love to talk. Problem-solving skills also come naturally. Finally, you are confident at troubleshooting and investigate if you don’t have enough information to resolve customer complaints.</p><p>The target is to ensure excellent service standards, respond efficiently to customer inquiries and maintain high customer satisfaction.</p><p><strong>Examples of your daily tasks</strong></p><ul> <li>Manage large amounts of incoming calls</li> <li>Identify and assess customers needs to achieve satisfaction</li> <li>Provide accurate, valid and complete information by using the right methods/tools</li> <li>Handle customer complaints, provide appropriate solutions and alternatives within the time limits</li> <li>Follow communication procedures, guidelines and policies</li> <li>Take the extra mile to satisfy customers needs</li> </ul>",
    "requirements": "<p><strong>Your Skills &amp; Experience</strong></p><p><strong>Experience</strong></p><ul> <li>Proven customer support experience or experience as a Client Care Agent</li> <li>Track record of over-achieving quota</li> <li>Familiarity with CRM systems and practices</li> <li>BSc in Communication or relevant field is considered a plus</li> </ul><p><strong>Skills</strong></p><ul> <li>Strong phone contact handling skills and active listening</li> <li>Customer orientation and ability to adapt/respond to different types of characters</li> <li>Excellent communication and presentation skills</li> <li>Ability to multi-task, prioritize, and manage time effectively</li> </ul><p><strong>We would appreciate if you are</strong></p><ul> <li>Ambitious and positive</li> <li>Tech-savvy</li> <li>Goal-oriented</li> <li>Teamwork lover</li> <li>Creative thinker</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/8ABC57C13B"
},
{
    "id": 1628958,
    "title": "Operations Officer - Skroutz Last Mile (OO 0321)",
    "company": "skroutz",
    "department": "Last Mile",
    "location": "Athens",
    "description": "<p>Skroutz Last Mile is “running” fast.</p><p>Our vision is to revolutionize the eCommerce Last Mile experience in Greece and become a prominent reason for the end to end consumer experience through <a href=\"https://www.skroutz.gr/\" rel=\"nofollow noreferrer noopener\" class=\"external\">Skroutz</a>. Our mission is to manage and distribute Skroutz Marketplace orders.</p><p>We provide the necessary technical tools in order to manage the fleet and deliver the orders to all Skroutz users quickly and efficiently.</p><p><strong>What we are looking for</strong></p><p>We are looking for an Operations Officer to organize, coordinate and support day to day operational activities. Your role is to ensure the smooth running of daily operations and handle drivers training.<br></p><p>Operations Officer duties and responsibilities include overseeing all operational procedures and suggesting ways to improve the daily operational process. Previous experience in a fast-paced environment or an administrative position is an advantage. A successful Operations Officer is able to prioritize tasks, take initiatives and handle multiple stressful situations, to accurately handle all administrative duties. The Operations Officer will report directly to the Head of Operations.</p><p><strong>Examples of your daily tasks</strong></p><ul> <li>Responsible for the daily check-in/check-out of Skroutz Delivery drivers</li> <li>Handle the training of recently appointed Skroutz Delivery drivers, as also re-train existing ones</li> <li>Successfully handle in real-time any incidents that may occur during the delivery process</li> <li>Suggest and apply improvements regarding the whole operational process and ensure the application of existing ones</li> <li>Cooperate with the Fleet Manager to ensure all vehicles are fully operational</li> <li>Liaise effectively with the Head of Operations and other members of the Operations Department</li> </ul>",
    "requirements": "<p><strong>Your Skills &amp; Experience</strong><br></p><p><strong>Experience</strong></p><ul> <li>Proven experience in a similar Operational position</li> <li>Experience in planning and managing projects and contributing to product innovation</li> <li>Experience in analyzing and maintaining operational data</li> <li>BSc in Management or relevant field is considered a strong plus</li> </ul><p><strong>Skills</strong></p><ul> <li>Hands-on mentality and proactive approach</li> <li>Ability to lead and take initiatives</li> <li>Excellent time management skills and ability to multi-task and prioritize work</li> <li>Attention to detail and problem solving skills</li> <li>Strong organizational and planning skills in a fast-paced environment</li> <li>Excellent communication skills</li> </ul><p><strong>We would appreciate if you are</strong></p><ul> <li>Ambitious and positive</li> <li>Tech-savvy</li> <li>Goal-oriented</li> <li>Teamwork lover</li> <li>Creative thinker</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/E27185CD1F"
},
{
    "id": 1642728,
    "title": "Business Operations Associate (BA 0321)",
    "company": "skroutz",
    "department": "Business Operations",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by building the most trustworthy, trouble-free, and easy to use online discovery and shopping experience. We want to provide this experience not only to our users and partners, but also to our team members.<br>We believe that people drive our business forward and we strive daily to build a powerful team that shares the same passion and enthusiasm for eCommerce and technology.</p><p><strong>What We Are Looking For</strong></p><p>We are looking for an Associate to join our newly-formed Business Operations team and help us execute high-impact, cross-functional projects that will enable us to build a disruptive eCommerce experience. As a member of this team, you will work on some of our most challenging problems alongside various different teams and will have the autonomy to both design the right strategy but also drive the execution, which is always the fun part.</p>",
    "requirements": "<p><strong>What you are expected to do</strong></p><ul> <li>Design and execute high-impact, cross-functional projects to grow our eCommerce proposition</li> <li>Be the go-to expert for several critical topics, depending on focus area</li> <li>Build data-driven frameworks to identify key opportunities and help us solve complex problems</li> <li>Perform cost-benefit analysis to support the decision making process</li> <li>Lead end-to-end analysis and research on critical questions and projects</li> <li>Perform process re-engineering to support operations transformation</li> <li>Team up with key stakeholders to help us define and deliver our OKRs</li> <li>Develop a deep understanding of how our end-to-end business works and come up with actionable recommendations</li> </ul><p><strong>Your skills and experience</strong></p><p><strong>Experience</strong></p><ul> <li>3-5 years of experience in Management Consulting / Business Controlling / Financial Advisory roles</li> <li>University Degree in Economics, Finance, Business Administration, Engineering, Sciences, or equivalent</li> </ul><p><strong>Skills</strong></p><ul> <li>Highly analytical and structured in your decision making process</li> <li>Strong problem solving skills</li> <li>Ability to deep-dive into complex problems and come back with clear actions</li> <li>Strong communication, alignment, and collaboration skills</li> <li>Ability to prioritise and handle multiple projects, project management experience will be preferred</li> <li>Passion for technology and for disrupting consumer/merchant experiences</li> <li>Humble, eager to learn, willing to roll-up sleeves when necessary</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/49AECC2872"
},
{
    "id": 1657972,
    "title": "Senior Software Engineer - Partners Platform (SSP 0321)",
    "company": "skroutz",
    "department": "Engineering",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by continuously improving the eCommerce experience in Greece. We are shifting our focus from the discovery phase as a price comparison platform, to the last mile delivery supporting both our consumers and partners at any stage of their journey to success.<br>We believe that people drive our business forward and we strive daily to build a powerful team with people that share the same passion and enthusiasm for eCommerce and technology.</p> <p>We are looking for experienced <strong>Senior Software Engineers</strong> with a strong technical background to scale our systems, improve the performance and reliability of our existing products and build the next-generation services that will expand the Skroutz ecosystem. </p><h3>Team</h3><p>The <strong>Partners Platform</strong> group at Skroutz is committed to offering trouble-free and seamless eCommerce experience to 8500 (and counting) merchants with over 5 Million products to grow their online or offline business.<br>We are organized in small, talented and fully fledged teams. Backend and Frontend Engineers, Tech Leads, Designers and Product Managers work closely together to tackle hard problems efficiently and build a strong merchant value proposition with new features and services.</p> <ul> <li>Our main product <a href=\"https://merchants.skroutz.gr/merchants\" rel=\"nofollow noreferrer noopener\" class=\"external\">Skroutz Merchants</a> is a collection of tools, dashboards and services that help merchants in their day-to-day workflow to unlock the full potential of Skroutz platform.</li> <li>We have built our own <a href=\"https://developer.skroutz.gr/analytics\" rel=\"nofollow noreferrer noopener\" class=\"external\">Skroutz Analytics</a> platform that aggregates eCommerce data from Skroutz partners’/shops’ websites and provides meaningful time series insights to merchants.</li> <li>We have developed our own efficient billing systems to meet our commercial needs, based on redirection traffic analysis (Cost Per Click) and order attribution (Cost Per Sale).</li> <li>Last but not least we provide a set of internal tools and automated processes alongside a well-integrated CRM to our beloved Commercial team helping them to support merchants at any stage of their journey to success.</li> </ul><h3>Examples of work you might undertake</h3><ul> <li>Improve order management in Skroutz Merchants to streamline merchants’ workflow.</li> <li>Introduce new features and products to Skroutz users in order to boost merchant value proposition.</li> <li>Work on our Analytics platform which handles over 30 Million requests per day and its adjacent services.</li> <li>Boost our Marketplace service offerings to further expand our eCommerce solution for brick-and-mortar shops.</li> <li>Develop and maintain our in-house affiliate management system.</li> <li>Enhance our billing algorithms, develop monitoring tools and build fraud detection mechanisms.</li> <li>Improve our Merchants' support operations with new services and automated processes.</li> </ul>",
    "requirements": "<p><strong>What skills and experience you will need</strong></p><ul> <li>At least (5) years of working experience as a Software Engineer in a professional setting.</li> <li>Excellent knowledge of database systems (relational, document-based, etc).</li> <li>Solid algorithmic and software engineering background.</li> <li>Solid understanding of web architecture.</li> <li>Intrigued by the product as much as by the technology.</li> <li>Excellent analytical and problem-solving skills.</li> <li>Excellent communication skills and team spirit.</li> </ul><h3></h3><p><strong>We will appreciate if you have</strong></p> <ul> <li>Good knowledge of Ruby/Ruby on Rails is a huge plus, but we believe that languages and frameworks can be learned; we care much more about your general engineering skills. </li> <li>Experience with JavaScript frameworks/UI libraries.</li> <li>Familiarity with OOP principles and design patterns.</li> <li>Comfort with TDD and other testing practices.</li> <li>Exposure to architectural patterns and the production system of a large, performance-intensive web application.</li> <li>Contributed to open-source projects.</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/32F0024498"
},
{
    "id": 1674857,
    "title": "Dispatcher & Driver Support Agent - Skroutz Last Mile (DSA - 0421)",
    "company": "skroutz",
    "department": "Last Mile",
    "location": "Athens",
    "description": "<p>Skroutz Last Mile is “running” fast.</p><p>Our vision is to revolutionize the eCommerce Last Mile experience in Greece and become a prominent reason for the end to end consumer experience through Skroutz. Our mission is to manage and distribute Skroutz Marketplace orders.</p><p>We provide the necessary technical tools in order to manage the fleet and deliver the orders to all Skroutz users quickly and efficiently.</p><p><strong>What we are looking for</strong></p><p>We are looking for a reliable Dispatcher to act as a communication point for emergency and non-emergency calls. The goal is to enable different parties to communicate well by ensuring the accurate and timely transmission of information. You receive requests, transmit messages and track vehicles. You are able to multi-task as well as take the appropriate action with minimum supervision. The ideal candidate is primarily an excellent communicator and remains calm and composed, especially in emergency situations. </p><p><br></p><p><strong>Examples of your daily tasks</strong></p><ul> <li>Receive emergency and non-emergency calls and record significant information</li> <li>Address problems and requests by transmitting information or providing solutions</li> <li>Receive and dispatch orders for products or deliveries</li> <li>Prioritize calls according to urgency and importance</li> <li>Use phone/computer to send our vehicles to appropriate locations</li> <li>Monitor the route and status of our vehicles to coordinate and prioritize their schedule</li> <li>Provide necessary information to drivers about orders, traffic, obstacles and requirements</li> </ul>",
    "requirements": "<p><strong>Skills &amp; Experience</strong></p><p><strong>Experience</strong></p><ul> <li>1+ year proven experience as dispatcher or relevant role</li> <li>Hands on experience working in stressful, emergency situations</li> <li>Knowledge of procedures and guidelines for emergency situations</li> <li>BA in Communication, Business or relevant field</li> </ul><p><strong>Skills</strong></p><ul> <li>Excellent organizational and multitasking abilities</li> <li>Active listener with excellent communication skills</li> <li>Sound judgement and critical thinking</li> <li>Ability to work effectively in a team environment and take initiative</li> </ul><p><strong>We would appreciate if you are</strong></p><ul> <li>Ambitious and positive</li> <li>Tech-savvy</li> <li>Goal-oriented</li> <li>Teamwork lover</li> <li>Creative thinker</li> </ul><ul> </ul>",
    "link": "https://apply.workable.com/skroutz/j/2C385639D4"
},
{
    "id": 1676784,
    "title": "Product Manager - Analytics Team (PMA 0421)",
    "company": "skroutz",
    "department": "Product Management",
    "location": "Athens",
    "description": "<p><strong>Who We Are</strong></p><p>At Skroutz, we have a vision to make everyone's life better by being incredibly trustworthy, trouble-free, and easy to use. We want to provide this experience not only to our users and partners, but also to our team members.</p><p>We believe that people drive our business forward and we strive daily to build a powerful team with people that share the same passion and enthusiasm for eCommerce and technology.</p><p><strong>What We Are Looking For</strong></p><p>Skroutz Analytics is our own data analytics platform, it currently covers more than 70% of our outgoing traffic. It is the foundation for two important services, a sophisticated data analytics platform and our main, commission-based, billing model.<br>As a billing model infrastructure, it provides all tools necessary to have a robust affiliation-like service.<br>As a sophisticated data analytics platform, it provides detailed insights in all important axes (per shop, category, product and device) that help us evaluate and optimize our effectiveness, both internally and externally.</p><p>We are looking for a motivated Product Manager who can understand and analyze the needs of our Analytics platform. We want people with a collaborative mindset that can drive their team to the best possible outcome.</p><p><strong>What We Want You To Do</strong></p><ul> <li>Work closely with software engineers to drive team projects, write technical stories and own agile processes for the team.</li> <li>Design, scope and manage the analytics and shops’ billing platform.</li> <li>Work closely with the technical support team for tackling shop integration issues while defining and refining the team processes.</li> <li>Communicate product related aspects to Skroutz partners</li> <li>Ensure Skroutz Analytics product aligns with the Skroutz.gr business model</li> <li>Direct the integration of technical aspects of products developed to ensure clarity and understanding</li> <li>Define key performance indicators and reporting for tracking product success</li> <li>Develop strategic plans and product roadmaps to help achieve business, financial and product quality objectives</li> <li>Communicate regularly with stakeholders to manage delivery of projects</li> </ul>",
    "requirements": "<p><strong>What Skills and Experience You Will Need</strong><br></p><ul> <li>At least 3 year of experience in a similar position</li> <li>Ability to collect and analyse data</li> <li>Great communication and organizational skills</li> <li>Experience working closely with development teams</li> <li>Attention to detail and good problem-solving skills</li> </ul><p><strong>We will Appreciate if you have</strong></p><ul> <li>Good knowledge of Google Analytics and related software</li> <li>Working experience on e-commerce products</li> <li>Ability to understand technical challenges and adjust specifications</li> <li>Working experience in a multi-functional environment<br> </li> </ul><p><em>Please note that this opening concerns an onsite job, located in Athens, Attica, Greece.</em></p>",
    "link": "https://apply.workable.com/skroutz/j/138A6C4CFA"
},
{
    "id": 1679975,
    "title": "Senior Product Designer - Partners Platform (SDP 0421)",
    "company": "skroutz",
    "department": "Design",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by being incredibly trustworthy, trouble-free, and easy to use. We want to provide this experience not only to our users and partners, but also to our team members.</p><p>We believe that people drive our business forward and we strive daily to build a powerful team with people that share the same passion and enthusiasm for eCommerce and technology.</p><h3>The Team<br> </h3><p>The Partners Platform group at Skroutz is committed to offering trouble-free and seamless eCommerce experience to 8500 (and counting) merchants with over 5 Million products to grow their online or offline business.<br>We are organized in small, talented and fully fledged teams. Backend and Frontend Engineers, Tech Leads, Designers and Product Managers work closely together to tackle hard problems efficiently and build a strong merchant value proposition with new features and services.</p><ul> <li>Our main product <a href=\"https://merchants.skroutz.gr/merchants\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Skroutz Merchants</a> is a collection of tools, dashboards and services that help merchants in their day-to-day workflow to unlock the full potential of Skroutz platform.</li> <li>We have built our own <a href=\"https://developer.skroutz.gr/analytics\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Skroutz Analytics</a> platform that aggregates eCommerce data from Skroutz partners’/shops’ websites and provides meaningful time series insights to merchants.</li> <li>We have developed our own efficient billing systems to meet our commercial needs, based on redirection traffic analysis (Cost Per Click) and order attribution (Cost Per Sale).</li> <li>Last but not least we provide a set of internal tools and automated processes alongside a well-integrated CRM to our beloved Commercial team helping them to support merchants at any stage of their journey to success.</li> </ul><p><strong>What We Are Looking For</strong></p><p>We are looking to hire a talented <strong>Product Designer</strong>, passionate about designing amazing yet simple user-centered experiences. You will be responsible for early-stage research and ideation, through implementation and iteration towards building products for the web, mobile web and apps.</p><p><strong>What you are expected to do</strong></p><ul> <li>Own all sides of design from concept to launch: storyboards, user flows, mockups, prototypes, and pixel perfect assets</li> <li>Conduct user studies, competitive research and usability tests</li> <li>Work closely with developers to see design through to implementation</li> <li>Request  early feedback through rapid prototypes or low fidelity wireframes </li> <li>Develop, maintain and create pixel perfect designs, mockups and specifications as needed, adhering to brand guidelines</li> <li>Maintain consistency in visual elements and ensure that our design system and philosophy is applied across the product</li> <li>Collaborate with internal teams; communicate thoughts and expertise to the rest of the team</li> <li>Stay on top of new technology and trends in mobile UI/UX designs</li> </ul>",
    "requirements": "<p><strong>Your Skills and Experience</strong><br></p><ul> <li>Minimum 3 years experience in a relevant position</li> <li>Excellent Portfolio of UI/UX design solutions across a spectrum of platforms and services</li> <li>Experience of working in a cross-discipline team environment</li> <li>Experience in user research, usability studies, personas</li> <li>Degree in Digital or Graphic Design (optional)</li> </ul><p><strong>Skills</strong></p><ul> <li>Proficiency in relevant creative tools (Sketch, Adobe XD, Figma)</li> <li>Familiarity with Abstract, Zeplin, Photoshop, Illustrator, prototyping tools</li> <li>Demonstrated experience working with a design system, its curation, maintenance, and dissemination</li> <li>Highly detail oriented with a drive for perfection down to the last pixel</li> <li>Self-motivated to prioritise and manage workload and meet critical project deadlines</li> <li>Positive attitude with a creative, solution-driven mindset</li> <li>Familiarity with HTML, CSS &amp; Javascript (optional)</li> </ul><p><em><strong>*Please make sure that you have included in your application a sample link of your UI/UX Portfolio. Applications with no portfolio will not be assessed further.</strong></em></p><p><em><strong>**</strong><em><strong>Please note that this opening concerns an onsite job, located in Athens, Attica, Greece.</strong></em></em></p>",
    "link": "https://apply.workable.com/skroutz/j/BAD0DFDB64"
},
{
    "id": 1672775,
    "title": "Product Content Editor (CE 0421)",
    "company": "skroutz",
    "department": "Content",
    "location": "Athens",
    "description": "<p><strong>Who We Are</strong></p><p>At Skroutz, we have a vision to make everyone's life better by being incredibly trustworthy, trouble-free, and easy to use. We want to provide this experience not only to our users and partners, but also to our team members.</p><p>We believe that people drive our business forward and we strive daily to build a powerful team with people that share the same passion and enthusiasm for eCommerce and technology.</p><p><strong>What We Are Looking For</strong><br></p><p>We are looking for Product Content Editors to join our Content teams. <br>Here at Skroutz, our Content team creates and maintains all necessary information around products based on our customers' feed and enriches product pages with product descriptions and specifications.</p><p><strong>What We Want You To Do</strong></p><ul> <li>Review incoming products to Skroutz database</li> <li>Group and assign products to relevant categories</li> <li>Enrich product descriptions and technical specifications</li> </ul>",
    "requirements": "<p><strong>What Skills and Experience You Will Need<br>Experience<br></strong></p><ul> <li>Minimum 1 year experience in a data entry position, preferably in an eCommerce environment</li> <li>Bachelor’s degree</li> <li>Proficiency in English, Certificate required</li> <li>Excellent computer use</li> <li>Familiarity with Internet and new technologies</li> </ul><p><strong>Skills</strong></p><ul> <li>Detail oriented and creative individual with the ability to manage and prioritize multiple tasks</li> <li>Critical thinking &amp; good observation skills</li> <li>Basic UX &amp; SEO knowledge and understanding</li> <li>Be highly organized and self-motivated</li> <li>Βe able to undertake research using a variety of sources</li> <li>Confident, outgoing personality with the ability to communicate effectively both in writing and verbally</li> <li>Collaborative, enthusiastic and inspirational</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/4F1890E9BB"
},
{
    "id": 1683246,
    "title": "Tech Lead Engineer - Partners Platform (TLP 0421)",
    "company": "skroutz",
    "department": "Engineering",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by continuously improving the eCommerce experience in Greece. We are shifting our focus from the discovery phase as a price comparison platform, to the last mile delivery supporting both our consumers and partners at any stage of their journey to success.<br>We believe that people drive our business forward and we strive daily to build a powerful team with people that share the same passion and enthusiasm for eCommerce and technology.</p> <p>We are looking for a <strong>Tech Lead Engineer</strong> with strong technical knowledge and experience in large scale applications. You will be leading a team of engineers to tackle hard problems, scale our systems and build the next-generation services that will expand the Skroutz ecosystem. Your main responsibility will be the team’s technical output.</p><h3>Team</h3><p>The <strong>Partners Platform</strong> group at Skroutz is committed to offering trouble-free and seamless eCommerce experience to 8500 (and counting) merchants with over 5 Million products to grow their online or offline business.<br>We are organized in small, talented and fully fledged teams. Backend and Frontend Engineers, Tech Leads, Designers and Product Managers work closely together to tackle hard problems efficiently and build a strong merchant value proposition with new features and services.</p> <ul> <li>Our main product <a href=\"https://merchants.skroutz.gr/merchants\" rel=\"nofollow noreferrer noopener\" class=\"external\">Skroutz Merchants</a> is a collection of tools, dashboards and services that help merchants in their day-to-day workflow to unlock the full potential of Skroutz platform.</li> <li>We have built our own <a href=\"https://developer.skroutz.gr/analytics\" rel=\"nofollow noreferrer noopener\" class=\"external\">Skroutz Analytics</a> platform that aggregates eCommerce data from Skroutz partners’/shops’ websites and provides meaningful time series insights to merchants.</li> <li>We have developed our own efficient billing systems to meet our commercial needs, based on redirection traffic analysis (Cost Per Click) and order attribution (Cost Per Sale).</li> <li>Last but not least we provide a set of internal tools and automated processes alongside a well-integrated CRM to our beloved Commercial team helping them to support merchants at any stage of their journey to success.</li> </ul><h3>Role</h3><ul> <li>Lead and mentor a small and talented team of engineers, both frontend and backend.</li> <li>Coordinate with other tech leads and participate in hiring and onboarding of new members.</li> <li>Be responsible for technical aspects of the product: technology decisions and choices, architecture, priorities, velocity, general project management.</li> <li>Work with Product Managers to specify requirements and deliverables.</li> <li>Hold regular 1-on-1 meetings with the team members and guide them to growth and success.</li> <li>Maintain a software stack that serves millions of requests per day.</li> </ul><h3>Examples of work you might undertake</h3><ul> <li>Improve order management in Skroutz Merchants to streamline merchants’ workflow.</li> <li>Introduce new features and products to Skroutz users in order to boost merchant value proposition.</li> <li>Work on our Analytics platform which handles over 30 Million requests per day and its adjacent services.</li> <li>Boost our Marketplace service offerings to further expand our eCommerce solution for brick-and-mortar shops.</li> <li>Develop and maintain our in-house affiliate management system.</li> <li>Enhance our billing algorithms, develop monitoring tools and build fraud detection mechanisms.</li> <li>Improve our Merchants' support operations with new services and automated processes.</li> </ul>",
    "requirements": "<p><strong>What skills and experience you will need</strong></p> <ul> <li>At least (5) years of working experience as a Software Engineer in a professional setting, designing and building high volume, scalable web applications.</li> <li>Solid algorithmic and software engineering background.</li> <li>Excellent understanding of web architecture.</li> <li>Excellent knowledge of at least one programming language. We work mostly in Ruby, but we believe that languages can be learned; we care much more about your general engineering skills.</li> <li>Very good knowledge and understanding of SQL and database systems.</li> <li>Experience with a version control system (preferably Git) and a CI workflow.</li> <li>Tech lead and people management experience.</li> <li>Passion for readable, maintainable, testable, scalable and performant code.</li> <li>Ability to navigate around a relatively large existing codebase and cooperatively improve it.</li> <li>Contribution to open source projects is huge plus.</li> <li>Team spirit and easy going attitude.</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/489A21A90C"
},
{
    "id": 1683241,
    "title": "Software Engineer - Partners Platform (SEP 0421)",
    "company": "skroutz",
    "department": "Engineering",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by continuously improving the eCommerce experience in Greece. We are shifting our focus from the discovery phase as a price comparison platform, to the last mile delivery supporting both our consumers and partners at any stage of their journey to success.<br>We believe that people drive our business forward and we strive daily to build a powerful team with people that share the same passion and enthusiasm for eCommerce and technology.</p> <p>We are looking for passionate <strong>Software Engineers</strong> with a strong technical background and a “get-things-done” attitude, who are eager to learn new exciting technologies.</p><h3>Team</h3><p>The <strong>Partners Platform </strong>group at Skroutz is committed to offering trouble-free and seamless eCommerce experience to 8500 (and counting) merchants with over 5 Million products to grow their online or offline business.<br>We are organized in small, talented and fully fledged teams. Backend and Frontend Engineers, Tech Leads, Designers and Product Managers work closely together to tackle hard problems efficiently and build a strong merchant value proposition with new features and services.</p> <ul> <li>Our main product <a href=\"https://merchants.skroutz.gr/merchants\" rel=\"nofollow noreferrer noopener\" class=\"external\">Skroutz Merchants</a> is a collection of tools, dashboards and services that help merchants in their day-to-day workflow to unlock the full potential of Skroutz platform.</li> <li>We have built our own <a href=\"https://developer.skroutz.gr/analytics\" rel=\"nofollow noreferrer noopener\" class=\"external\">Skroutz Analytics</a> platform that aggregates eCommerce data from Skroutz partners’/shops’ websites and provides meaningful time series insights to merchants.</li> <li>We have developed our own efficient billing systems to meet our commercial needs, based on redirection traffic analysis (Cost Per Click) and order attribution (Cost Per Sale).</li> <li>Last but not least we provide a set of internal tools and automated processes alongside a well-integrated CRM to our beloved Commercial team helping them to support merchants at any stage of their journey to success.</li> </ul><h3>Examples of work you might undertake</h3><ul> <li>Improve order management in Skroutz Merchants to streamline merchants’ workflow.</li> <li>Introduce new features and products to Skroutz users in order to boost merchant value proposition.</li> <li>Work on our Analytics platform which handles over 30 Million requests per day and its adjacent services.</li> <li>Boost our Marketplace service offerings to further expand our eCommerce solution for brick-and-mortar shops.</li> <li>Develop and maintain our in-house affiliate management system.</li> <li>Enhance our billing algorithms, develop monitoring tools and build fraud detection mechanisms.</li> <li>Improve our Merchants' support operations with new services and automated processes.</li> </ul>",
    "requirements": "<p><strong>What skills and experience you will need</strong></p> <ul> <li>A solid CS background.</li> <li>Good understanding of web architecture.</li> <li>Good knowledge of database systems.</li> <li>Intrigued by the product as much as by the technology.</li> <li>Analytical and problem-solving skills.</li> <li>Team spirit and can-do attitude.</li> </ul> <p><strong>We will appreciate if you have</strong></p> <ul> <li>Knowledge of any web framework, like <a href=\"https://rubyonrails.org/\" rel=\"nofollow noreferrer noopener\" class=\"external\">Ruby on Rails</a>, is a huge plus.</li> <li>Familiarity with OOP principles and design patterns.</li> <li>Comfort with TDD and other testing practices.</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/8F54D14F3E"
},
{
    "id": 1683105,
    "title": "Product Designer - Mobile (PD 0421)",
    "company": "skroutz",
    "department": "Design",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by being incredibly trustworthy, trouble-free, and easy to use. We want to provide this experience not only to our users and partners but also to our team members.</p><p>We believe that people drive our business forward and we strive daily to build a powerful team with people that share the same passion and enthusiasm for eCommerce and technology.</p><p><strong>What We Are Looking For</strong><br></p><p>We are looking for a talented <strong>Product Designer</strong>, passionate about designing amazing yet simple user-centered experiences for our <strong>Mobile Apps</strong>. The ideal candidate would be responsible for research, analyze, and design end-to-end beautiful interfaces throughout the entire design workflow. From competitive analysis and mapping out user journeys to building meaningful design systems and creating high fidelity mockups.<br></p><p><strong>What you are expected to do</strong></p><ul> <li>Analyze objectives to develop designs that meet our company goals</li> <li>Review the performance of a release, identify learnings and find ways to enhance it. We believe in constant improvement ;)</li> <li>Conduct user studies, competitive research, usability &amp; iterative A/B tests. We love turning the complexity of a chaotic world into the simplicity of a great solution that truly solves customer needs</li> <li>Own all sides of design from concept to launch: storyboards, user flows, mockups, prototypes, and pixel perfect assets</li> <li>Maintain and constantly improve our design system and philosophy across the product</li> <li>Think product strategy at a high level and clearly articulate design decisions</li> <li>Collaborate in a cross-functional team; communicate thoughts and expertise to the rest of the members</li> <li>Stay on top of new technology and trends in mobile UI/UX design</li> </ul>",
    "requirements": "<p><strong>Your Skills and Experience</strong><br></p><ul> <li>Minimum 3 years experience in a relevant position</li> <li>Excellent Portfolio of UI/UX design solutions across a spectrum of platforms<br>and services</li> <li>Strong knowledge of design processes and methodology, particularly as applied to mobile products</li> <li>Understanding the specifications of each platform (Android, iOS)</li> </ul><ul> <li>Proficiency in relevant design tools (Figma, Sketch, Adobe XD)</li> <li>Familiarity with Prototyping tools, would be considered as a plus (Framer, Principle, Protopie) </li> <li>Highly detail oriented with a drive for perfection down to the last pixel</li> <li>Strong sense of prioritisation and workload management</li> <li>Positive attitude, team player, with a creative, solution-driven mindset</li> </ul><p><strong><br><em>*Please make sure that you have included in your application a sample link of your UI/UX Portfolio. Applications with no portfolio will not be assessed further.</em></strong></p><p><em><strong>**Please note that this opening concerns an onsite job, located in Athens, Attica, Greece.</strong></em></p>",
    "link": "https://apply.workable.com/skroutz/j/0976E896B3"
},
{
    "id": 1685514,
    "title": "Senior Backend Engineer - Discovery (SBD 0421)",
    "company": "skroutz",
    "department": "Engineering",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by building the most trustworthy, trouble-free, and easy to use online discovery and shopping experience. We want to provide this experience not only to our users and partners, but also to our team members.<br>We believe that people drive our business forward and we strive daily to build a powerful team that shares the same passion and enthusiasm for eCommerce and technology.<br>The Discovery team is responsible for shaping the product discovery experience for all users. We help users navigate and filter through millions of products in thousands of categories and assist them in figuring out how their specific needs will be met. To be successful, we have to translate the optimal user experience to a technological product, designing and implementing multiple experiments along the way. Our systems must be fast and reliable, often supporting more than 100k requests per minute.</p><p>We are looking for <strong>Senior Software Engineers</strong> with strong technical knowledge and experience in large scale applications. You will be part of a small, talented and motivated team, tackle hard problems and improve the experience of millions of customers.</p><p><strong>Examples of work you might undertake</strong></p><ul> <li>Create the infrastructure to support the specific UX needs of each product category, whether it is fashion, home furniture or technology</li> <li>Assist in the development of an excellent book shopping experience</li> <li>Implement and maintain the best product reviewing system in the industry</li> <li>Create or improve complex product filtering mechanisms such as sizes or colours</li> <li>Run experiments and track several metrics to measure success</li> <li>Maintain a software stack that serves millions of requests per day</li> </ul>",
    "requirements": "<p><strong>Your skills and experience</strong></p><ul> <li>At least five years of working experience as a Software Engineer in a professional setting, designing and building high volume, scalable web applications from end to end</li> <li>Solid algorithmic and software engineering background</li> <li>Excellent understanding of web architecture</li> <li>Excellent knowledge of at least one programming language. We work mostly in Ruby, but we believe that languages can be learned; we care much more about your general engineering skills</li> <li>Very good knowledge and understanding of SQL and database systems</li> <li>Passion for readable, maintainable, testable, scalable and performant code</li> <li>Ability to navigate around a relatively large existing codebase and cooperatively improve it</li> <li>Experience with a version control system (preferably Git) and a CI workflow</li> <li>Contribution to open source projects is huge plus</li> <li>Team spirit and easy going attitude</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/6E511B543A"
},
{
    "id": 1685483,
    "title": "Backend Engineer - Marketplace (BEM 0421)",
    "company": "skroutz",
    "department": "Engineering",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by building the most trustworthy, trouble-free, and easy to use online discovery and shopping experience. We believe that people drive our business forward and we strive daily to build a powerful team that shares the same passion and enthusiasm for eCommerce and technology.</p><p><strong>What We Are Looking For</strong></p><p>We are looking for Software Engineers with a strong technical background and a “get-things-done” attitude to join our <a href=\"https://www.skroutz.gr/careers#Marketplace\" rel=\"nofollow noreferrer noopener\" class=\"external\">Marketplace</a> team. Our focus is to deliver quality products, making the right trade-offs along the way.<br></p><p><strong>Examples of work you might undertake</strong></p><ul> <li>Implement new features for expanding our Marketplace offering to all categories of Skroutz</li> <li>Help our customer support team scale by automating procedures or improving existing ones</li> </ul><ul> <li>Improve our checkout flow to provide the best possible buying experience</li> </ul><ul> <li>Optimize our cart algorithm for calculating the best possible shopping solution for a certain basket</li> </ul><ul> <li>Optimize and monitor performance to keep up with our rapid-scaling Marketplace orders volume (over 2 million orders fulfilled, 10x YoY growth)</li> </ul><ul> <li>Implement third-party API integrations to support multiple shipping and payment options, support tools, financial tools etc</li> </ul>",
    "requirements": "<p><strong>Your Skills and Experience</strong></p><ul> <li>At least (1) year of working experience as a Software Engineer in a professional setting</li> <li>A solid CS background</li> <li>Intrigued by the product as much as by the technology</li> <li>Good analytical and problem-solving skills</li> <li>Good communication skills and team spirit</li> </ul><p><strong>We will appreciate if you have</strong></p><ul> <li>Good knowledge of Ruby/Ruby on Rails is a huge plus</li> <li>Experience with JavaScript frameworks/UI libraries (preferably React)</li> <li>Solid understanding of web architecture</li> <li>Strong knowledge of database systems (relational, document-based, etc)</li> <li>Familiarity with OOP principles and design patterns</li> <li>Comfort with TDD and other testing practices</li> <li>Exposure to architectural patterns and the production system of a large, performance-intensive web application</li> <li>Contributed to open-source projects</li> <li>Shareable open source contributions or personal projects which will help us in the evaluation process</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/17E73C2BE9"
},
{
    "id": 1685445,
    "title": "Backend Engineer - Discovery (BD 0421)",
    "company": "skroutz",
    "department": "Engineering",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by building the most trustworthy, trouble-free, and easy to use online discovery and shopping experience. We want to provide this experience not only to our users and partners, but also to our team members.<br>We believe that people drive our business forward and we strive daily to build a powerful team that shares the same passion and enthusiasm for eCommerce and technology.</p><p>The Discovery team is responsible for shaping the product discovery experience for all users. We help users navigate and filter through millions of products in thousands of categories and assist them in figuring out how their specific needs will be met. To be successful, we have to translate the optimal user experience to a technological product, designing and implementing multiple experiments along the way. Our systems must be fast and reliable, often supporting more than 100k requests per minute.</p> <p>We are looking for <strong>Software Engineers</strong> with a strong technical background and interest in building successful products and systems. You will be part of a small, talented and motivated team, tackle hard problems and improve the experience of millions of customers.</p><p><strong>Examples of work you might undertake</strong></p><ul> <li>Create the infrastructure to support the specific UX needs of each product category, whether it is fashion, home furniture or technology</li> <li>Assist in the development of an excellent book shopping experience</li> <li>Implement and maintain the best product reviewing system in the industry</li> <li>Create or improve complex product filtering mechanisms such as sizes or colours</li> <li>Run experiments and track several metrics to measure success</li> <li>Maintain a software stack that serves millions of requests per day</li> </ul>",
    "requirements": "<p><strong>Your skills and experience</strong></p><ul> <li>Solid algorithmic and software engineering background</li> <li>Solid understanding of web architecture</li> <li>Very good knowledge of at least one programming language. We work mostly in Ruby, but we believe that languages can be learned; we care much more about your general engineering skills</li> <li>Very good knowledge and understanding of SQL and database systems</li> <li>Passion for readable, maintainable, testable, scalable and performant code</li> <li>Ability to navigate around a relatively large existing codebase and cooperatively improve it through code reviews</li> <li>Experience with a version control system (preferably Git) and a CI workflow</li> <li>Team spirit and easy going attitude</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/A3C44336E8"
},
{
    "id": 1685439,
    "title": "Backend Engineer - Content (BEC 0421)",
    "company": "skroutz",
    "department": "Engineering",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by building the most trustworthy, trouble-free, and easy to use online discovery and shopping experience. We want to provide this experience not only to our users and partners, but also to our team members.<br> We believe that people drive our business forward and we strive daily to build a powerful team that shares the same passion and enthusiasm for eCommerce and technology.</p><p><strong>What We Are Looking For</strong></p><p>We are looking for Software Engineers with a strong technical background and a “get-things-done” attitude who are eager to learn new exciting technologies to join our <a href=\"https://www.skroutz.gr/careers#Content\" rel=\"nofollow noreferrer noopener\" class=\"external\">Content</a>.<br></p><p><strong>Examples of work you might undertake</strong></p><ul> <li>Optimize our product categorization and clustering pipelines, used to classify over 30k new products daily.</li> <li>Improve the extraction of product attributes (e.g. brand, color, model number) from product titles, descriptions or other semi-structured data.</li> <li>Develop our content management system (codenamed \"Earth\"), used to maintain specs, descriptions and media for over 10M products.</li> <li>Work on product sizes detection and conversions across 150+ fashion categories, enabling filters and size guides on the Skroutz platform.</li> <li>Help automate any time-consuming manual procedure that a machine can perform more efficiently.</li> </ul>",
    "requirements": "<p><strong>Your Skills and Experience</strong></p><ul> <li>At least (1) year of working experience as a Software Engineer in a professional setting</li> <li>A solid CS background</li> <li>Intrigued by the product as much as by the technology</li> <li>Good analytical and problem-solving skills</li> <li>Good communication skills and team spirit</li> </ul><p><strong>We will appreciate if you have</strong></p><ul> <li>Good knowledge of Ruby/Ruby on Rails is a huge plus</li> <li>Solid understanding of web architecture</li> <li>Strong knowledge of database systems (relational, document-based, etc)</li> <li>Familiarity with OOP principles and design patterns</li> <li>Comfort with TDD and other testing practices</li> <li>Exposure to architectural patterns and the production system of a large, performance-intensive web application</li> <li>Contributed to open-source projects</li> <li>Shareable open source contributions or personal projects which will help us in the evaluation process</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/DB6A2FBEB9"
},
{
    "id": 1676788,
    "title": "Sales Development Representative (SDR 0421)",
    "company": "skroutz",
    "department": "Sales",
    "location": "Athens",
    "description": "<p><strong>Who We Are</strong><br></p><p>At Skroutz, we have a vision to make everyone's life better by being incredibly trustworthy, trouble-free, and easy to use. We want to provide this experience not only to our users and partners, but also to our team members.</p><p>We believe that people drive our business forward and we strive daily to build a powerful team with people that share the same passion and enthusiasm for eCommerce and technology.</p><p><strong>What We Are Looking For</strong><br>The Active Sales team at Skroutz is responsible for communicating with the merchants wanting to add an additional sales channel to their existing sales process while building successful partnerships with shops meeting platform requirements.<br></p><p>We are looking for a Sales Development Representative to join our Active Sales team. As Sales Development Representative you are responsible for exploring new opportunities for collaboration with SMEs who are interested in adding a new sales channel to their sales plan. They speak with potential customers, either from inbound or outbound sources and they fuel the Account Executive team with leads.</p><p><strong> What We Want You To Do<br></strong></p><ul> <li>Reaching out to prospects by email and phone</li> <li>Qualifying inbound or outbound leads, creating opportunities and next steps for Account Executives</li> <li>Creating a positive first impression with our prospects and customers by providing a world class experience</li> <li>Logging  sales activity and monitoring performance</li> </ul>",
    "requirements": "<h3>What skills and experience you will need</h3><p><strong>Experience</strong></p><ul> <li>BA/BS degree required</li> <li>1-2 years work experience preferred, preferably in a process-driven team environment</li> </ul><p><strong>Skills</strong></p><ul> <li>Excellent English command</li> <li>Excellent communication skills, both verbal and written</li> <li>A strong desire to start a sales career</li> </ul><ul> <li>High energy, self starter and a positive attitude</li> <li>Ability to prioritize, multitask, and manage time productively</li> <li>Patience, empathy and persistence in a customer-facing context</li> <li>Diligence and enthusiasm; you appreciate quality and deliver it on a daily basis</li> <li>Team spirit; you seriously care about what you do and appreciate collaborating with your colleagues</li> </ul><p><br></p>",
    "link": "https://apply.workable.com/skroutz/j/0291612012"
},
{
    "id": 1701102,
    "title": "iOS Developer - Discovery (IDD 0421)",
    "company": "skroutz",
    "department": "Engineering",
    "location": "Athens",
    "description": "<p>The <strong>Discovery team</strong> is responsible for shaping the product discovery experience for all users. We help users navigate and filter through millions of products in thousands of categories and assist them in figuring out how their specific needs will be met. To be successful, we have to translate the optimal user experience to a technical product, designing and implementing multiple experiments along the way. Our products and systems must be fast and reliable, often supporting more than 100k requests per minute.</p><p>After some years of successfully launching and constantly improving our Android and iOS apps, currently used by hundreds of thousands of users, we are now ready to take them to the next level! Our vision is to make Skroutz a mobile-first company where apps will play a central role in revolutionizing the experience of buying online! If having “a billion products at your fingertips” sounds exciting and challenging to you, you may be just the kind of person we’re looking for!</p><p><strong>What We Are Looking For</strong></p><p>We are growing our mobile engineering team and are looking for iOS Developers with...</p><ul> <li>strong technical background</li> <li>“get-things-done” attitude</li> <li>self-motivation</li> <li>team spirit</li> <li>attention to details</li> <li>thirst for knowledge</li> <li>desire to make an impact</li> </ul><p><strong>Examples of work you might undertake</strong></p><ul> <li>Work in an <em>agile cross-functional team</em> with other <em>mobile and web developers</em>, API engineers, and UI/UX designers to develop and maintain our iOS app, building new features and shaping our product</li> <li>Develop and enrich the app with features available on the web (such as cross-category search results, Q&amp;A, user reviews’ rich content, offers, and many more) and pave the way for an innovative mobile-first experience</li> <li>Track down and fix performance bottlenecks and bugs, improving the reliability of our iOS app</li> <li>Employ A/B testing to measure the performance of different approaches to features and implementations, providing the best UX for our users</li> <li>Review and evaluate code from fellow team members, exchanging feedback that makes everyone a better engineer</li> <li>Collaborate with the rest of the iOS developers as part of the <em>company-wide iOS chapter</em> </li> </ul>",
    "requirements": "<p><strong>Your Skills and Experience</strong></p><ul> <li>At least 2 (two) years of experience as an iOS mobile developer</li> <li>Proven track record of building and shipping iOS apps in the Apple App Store</li> <li>Deep knowledge of Objective-C and Swift</li> <li>Deep understanding of iOS frameworks and development processes</li> <li>Knowledge of OO design principles, software and iOS design patterns</li> <li>Expert knowledge of asynchronous programming (GCD)</li> <li>Experience with developing highly-performant code and the ability to diagnose performance bottlenecks</li> <li>Fluency with web service architectures and technologies: JSON and RESTful APIs</li> <li>Passion for readable, maintainable and performant code</li> <li>Familiarity with common software engineering tools and practices (Git, Unit Testing, CI)</li> <li>Some familiarity with design/UX principles</li> <li>Intrigued by the product as much as by technology</li> </ul><p><strong>We will appreciate if you have</strong></p><ul> <li>Projects you’ve built/contributed to (e.g. Github account)</li> <li>Knowledge of creating and maintaining private pods</li> <li>Optimization of data usage over mobile networks</li> <li>Familiarity with deployment using Fastlane</li> <li>Familiarity with agile methodologies and practices</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/E410353436"
},
{
    "id": 1701093,
    "title": "Android Developer - Discovery (ADD 0421)",
    "company": "skroutz",
    "department": "Engineering",
    "location": "Athens",
    "description": "<p>The <strong>Discovery team </strong>is responsible for shaping the product discovery experience for all users. We help users navigate and filter through millions of products in thousands of categories and assist them in figuring out how their specific needs will be met. To be successful, we have to translate the optimal user experience to a technical product, designing and implementing multiple experiments along the way. Our products and systems must be fast and reliable, often supporting more than 100k requests per minute.</p><p>After some years of successfully launching and constantly improving our Android and iOS apps, currently used by hundreds of thousands of users, we are now ready to take them to the next level! Our vision is to make Skroutz a mobile-first company where apps will play a central role in revolutionizing the experience of buying online! If having “a billion products at your fingertips” sounds exciting and challenging to you, you may be just the kind of person we’re looking for!</p><p><strong>What We Are Looking For</strong></p><p>We are growing our mobile engineering team and are looking for Android Developers with...</p><ul> <li>strong technical background</li> <li>“get-things-done” attitude</li> <li>self-motivation</li> <li>team spirit</li> <li>attention to details</li> <li>thirst for knowledge</li> <li>desire to make an impact</li> </ul><p><strong>Examples of work you might undertake</strong></p><ul> <li>Work in an <em>agile cross-functional team</em> with other <em>mobile and web developers</em>, API engineers, and UI/UX designers to develop and maintain our Android app, building new features and shaping our product</li> <li>Develop and enrich the app with features available on the web (such as cross-category search results, Q&amp;A, user reviews’ rich content, offers, and many more) and pave the way for an innovative mobile-first experience</li> <li>Track down and fix performance bottlenecks and bugs, improving the reliability of our Android app</li> <li>Employ A/B testing to measure the performance of different approaches to features and implementations, providing the best UX for our users</li> <li>Review and evaluate code from fellow team members, exchanging feedback that makes everyone a better engineer</li> <li>Collaborate with the rest of the Android developers as part of the <em>company-wide Android chapter</em> </li> </ul>",
    "requirements": "<p><strong>Your Skills and Experience</strong></p><ul> <li>At least 2 (two) years of experience as an Android mobile developer</li> <li>Proven track record of building and shipping Android apps in the Google Play Store</li> <li>Deep knowledge of Java and Kotlin</li> <li>Good knowledge of the Android SDK (Components, Lifecycles, Layouts, Fragments, Animations, Drawables)</li> <li>Knowledge of OO design principles, software and Android design patterns</li> <li>Familiarity with modern Android architectures (MVP, MVVM)</li> <li>Expert knowledge of asynchronous programming</li> <li>Experience with developing highly-performant code and the ability to diagnose performance bottlenecks</li> <li>Fluency with web service architectures and technologies: JSON and RESTful APIs</li> <li>Passion for readable, maintainable and performant code</li> <li>Familiarity with common software engineering tools and practices (Git, Unit Testing, CI)</li> <li>Some familiarity with design/UX principles</li> <li>Intrigued by the product as much as by technology</li> </ul><p><strong>We will appreciate if you have</strong></p><ul> <li>Projects you’ve built/contributed to (e.g. Github account)</li> <li>Optimization of data usage over mobile networks</li> <li>Knowledge of Reactive/Functional programming</li> <li>Knowledge of SQLite</li> <li>Familiarity with agile methodologies and practices</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/BFA5D43203"
},
{
    "id": 1705636,
    "title": "Senior Product Designer - Growth (SDG 0421)",
    "company": "skroutz",
    "department": "Design",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by being incredibly trustworthy, trouble-free, and easy to use. We want to provide this experience not only to our users and partners, but also to our team members.</p><p>We believe that people drive our business forward and we strive daily to build a powerful team with people that share the same passion and enthusiasm for eCommerce and technology.</p><p><strong>What We Are Looking For</strong></p><p>We are looking to hire a talented <strong>Product Designer</strong>, passionate about designing amazing yet simple user-centered experiences. You will be responsible for early-stage research and ideation, through implementation and iteration towards building products for the web, mobile web and apps.</p><p><strong>What you are expected to do</strong></p><ul> <li>Own all sides of design from concept to launch: storyboards, user flows, mockups, prototypes, and pixel perfect assets</li> <li>Conduct user studies, competitive research and usability tests</li> <li>Work closely with developers to see design through to implementation</li> <li>Request  early feedback through rapid prototypes or low fidelity wireframes </li> <li>Develop, maintain and create pixel perfect designs, mockups and specifications as needed, adhering to brand guidelines</li> <li>Maintain consistency in visual elements and ensure that our design system and philosophy is applied across the product</li> <li>Collaborate with internal teams; communicate thoughts and expertise to the rest of the team</li> <li>Stay on top of new technology and trends in mobile UI/UX designs</li> </ul>",
    "requirements": "<p><strong>Your Skills and Experience</strong><br></p><ul> <li>Minimum 3 years experience in a relevant position</li> <li>Excellent Portfolio of UI/UX design solutions across a spectrum of platforms and services</li> <li>Experience of working in a cross-discipline team environment</li> <li>Experience in user research, usability studies, personas</li> <li>Degree in Digital or Graphic Design (optional)</li> </ul><p><strong>Skills</strong></p><ul> <li>Proficiency in relevant creative tools (Sketch, Adobe XD, Figma)</li> <li>Familiarity with Abstract, Zeplin, Photoshop, Illustrator, prototyping tools</li> <li>Demonstrated experience working with a design system, its curation, maintenance, and dissemination</li> <li>Highly detail oriented with a drive for perfection down to the last pixel</li> <li>Self-motivated to prioritise and manage workload and meet critical project deadlines</li> <li>Positive attitude with a creative, solution-driven mindset</li> <li>Familiarity with HTML, CSS &amp; Javascript (optional)</li> </ul><p><em><strong>*Please make sure that you have included in your application a sample link of your UI/UX Portfolio. Applications with no portfolio will not be assessed further.</strong></em></p><p><em><strong>**</strong><em><strong>Please note that this opening concerns an onsite job, located in Athens, Attica, Greece.</strong></em></em></p>",
    "link": "https://apply.workable.com/skroutz/j/502F1268C4"
},
{
    "id": 1706471,
    "title": "Customer Support Operations Specialist (CO 0421)",
    "company": "skroutz",
    "department": "Marketplace",
    "location": "Athens",
    "description": "<p><strong>Who We Are</strong><br>At Skroutz, we have a vision to make everyone's life better by being incredibly trustworthy, trouble-free, and easy to use. We want to provide this experience not only to our users and partners, but also to our team members.</p><p>We believe that people drive our business forward and we strive daily to build a powerful team with people that share the same passion and enthusiasm for eCommerce and technology.<br></p><p><strong>What We Are Looking For<br></strong></p><p> We are looking for a <strong>C</strong><strong>ustomer Support Operations Specialist</strong> to help our <a href=\"https://www.skroutz.gr/careers#Marketplace\" rel=\"nofollow noreferrer noopener\" class=\"external\">Marketplace</a> support team be more productive and deliver excellent service to Skroutz users.</p><p>The primary job of the role is to create an environment for the support team in which they can do their best work and are not distracted or delayed by problems related to tooling, processes, or logistics. </p><p>Rather than working primarily with users, you will instead work closely with our support team members and leads, as well as our senior management to identify critical problems and, most importantly, lead the execution of various initiatives that will continuously improve our internal work-flows and productivity. Υou will ensure that the tooling we use to interact with customers empowers the work of the customer support team. </p><p><br></p><p><strong>What We Want You To Do</strong><br></p><ul> <li>Work with Customer Support Manager to craft a long term vision for the infrastructure that benefits our customer support</li> <li>Maintain and improve support tools and infrastructure, ensure new tools are seamlessly integrated into the existing ones and into our team processes</li> <li>Build a data-driven framework to monitor the efficiency and the architecture of the tooling the support team uses each day</li> <li>Assess and challenge existing processes within the support team, internal departments and with cross-functional partners and drive improvements in the procedures</li> </ul>",
    "requirements": "<p><strong>Your skills and experience</strong></p><ul> <li>3 years proven experience in a similar role</li> <li>Familiarity with CRM systems, support helpdesks and practices</li> <li>Experience working with Zendesk will be considered a plus</li> </ul><ul> <li>Experience in architecting and maintaining implementations of internal tooling</li> <li>Ability to lead projects through their life cycle and work independently</li> <li>Eagerness to solve complex business problems on time</li> <li>Analytical mindset, ability to interpret reporting and extract actionable insights from data</li> <li>Genuine passion for exceptional customer support </li> <li>Ability to collaborate with multiple stakeholders and cross functional teams in a very fast paced working environment</li> <li>Degree in Engineering, Sciences, Economics, Business</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/C6EBE24FF7"
}
]