[
{
    "id": 1537668,
    "title": "Backend Engineer - Discovery (BD 1220)",
    "company": "skroutz",
    "department": "Engineering",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by building the most trustworthy, trouble-free, and easy to use online discovery and shopping experience. We want to provide this experience not only to our users and partners, but also to our team members.<br>We believe that people drive our business forward and we strive daily to build a powerful team that shares the same passion and enthusiasm for eCommerce and technology.</p><p>The Discovery team is responsible for shaping the product discovery experience for all users. We help users navigate and filter through millions of products in thousands of categories and assist them in figuring out how their specific needs will be met. To be successful, we have to translate the optimal user experience to a technological product, designing and implementing multiple experiments along the way. Our systems must be fast and reliable, often supporting more than 100k requests per minute.</p> <p>We are looking for <strong>Software Engineers</strong> with a strong technical background and interest in building successful products and systems. You will be part of a small, talented and motivated team, tackle hard problems and improve the experience of millions of customers.</p><p><strong>Examples of work you might undertake</strong></p><ul> <li>Create the infrastructure to support the specific UX needs of each product category, whether it is fashion, home furniture or technology</li> <li>Assist in the development of an excellent book shopping experience</li> <li>Implement and maintain the best product reviewing system in the industry</li> <li>Create or improve complex product filtering mechanisms such as sizes or colours</li> <li>Run experiments and track several metrics to measure success</li> <li>Maintain a software stack that serves millions of requests per day</li> </ul>",
    "requirements": "<p><strong>Your skills and experience</strong></p><ul> <li>Solid algorithmic and software engineering background</li> <li>Solid understanding of web architecture</li> <li>Very good knowledge of at least one programming language. We work mostly in Ruby, but we believe that languages can be learned; we care much more about your general engineering skills</li> <li>Very good knowledge and understanding of SQL and database systems</li> <li>Passion for readable, maintainable, testable, scalable and performant code</li> <li>Ability to navigate around a relatively large existing codebase and cooperatively improve it through code reviews</li> <li>Experience with a version control system (preferably Git) and a CI workflow</li> <li>Team spirit and easy going attitude</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/A543C836D8"
},
{
    "id": 1539934,
    "title": "Backend Engineer - Marketplace (BEM 1220)",
    "company": "skroutz",
    "department": "Engineering",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by building the most trustworthy, trouble-free, and easy to use online discovery and shopping experience. We believe that people drive our business forward and we strive daily to build a powerful team that shares the same passion and enthusiasm for eCommerce and technology.</p><p><strong>What We Are Looking For</strong></p><p>We are looking for Software Engineers with a strong technical background and a “get-things-done” attitude to join our <a href=\"https://www.skroutz.gr/careers#Marketplace\" rel=\"nofollow noreferrer noopener\" class=\"external\">Marketplace</a> team. Our focus is to deliver quality products, making the right trade-offs along the way.<br></p><p><strong>Examples of work you might undertake</strong></p><ul> <li>Implement new features for expanding our Marketplace offering to all categories of Skroutz</li> <li>Help our customer support team scale by automating procedures or improving existing ones</li> </ul><ul> <li>Improve our checkout flow to provide the best possible buying experience</li> </ul><ul> <li>Optimize our cart algorithm for calculating the best possible shopping solution for a certain basket</li> </ul><ul> <li>Optimize and monitor performance to keep up with our rapid-scaling Marketplace orders volume (over 2 million orders fulfilled, 10x YoY growth)</li> </ul><ul> <li>Implement third-party API integrations to support multiple shipping and payment options, support tools, financial tools etc</li> </ul>",
    "requirements": "<p><strong>Your Skills and Experience</strong></p><ul> <li>At least (1) year of working experience as a Software Engineer in a professional setting</li> <li>A solid CS background</li> <li>Intrigued by the product as much as by the technology</li> <li>Good analytical and problem-solving skills</li> <li>Good communication skills and team spirit</li> </ul><p><strong>We will appreciate if you have</strong></p><ul> <li>Good knowledge of Ruby/Ruby on Rails is a huge plus</li> <li>Experience with JavaScript frameworks/UI libraries (preferably React)</li> <li>Solid understanding of web architecture</li> <li>Strong knowledge of database systems (relational, document-based, etc)</li> <li>Familiarity with OOP principles and design patterns</li> <li>Comfort with TDD and other testing practices</li> <li>Exposure to architectural patterns and the production system of a large, performance-intensive web application</li> <li>Contributed to open-source projects</li> <li>Shareable open source contributions or personal projects which will help us in the evaluation process</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/D02C21385E"
},
{
    "id": 1539905,
    "title": "Backend Engineer - Content (BEC 1220)",
    "company": "skroutz",
    "department": "Engineering",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by building the most trustworthy, trouble-free, and easy to use online discovery and shopping experience. We want to provide this experience not only to our users and partners, but also to our team members.<br> We believe that people drive our business forward and we strive daily to build a powerful team that shares the same passion and enthusiasm for eCommerce and technology.</p><p><strong>What We Are Looking For</strong></p><p>We are looking for Software Engineers with a strong technical background and a “get-things-done” attitude who are eager to learn new exciting technologies to join our <a href=\"https://www.skroutz.gr/careers#Content\" rel=\"nofollow noreferrer noopener\" class=\"external\">Content</a>.<br></p><p><strong>Examples of work you might undertake</strong></p><ul> <li>Optimize our product categorization and clustering pipelines, used to classify over 30k new products daily.</li> <li>Improve the extraction of product attributes (e.g. brand, color, model number) from product titles, descriptions or other semi-structured data.</li> <li>Develop our content management system (codenamed \"Earth\"), used to maintain specs, descriptions and media for over 10M products.</li> <li>Work on product sizes detection and conversions across 150+ fashion categories, enabling filters and size guides on the Skroutz platform.</li> <li>Help automate any time-consuming manual procedure that a machine can perform more efficiently.</li> </ul>",
    "requirements": "<p><strong>Your Skills and Experience</strong></p><ul> <li>At least (1) year of working experience as a Software Engineer in a professional setting</li> <li>A solid CS background</li> <li>Intrigued by the product as much as by the technology</li> <li>Good analytical and problem-solving skills</li> <li>Good communication skills and team spirit</li> </ul><p><strong>We will appreciate if you have</strong></p><ul> <li>Good knowledge of Ruby/Ruby on Rails is a huge plus</li> <li>Solid understanding of web architecture</li> <li>Strong knowledge of database systems (relational, document-based, etc)</li> <li>Familiarity with OOP principles and design patterns</li> <li>Comfort with TDD and other testing practices</li> <li>Exposure to architectural patterns and the production system of a large, performance-intensive web application</li> <li>Contributed to open-source projects</li> <li>Shareable open source contributions or personal projects which will help us in the evaluation process</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/340965050F"
},
{
    "id": 1537998,
    "title": "Senior Site Reliability Engineer - Core Infrastructure (SRE 1220)",
    "company": "skroutz",
    "department": "Engineering",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by building the most trustworthy, trouble-free, and easy to use online discovery and shopping experience. We want to provide this experience not only to our users and partners, but also to our team members.<br>We believe that people drive our business forward and we strive daily to build a powerful team that shares the same passion and enthusiasm for eCommerce and technology.</p><p><strong>What we are looking<br></strong>We are looking for <strong>Site Reliability Engineers</strong> to join our Core Infrastructure SRE team! Our team lies right at the heart of Skroutz, making sure our services are always up and running, as a leading e-commerce platform should do.</p> <p>From your role, you'll be working together with a  group of people that sets up, scales and operates the infrastructure which supports <a href=\"https://www.skroutz.gr/\" rel=\"nofollow noreferrer noopener\" class=\"external\">skroutz.gr</a> and the systems that surround it. Our infrastructure is self-managed, and we run everything from bare-metal servers and virtual machines to network switches and routers. We operate at around ~500 hosts spanning 3 physical locations and running various workloads including virtualization, load balancing, databases, caching, storage, monitoring, and so on! We are passionate about free software and that’s why we chose to run Debian GNU/Linux everywhere, even on our core routers(!), always looking for ways to contribute back to the community.</p> <p>As a Sr. SRE, we want you to bring a developer's mindset to system administration by looking for ways to automate our manual work and scale our systems to meet tomorrow’s needs; to help us expand our infrastructure by considering and mitigating all possible things that could go wrong, before they do, by focusing on openness, reliability and performance.</p>",
    "requirements": "<p>For this role we are looking for experienced candidates who are proficient with the Linux stack, familiar with networking concepts, and have a good background in software engineering and infrastructure automation scripting; we use Python extensively and Go where we find it more suitable. We definitely don’t expect you to know all our systems from day one, our team will be there to answer all the questions and guide you on our infrastructure and the technologies we use. You might have a CS or an equivalent engineering degree, but you might not. This is definitely not among our top priorities; having prior working experience on high-throughput systems with high availability demands is mainly what we are interested in and not how you get there. </p> <p>Below there’s a list of items which you don't need to possess completely, but mostly cover the tools you’ll need for the work you’ll be mainly assigned.</p><p><strong>Your Skills and Experience</strong></p><ul> <li>More than 5 years managing Linux server infrastructures.</li> <li>In-depth understanding of Linux systems.</li> <li>Strong programming skills in at least one programming language such as Python, Go or Ruby.</li> <li>Experience in deploying, managing, and using observability tools such as Prometheus, Grafana and the ELK stack.</li> <li>Experience with web services (load balancing, HTTP, TLS); we use HAProxy, Varnish, and Nginx.</li> <li>Working knowledge of a configuration management system like Puppet, Ansible, and Chef.</li> <li>A sense of self-drive and solution-oriented attitude; is something broken? You can't help it unless you fix it!</li> <li>Ability to debug, optimize code, and automate routine tasks.</li> <li>Effective communication and written skills with a strong tendency to \"document as you go\"</li> </ul><p><strong>We will appreciate if you have</strong></p><ul> <li>Good knowledge of the Linux networking stack (netfilter, policy routing, advanced interface types)</li> <li>Some experience managing bare-metal hardware (PXE boot, working hands-on with computer hardware)</li> <li>Experience with Docker in a production environment including container orchestration (e.g. Kubernetes, Mesos, Nomad, etc)</li> <li>Personal projects or any shareable open source contributions which will help us during the evaluation process</li> </ul><p><br></p><p><strong>Examples of work you might undertake<br></strong></p><p>Here are some things we’ve worked on recently that might give you a better sense of what you’ll be doing day to day:</p><ul> <li>Maintain the infrastructure and services used by skroutz.gr and the systems that surround it.</li> <li>Improve the monitoring and visibility of our stack (services, networking, hosts), enhance our Prometheus Monitoring system and build new exporters and metrics for it.</li> <li>Design, setup, and execute the migration plan to our next generation of bulk storage pools using Ceph.</li> <li>Revamp our automated OS provisioning to make it more reliable and support newer OS releases.</li> <li>Maintain and be responsible for the upkeep and expansion of our datacenter infrastructure; this typically includes physical presence and working hands-on with computer hardware.</li> </ul><p><strong>Technologies you'll work with</strong></p><ul> <li>Debian Linux for our 500+ hosts (bare metal, VMs, and routers)</li> <li>Ganeti and Qemu for virtualization</li> <li>Puppet CE for configuration management and Ansible for switches</li> <li>Haproxy, Varnish, Nginx</li> <li>MariaDB, Elasticsearch, MongoDB, Redis, Druid</li> <li>Keepalived, BGP, OSPF</li> <li>Python, Go, Bash</li> <li>Kafka, Openstack Swift, and (soon) Ceph for storage</li> <li>ELK stack, Prometheus, Grafana, Icinga, Munin, Graphite and StatsD for observability</li> <li>Juniper QFX and EX-series network switches</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/485671FB1F"
},
{
    "id": 1547356,
    "title": "Senior Backend Engineer - Discovery (SBD 1220)",
    "company": "skroutz",
    "department": "Engineering",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by building the most trustworthy, trouble-free, and easy to use online discovery and shopping experience. We want to provide this experience not only to our users and partners, but also to our team members.<br>We believe that people drive our business forward and we strive daily to build a powerful team that shares the same passion and enthusiasm for eCommerce and technology.<br>The Discovery team is responsible for shaping the product discovery experience for all users. We help users navigate and filter through millions of products in thousands of categories and assist them in figuring out how their specific needs will be met. To be successful, we have to translate the optimal user experience to a technological product, designing and implementing multiple experiments along the way. Our systems must be fast and reliable, often supporting more than 100k requests per minute.</p><p>We are looking for <strong>Senior Software Engineers</strong> with strong technical knowledge and experience in large scale applications. You will be part of a small, talented and motivated team, tackle hard problems and improve the experience of millions of customers.</p><p><strong>Examples of work you might undertake</strong></p><ul> <li>Create the infrastructure to support the specific UX needs of each product category, whether it is fashion, home furniture or technology</li> <li>Assist in the development of an excellent book shopping experience</li> <li>Implement and maintain the best product reviewing system in the industry</li> <li>Create or improve complex product filtering mechanisms such as sizes or colours</li> <li>Run experiments and track several metrics to measure success</li> <li>Maintain a software stack that serves millions of requests per day</li> </ul>",
    "requirements": "<p><strong>Your skills and experience</strong></p><ul> <li>At least five years of working experience as a Software Engineer in a professional setting, designing and building high volume, scalable web applications from end to end</li> <li>Solid algorithmic and software engineering background</li> <li>Excellent understanding of web architecture</li> <li>Excellent knowledge of at least one programming language. We work mostly in Ruby, but we believe that languages can be learned; we care much more about your general engineering skills</li> <li>Very good knowledge and understanding of SQL and database systems</li> <li>Passion for readable, maintainable, testable, scalable and performant code</li> <li>Ability to navigate around a relatively large existing codebase and cooperatively improve it</li> <li>Experience with a version control system (preferably Git) and a CI workflow</li> <li>Contribution to open source projects is huge plus</li> <li>Team spirit and easy going attitude</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/BC3539EEBA"
},
{
    "id": 1553490,
    "title": "iOS Developer (ID 1220)",
    "company": "skroutz",
    "department": "Engineering",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by building the most trustworthy, trouble-free, and easy to use online discovery and shopping experience. We want to provide this experience not only to our users and partners, but also to our team members.<br> We believe that people drive our business forward and we strive daily to build a powerful team that shares the same passion and enthusiasm for eCommerce and technology.</p>After some years of successfully launching and constantly improving our Android and iOS apps, currently used by hundreds of thousands of users, we are now ready to take them to the next level! Our vision is to make Skroutz a mobile-first company where apps will play a central role in revolutionizing the experience of buying online! If having “a billion products at your fingertips” sounds exciting and challenging to you, you may be just the kind of person we’re looking for!<p><strong>What We Are Looking For</strong></p><p>We are growing our mobile engineering team and are looking for <strong>iOS</strong><strong> Developers</strong> with...</p><ul> <li>strong technical background</li> <li>“get-things-done” attitude</li> <li>self-motivation</li> <li>team spirit</li> <li>attention to details</li> <li>thirst for knowledge</li> <li>desire to make an impact</li> </ul><p><strong>Examples of work you might undertake</strong></p><ul> <li>Work in an agile team with other mobile developers, API engineers and UI/UX designers to develop and maintain our iOS app, building new features and shaping our product</li> <li>Track down and fix performance bottlenecks and bugs, improving the reliability of our iOS app</li> <li>Employ A/B testing to measure the performance of different approaches to features and implementations, providing the best UX for our users</li> <li>Review and evaluate code from fellow team members, exchanging comments that make you and the author better engineers</li> </ul>",
    "requirements": "<p><strong>Your Skills and Experience</strong></p><ul> <li>At least 2 (two) years of experience as an iOS mobile developer</li> <li>Proven track record of building and shipping iOS apps in the Apple App Store</li> <li>Deep knowledge of Objective-C and Swift</li> <li>Deep understanding of iOS frameworks and development processes</li> <li>Knowledge of OO design principles, software and iOS design patterns</li> <li>Expert knowledge of asynchronous programming (GCD)</li> <li>Experience with developing highly-performant code and the ability to diagnose performance bottlenecks</li> <li>Fluency with web service architectures and technologies: JSON and RESTful APIs</li> <li>Passion for readable, maintainable and performant code</li> <li>Familiarity with common software engineering tools and practices (Git, Unit Testing, CI)</li> <li>Some familiarity with design/UX principles</li> <li>Intrigued by the product as much as by technology</li> </ul><p><strong>We will appreciate if you have</strong></p><ul> <li>Projects you’ve built/contributed to (e.g. Github account)</li> <li>Knowledge of creating and maintaining private pods</li> <li>Optimization of data usage over mobile networks</li> <li>Familiarity with deployment using Fastlane</li> <li>Familiarity with agile methodologies and practices</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/73287E5909"
},
{
    "id": 1553479,
    "title": "Android Developer (AD 1220)",
    "company": "skroutz",
    "department": "Engineering",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by building the most trustworthy, trouble-free, and easy to use online discovery and shopping experience. We want to provide this experience not only to our users and partners, but also to our team members.<br> We believe that people drive our business forward and we strive daily to build a powerful team that shares the same passion and enthusiasm for eCommerce and technology.</p><p>After some years of successfully launching and constantly improving our Android and iOS apps, currently used by hundreds of thousands of users, we are now ready to take them to the next level! Our vision is to make Skroutz a mobile-first company where apps will play a central role in revolutionizing the experience of buying online! If having “a billion products at your fingertips” sounds exciting and challenging to you, you may be just the kind of person we’re looking for!<br><br></p><p><strong>What We Are Looking For</strong></p><p>We are growing our mobile engineering team and are looking for <strong>Android Developers</strong> with...</p><ul> <li>strong technical background</li> <li>“get-things-done” attitude</li> <li>self-motivation</li> <li>team spirit</li> <li>attention to details</li> <li>thirst for knowledge</li> <li>desire to make an impact</li> </ul><p><strong>Examples of work you might undertake</strong></p><ul> <li>Work in an agile team with other mobile developers, API engineers and UI/UX designers to develop and maintain our Android app, building new features and shaping our product</li> <li>Track down and fix performance bottlenecks and bugs, improving the reliability of our Android app</li> <li>Employ A/B testing to measure the performance of different approaches to features and implementations, providing the best UX for our users</li> <li>Review and evaluate code from fellow team members, exchanging comments that make you and the author better engineers</li> </ul>",
    "requirements": "<p><strong>Your Skills and Experience</strong></p><ul> <li>At least 2 (two) years of experience as an Android mobile developer</li> <li>Proven track record of building and shipping Android apps in the Google Play Store</li> <li>Deep knowledge of Java and Kotlin</li> <li>Good knowledge of the Android SDK (Components, Lifecycles, Layouts, Fragments, Animations, Drawables)</li> <li>Knowledge of OO design principles, software and Android design patterns</li> <li>Familiarity with modern Android architectures (MVP, MVVM)</li> <li>Expert knowledge of asynchronous programming</li> <li>Experience with developing highly-performant code and the ability to diagnose performance bottlenecks</li> <li>Fluency with web service architectures and technologies: JSON and RESTful APIs</li> <li>Passion for readable, maintainable and performant code</li> <li>Familiarity with common software engineering tools and practices (Git, Unit Testing, CI)</li> <li>Some familiarity with design/UX principles</li> <li>Intrigued by the product as much as by technology</li> </ul><p><strong>We will appreciate if you have</strong></p><ul> <li>Projects you’ve built/contributed to (e.g. Github account)</li> <li>Optimization of data usage over mobile networks</li> <li>Knowledge of Reactive/Functional programming</li> <li>Knowledge of SQLite</li> <li>Familiarity with agile methodologies and practices</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/B93A83D41F"
},
{
    "id": 1544905,
    "title": "Senior Backend Engineer - Payments (SBΥ 1220)",
    "company": "skroutz",
    "department": "Engineering",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by being incredibly trustworthy, trouble-free, and easy to use. We want to provide this experience not only to our users and partners but also to our team members.</p><p>We believe that people drive our business forward and we strive daily to build a powerful team with people that share the same passion and enthusiasm for eCommerce and technology.</p><p>We are looking for Software Engineers with a strong technical background and a “get-things-done” attitude, who are eager to learn new exciting technologies to join our Partners team and help build a strong merchants value proposition with new products and services.</p><p><strong>What we are looking for</strong></p><p>We are looking for Senior Software Engineers with a strong technical background, experience in the Payments domain, and a “get-things-done” attitude, who are eager to learn new exciting technologies, to join our new, fully agile Payments team and help build robust and resilient software, that will be able to handle hundreds of thousands of payment sessions per day and to produce even more accounting documents (invoices, receipts, etc).<br></p><p><strong>Examples of work you might undertake</strong></p><ul> <li>Create monitoring and auditing tools to facilitate troubleshooting payment transactions and detecting/mitigating fraud incidents</li> <li>Use bank APIs to improve user experience and make customers’ lives easier</li> <li>Redesign and implement parts of the payment code as an event-driven pipeline to increase performance, robustness, and visibility.</li> <li>Provide tools to our support agents that are going to help with payment-related tickets</li> <li>Automate daily tasks</li> </ul><ul><li>Extend and improve the existing integration with our ERP</li></ul>",
    "requirements": "<p><strong>What skills and experience you will need</strong></p><ul> <li>At least (5) years of working experience as a Software Engineer in a professional setting.</li> <li>A solid CS background.</li> <li>Intrigued by the product as much as by the technology.</li> <li>Excellent analytical and problem-solving skills.</li> <li>Excellent communication skills and team spirit.</li> </ul><p><strong>We will appreciate if you have</strong></p><ul> <li>Good knowledge of Ruby/Ruby on Rails is a huge plus.</li> <li>Solid understanding of web architecture.</li> <li>Experience with the payments domain</li> <li>Strong knowledge of database systems (relational, document-based, etc).</li> <li>Familiarity with OOP principles and design patterns.</li> <li>Comfort with TDD and other testing practices.</li> <li>Exposure to architectural patterns and the production system of a large, performance-intensive web application.</li> <li>Contributed to open-source projects</li> <li>Shareable open source contributions or personal projects which will help us in the evaluation process.</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/F019F64E7E"
},
{
    "id": 1555365,
    "title": "Backend Engineer - Partners(BP 1220)",
    "company": "skroutz",
    "department": "Engineering",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by being incredibly trustworthy, trouble-free, and easy to use. We want to provide this experience not only to our users and partners, but also to our team members.</p><p>We believe that people drive our business forward and we strive daily to build a powerful team with people that share the same passion and enthusiasm for eCommerce and technology.</p><p>We are looking for <strong>Software Engineers</strong> with a strong technical background and a “get-things-done” attitude, who are eager to learn new exciting technologies to join our Partners team and help build a strong merchants value proposition with new products and service</p><p><strong>Examples of work you might undertake</strong></p><ul> <li>Improve our back-office system used by our 7000+ merchants.</li> <li>Work on our Analytics platform which handles over 30 Million requests per day and its adjacent services.</li> <li>Boost our Marketplace service offerings to further expand our e-commerce solution for brick-and-mortar shops.</li> <li>Develop and maintain our in-house affiliate management system.</li> <li>Enhance our billing algorithms, develop monitoring tools and build fraud detection mechanisms.</li> <li>Improve our Merchants' support operations with new services and automated processes.</li> </ul>",
    "requirements": "<p><strong>What skills and experience you will need</strong></p><ul> <li>High productivity on par with significant experience working as a Software Engineer in a professional setting.</li> <li>Very good knowledge of database systems (relational, document-based, etc).</li> <li>A solid CS background.</li> <li>Solid understanding of web architecture.</li> <li>Intrigued by the product as much as by the technology.</li> <li>Analytical and problem-solving skills.</li> <li>Team spirit and can-do attitude.<br> </li> </ul><p><strong>We will appreciate if you have</strong></p> <ul> <li>Good knowledge of Ruby/Ruby on Rails is a huge plus.</li> <li>Experience with JavaScript frameworks/UI libraries (preferably React).</li> <li>Familiarity with OOP principles and design patterns.</li> <li>Comfort with TDD and other testing practices.</li> <li>Exposure to architectural patterns and the production system of a large, performance-intensive web application.</li> <li>Contributed to open-source projects</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/B2D5B8B7E0"
},
{
    "id": 1555364,
    "title": "Senior Backend Engineer - Partners (SBP 1220)",
    "company": "skroutz",
    "department": "Engineering",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by being incredibly trustworthy, trouble-free, and easy to use. We want to provide this experience not only to our users and partners, but also to our team members.</p><p>We believe that people drive our business forward and we strive daily to build a powerful team with people that share the same passion and enthusiasm for eCommerce and technology.</p><p>We are looking for Software Engineers with a strong technical background and a “get-things-done” attitude, who are eager to learn new exciting technologies to join our Partners team and help build a strong merchants value proposition with new products and services.</p><p><strong>Examples of work you might undertake</strong></p><ul> <li>Improve our back-office system used by our 7000+ merchants.</li> <li>Work on our Analytics platform which handles over 30 Million requests per day and its adjacent services.</li> <li>Boost our Marketplace service offerings to further expand our e-commerce solution for brick-and-mortar shops.</li> <li>Develop and maintain our in-house affiliate management system.</li> <li>Enhance our billing algorithms, develop monitoring tools and build fraud detection mechanisms.</li> <li>Improve our Merchants' support operations with new services and automated processes.</li> </ul>",
    "requirements": "<p><strong>What skills and experience you will need</strong></p><ul> <li>At least (5) years of working experience as a Software Engineer in a professional setting.</li> <li>Excellent knowledge of database systems (relational, document-based, etc).</li> <li>Solid algorithmic and software engineering background.</li> <li>Solid understanding of web architecture.</li> <li>Intrigued by the product as much as by the technology.</li> <li>Excellent analytical and problem-solving skills.</li> <li>Excellent communication skills and team spirit.</li> </ul><p><strong>We will appreciate if you have</strong></p><ul> <li>Good knowledge of Ruby/Ruby on Rails is a huge plus.</li> <li>Experience with JavaScript frameworks/UI libraries (preferably React).</li> <li>Familiarity with OOP principles and design patterns.</li> <li>Comfort with TDD and other testing practices.</li> <li>Exposure to architectural patterns and the production system of a large, performance-intensive web application.</li> <li>Contributed to open-source projects</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/1CF34770D0"
},
{
    "id": 1264893,
    "title": "Join Skroutz team",
    "company": "skroutz",
    "department": "",
    "location": "Athens",
    "description": "<p>Do you want to be part of an amazingly growing environment but you don’t see an opening matching your profile? </p><p>Worry not!!!</p>",
    "requirements": "<p>Send us your CV telling us a few words about you, which team interests you and why you want to join Skroutz.</p><p>We will review your application and get back to you in the next two weeks. </p>",
    "link": "https://apply.workable.com/skroutz/j/4FFDCB70B4"
},
{
    "id": 1478501,
    "title": "Senior Product Manager (SPM 1020)",
    "company": "skroutz",
    "department": "Product Management",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by being incredibly trustworthy, trouble-free, and easy to use. We want to provide this experience not only to our users and partners, but also to our team members.</p><p>We believe that people drive our business forward and we strive daily to build a powerful team with people that share the same passion and enthusiasm for eCommerce and technology.</p><p><strong>What We Are Looking For</strong></p><p>We are looking for an experienced <strong>Product Manager</strong> who can understand the needs of our users and simplify complex problems. Skroutz Product Teams build thoughtful e-commerce experiences through continuous experimentation and refinement. We want people with a collaborative mindset that can drive a cross-functional team to build the best possible experiences for our users.</p><p><strong>A few examples of what you would do<br></strong></p><ul> <li>Analyse performance of the checkout funnel, locate areas of improvement and drive incremental optimisations.</li> <li>Understand company strategy and take part in quarterly planning in order to set goals and define success metrics.</li> <li>Communicate with internal teams to coordinate the data entry, design and development of a new filter functionality that will help users locate a product among thousands of options.</li> <li>Communicate and understand different approaches on the design of a new feature that exist between stakeholders. Use data and your business acumen to create alignment.</li> <li>Help your team to integrate a new payment method to the checkout process. Communicate with 3rd party payment providers to evaluate offerings. Communicate with internal stakeholders to set requirements.</li> </ul>",
    "requirements": "<p><strong>What Skills and Experience You Will Need</strong><br></p><ul> <li>At least 5 years of experience in a similar position.</li> <li>Ability to collect and analyse data.</li> <li>Great communication and organizational skills.</li> <li>Great understanding of user interaction and experience.</li> <li>Extended experience working closely with development and design teams.</li> </ul><p><strong>We will Appreciate if you have</strong></p><ul> <li>Good knowledge of Google Analytics and related software.</li> <li>Working experience on e-commerce products.</li> <li>Ability to understand technical challenges and adjust specifications.</li> <li>Working experience in a multi-functional environment.</li> </ul><p><em>Please note that this opening concerns an onsite job, located in Athens, Attica, Greece.</em></p>",
    "link": "https://apply.workable.com/skroutz/j/492A3A75C1"
},
{
    "id": 1569932,
    "title": "Senior UI/UX Designer - Product (DN 0121)",
    "company": "skroutz",
    "department": "Design",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by being incredibly trustworthy, trouble-free, and easy to use. We want to provide this experience not only to our users and partners, but also to our team members.</p><p>We believe that people drive our business forward and we strive daily to build a powerful team with people that share the same passion and enthusiasm for eCommerce and technology.</p><p><strong>What We Are Looking For</strong><br></p>We are looking to hire a talented UI / UX Designer, passionate about designing amazing yet simple user-centered experiences. You will be responsible for early-stage research and ideation, through implementation and iteration towards building products for the web, mobile web and apps.<p><strong>What you are expected to do</strong></p><ul> <li>Own all sides of design from concept to launch: storyboards, user flows, mockups, prototypes, and pixel perfect assets</li> <li>Conduct user studies, competitive research and usability tests</li> <li>Work closely with developers to see design through to implementation</li> <li>Request  early feedback through rapid prototypes or low fidelity wireframes </li> <li>Develop, maintain and create pixel perfect designs, mockups and specifications as needed, adhering to brand guidelines</li> <li>Maintain consistency in visual elements and ensure that our design system and philosophy is applied across the product</li> <li>Collaborate with internal teams; communicate thoughts and expertise to the rest of the team</li> <li>Stay on top of new technology and trends in mobile UI/UX designs</li> </ul>",
    "requirements": "<p><strong>Your Skills and Experience</strong><br></p><ul> <li>Minimum 3 years experience in a relevant position</li> <li>Excellent Portfolio of UI/UX design solutions across a spectrum of platforms and services</li> <li>Experience of working in a cross-discipline team environment</li> <li>Experience in user research, usability studies, personas</li> <li>Degree in Digital or Graphic Design (optional)</li> </ul><p><strong>Skills</strong></p><ul> <li>Proficiency in relevant creative tools (Sketch, Adobe XD, Figma)</li> <li>Familiarity with Abstract, Zeplin, Photoshop, Illustrator, prototyping tools</li> <li>Demonstrated experience working with a design system, its curation, maintenance, and dissemination</li> <li>Highly detail oriented with a drive for perfection down to the last pixel</li> <li>Self-motivated to prioritise and manage workload and meet critical project deadlines</li> <li>Positive attitude with a creative, solution-driven mindset</li> <li>Familiarity with HTML, CSS &amp; Javascript (optional)</li> </ul><p><em>*Please make sure that you have included in your application a sample link of your UI/UX Portfolio. Applications with no portfolio will not be assessed further.</em></p><p><em>**<em>Please note that this opening concerns an onsite job, located in Athens, Attica, Greece.</em></em></p>",
    "link": "https://apply.workable.com/skroutz/j/606907DAEC"
},
{
    "id": 1571236,
    "title": "Tech Lead Engineer - Partners (TL 0121)",
    "company": "skroutz",
    "department": "Engineering",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by building the most trustworthy, trouble-free, and easy to use online discovery and shopping experience. We want to provide this experience not only to our users and partners, but also to our team members.<br>We believe that people drive our business forward and we strive daily to build a powerful team that shares the same passion and enthusiasm for eCommerce and technology.</p><p>We are looking for a <strong>Tech Lead Engineer</strong> with strong technical knowledge and experience in large scale applications. You will be leading a small, talented and motivated cross-functional team, tackle hard problems and improve the experience of millions of customers. Your main responsibility will be the team’s technical output. </p><p><strong>What you will be doing</strong></p><ul> <li>Lead and mentor a team of engineers, both frontend and backend</li> <li>Coordinate with other tech leads and participate in hiring and onboarding of new members</li> <li>Be responsible for technical aspects of the product: technology decisions and choices, architecture, priorities, velocity, general project management</li> <li>Work with Product Managers to specify requirements and deliverables</li> <li>Hold regular 1-on-1s with the team members and guide them to growth and success</li> <li>Maintain a software stack that serves millions of requests per day</li> </ul>",
    "requirements": "<p><strong>Your skills and experience</strong></p><ul> <li>At least five years of working experience as a Software Engineer in a professional setting, designing and building high volume, scalable web applications from end to end</li> <li>Solid algorithmic and software engineering background</li> <li>Excellent understanding of web architecture</li> <li>Excellent knowledge of at least one programming language. We work mostly in Ruby, but we believe that languages can be learned; we care much more about your general engineering skills</li> <li>Very good knowledge and understanding of SQL and database systems</li> <li>Experience with a version control system (preferably Git) and a CI workflow</li> <li>Tech lead and people management experience</li> <li>Passion for readable, maintainable, testable, scalable and performant code</li> <li>Ability to navigate around a relatively large existing codebase and cooperatively improve it</li> <li>Contribution to open source projects is huge plus</li> <li>Team spirit and easy going attitude</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/D582AB9ACF"
},
{
    "id": 1584791,
    "title": "DevOps Engineer - Service Foundations (DES 0121)",
    "company": "skroutz",
    "department": "Engineering",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by building the most trustworthy, trouble-free, and easy to use online discovery and shopping experience. We want to provide this experience not only to our users and partners, but also to our team members.</p><p>We believe that people drive our business forward and we strive daily to build a powerful team that shares the same passion and enthusiasm for eCommerce and technology.</p><p>We are looking for DevOps Engineers to join our Service Foundations team and help us achieve our goals! Our team lies right at the heart of Skroutz, making sure that developers work as efficiently as possible, the way a leading e-commerce platform should do.</p><p>We have about 150 software engineers with plans to grow even more. We deploy new code more than 15 times a day just on our main website (skroutz.gr) and new changes can reach production as fast as 20 minutes with all tests run. Each team has its own staging cluster and each developer has access to his own personal datastores with anonymized data, updated daily. We support and develop various tools and microservices in Ruby, Python and Go, that facilitate internal development and business needs. We are passionate about free software and strive to give back to the community.</p><p>From your role, you'll be tasked to maintain and improve on our testing, integration and deployment services and infrastructure. As a DevOps Engineer we want you to help us in automating trivial tasks, improving our deployment infrastructure, provide a solid foundation for migrating to container based deployments and provide a complete and trouble-free experience for the developers.</p>",
    "requirements": "<p>For this role we are looking for experienced candidates who are proficient with Linux administration, container concepts/technologies, deployment pipelines, packaging, familiar with networking concepts, and have a good background in software engineering and infrastructure automation scripting; we use Python, Ruby, and Go where we find it more suitable. </p><p>We definitely don’t expect you to know all our systems from day one, our team will be there to answer all the questions and guide you on our infrastructure and the technologies we use. </p><p>You might have a CS or an equivalent engineering degree, but you might not. This is definitely not among our top priorities; having prior working experience on high-throughput systems with high availability demands is mainly what we are interested in and not how you got there.</p><p><strong>What we expect you to have</strong></p><ul> <li>3 or more years as a DevOps Engineer/SRE.</li> <li>Experience with building containerized applications for production environments</li> <li>Experience building and operating CI/CD pipelines (e.g. using Jenkins, GitLab CI/CD, GitHub Actions)</li> <li>Strong programming skills in at least one programming language such as Python, Go, or Ruby.</li> <li>Familiar with configuration management systems like Puppet, Ansible, or Chef.</li> <li>A sense of self-drive and solution-oriented attitude; is something broken? You can't help it unless you fix it!</li> <li>Ability to debug, optimize, and automate routine tasks.</li> <li>Ability to work as part of a team, participating in code reviews, sharing knowledge and helping the other team members.</li> <li>Effective communication and writing skills with a strong tendency to \"document as you go\"</li> </ul><p><strong>We will appreciate if you have</strong></p><ul> <li>Knowledge of the Linux networking (Netfilter, IP-route) and container fundamentals (cgroups, namespaces)</li> <li>Experience managing Kubernetes clusters</li> <li>Experience running services on public clouds (EC2, Azure, GCP)</li> <li>Understanding of large web service architectures (load balancing, HTTP/2, TLS)</li> <li>Experience using observability tools such as Prometheus, Grafana, and the ELK stack.</li> <li>Personal projects or any shareable open source contributions which will help us during the evaluation process</li> </ul><p><strong>Examples of work you might undertake</strong></p><p>As a member of our Service Foundations team, you will take part in the team’s day-to-day tasks, as well as in some long-term projects. You might find yourself:</p><ul> <li>Maintaining the CI/CD infrastructure and services used by our developers.</li> <li>Migrating our legacy custom CI/CD pipeline to a modern (container-based) one.</li> <li>Implementing a modern, unified deployment workflow across all our services.</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/9D8A0589DE"
},
{
    "id": 1589073,
    "title": "Product Designer - Mobile (PD 0121)",
    "company": "skroutz",
    "department": "Design",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by being incredibly trustworthy, trouble-free, and easy to use. We want to provide this experience not only to our users and partners but also to our team members.</p><p>We believe that people drive our business forward and we strive daily to build a powerful team with people that share the same passion and enthusiasm for eCommerce and technology.</p><p><strong>What We Are Looking For</strong><br></p><p>We are looking for a talented <strong>Product Designer</strong>, passionate about designing amazing yet simple user-centered experiences for our <strong>Mobile Apps</strong>. The ideal candidate would be responsible for research, analyze, and design end-to-end beautiful interfaces throughout the entire design workflow. From competitive analysis and mapping out user journeys to building meaningful design systems and creating high fidelity mockups.<br></p><p><strong>What you are expected to do</strong></p><ul> <li>Analyze objectives to develop designs that meet our company goals</li> <li>Review the performance of a release, identify learnings and find ways to enhance it. We believe in constant improvement ;)</li> <li>Conduct user studies, competitive research, usability &amp; iterative A/B tests. We love turning the complexity of a chaotic world into the simplicity of a great solution that truly solves customer needs</li> <li>Own all sides of design from concept to launch: storyboards, user flows, mockups, prototypes, and pixel perfect assets</li> <li>Maintain and constantly improve our design system and philosophy across the product</li> <li>Think product strategy at a high level and clearly articulate design decisions</li> <li>Collaborate in a cross-functional team; communicate thoughts and expertise to the rest of the members</li> <li>Stay on top of new technology and trends in mobile UI/UX design</li> </ul>",
    "requirements": "<p><strong>Your Skills and Experience</strong><br></p><ul> <li>Minimum 3 years experience in a relevant position</li> <li>Excellent Portfolio of UI/UX design solutions across a spectrum of platforms<br>and services</li> <li>Strong knowledge of design processes and methodology, particularly as applied to mobile products</li> <li>Understanding the specifications of each platform (Android, iOS)</li> </ul><ul> <li>Proficiency in relevant design tools (Figma, Sketch, Adobe XD)</li> <li>Familiarity with Prototyping tools, would be considered as a plus (Framer, Principle, Protopie) </li> <li>Highly detail oriented with a drive for perfection down to the last pixel</li> <li>Strong sense of prioritisation and workload management</li> <li>Positive attitude, team player, with a creative, solution-driven mindset</li> </ul><p><br><em>*Please make sure that you have included in your application a sample link of your UI/UX Portfolio. Applications with no portfolio will not be assessed further.</em></p><p><em>**Please note that this opening concerns an onsite job, located in Athens, Attica, Greece.</em></p>",
    "link": "https://apply.workable.com/skroutz/j/0DCAB7D14D"
},
{
    "id": 1599460,
    "title": "Support Engineer - Marketplace (SEM 0221)",
    "company": "skroutz",
    "department": "Engineering",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by building the most trustworthy, trouble-free, and easy to use online discovery and shopping experience. We believe that people drive our business forward and we strive daily to build a powerful team that shares the same passion and enthusiasm for eCommerce and technology.</p><p><strong>What We Are Looking For</strong></p><p>We are looking for a Support Engineer with a solid technical background and a “get-things-done” attitude to join our <strong>Marketplace Support Engineering team</strong>.</p><p>Marketplace Support Engineering is part of Skroutz’s Marketplace division, which is responsible for offering the “buy directly through Skroutz” service and builds all the tools and infrastructure needed for order management and fulfillment: from adding a product to cart all the way to package delivery.</p><p>The Support Engineering team works closely with our Customer Support team on retaining an excellent buying and after-sales experience for our customers. With tens of thousands of orders/shipments being processed daily, there are multiple cases that need special handling. The team is responsible for handling operational tasks, providing insights, reports and troubleshooting cases that cannot be handled by existing support tools. </p><p><strong>Examples of work you might undertake</strong></p><ul> <li>Write scripts to manipulate order records for special cases that cannot be handled by support tools. </li> <li>Debug problematic purchase flows, reported by users.</li> <li>Assist our customer support team via mass operations.</li> <li>Provide operational reports for order shipments.</li> <li>Review and provide feedback on documentation and procedures in coordination with the rest of Marketplace Engineering teams</li> </ul>",
    "requirements": "<p><strong>Your Skills and Experience</strong></p><ul> <li>At least (2) year of working experience as a Software/Support Engineer in a professional setting.</li> <li>A solid CS background.</li> <li>Good analytical and problem-solving skills.</li> <li>Good communication skills and team spirit</li> </ul><p><strong>We will appreciate if you have</strong></p><ul> <li>Knowledge of Ruby/Ruby on Rails is a huge plus.</li> <li>Strong knowledge of database systems (relational, document-based, etc).</li> <li>Familiarity with software development lifecycle.</li> <li>Familiarity with OOP principles.</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/D7319BAF38"
},
{
    "id": 1597719,
    "title": "Office IT Administrator (ΙΤ 0221)",
    "company": "skroutz",
    "department": "ΙΤ",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by building the most trustworthy, trouble-free, and easy to use online discovery and shopping experience. We want to provide this experience not only to our users and partners but also to our team members.</p><p>We believe that people drive our business forward and we strive daily to build a powerful team that shares the same passion and enthusiasm for eCommerce and technology.<br></p><p><strong><br>What We Are Looking For:</strong></p><p>We are looking for a Mid-Senior IT Administrator to join our Corporate IT Support Team.</p><p>Our corporate IT infrastructure lies right at the heart of our everyday work, and the Corporate IT Support Team is always eager to ensure that our workstations, our corporate network, and the rest of our office equipment are in perfect working order.</p> <p>Skroutz counts more than 450 employees and is constantly growing, making us face new challenges every day in several aspects of our work. We are looking for an IT administrator with a “can-do” mentality and user-centric attitude to help us take the company to the next level.</p><p><strong><br>Examples of work you might undertake<br></strong></p><ul> <li>Provide end-user support to a constantly growing team that uses workstations running Linux, Windows and macOS</li> <li>Design and implement expansions to our wired and wireless networks as the company grows in numbers</li> <li>Maintain and configure the company's VoIP infrastructure (200 VoIP clients using Asterisk PBX)</li> <li>Help the Corporate IT team configure and support our office equipment ranging from Raspberry Pi, printers to tablets and other devices</li> <li>Write tools to automate the Office IT team’s everyday work, ranging from inventory management to security update rollout</li> </ul><p><strong>Τechnologies you will work with</strong></p><ul> <li>Debian Linux, Microsoft Windows &amp; Apple macOS for our end users</li> <li>Puppet CE for configuration management</li> <li>OpenLDAP, FreeRADIUS for directory, user management and network authentication</li> <li>Asterisk for telephony PBX</li> <li>Juniper network switches</li> <li>Ubiquiti Unifi wireless access points</li> </ul>",
    "requirements": "<h3><br></h3><p><strong>What Skills and Experience You Will Need:</strong> </p><ul> <li>CS degree or 4+ years of relevant working experience</li> <li>Experience using Debian Linux or Ubuntu, Windows, and macOS</li> <li>Fundamental networking knowledge (802.1Q VLANs, STP, 802.1x authentication, etc)</li> <li>Experience with Asterisk-based VoIP setups</li> <li>Team player with an easy-going attitude and willingness to learn new things</li> <li>Strong organizational, problem-solving and prioritization skills</li> <li>Ability to take ownership of issues and follow through to resolution</li> <li>Effective communication and writing skills with a strong tendency to \"document as you go\"<br> </li> </ul><p><strong>Nice To Have:</strong></p><ul> <li>Good knowledge of at least one scripting language (preferably Python)</li> <li>Familiar with configuration management systems like Puppet, Ansible, or Chef</li> <li>Networking certifications (CCNA, etc)</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/7166ED3972"
},
{
    "id": 1594017,
    "title": "Graphic Designer - Advertising (GDA 0121)",
    "company": "skroutz",
    "department": "Design",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by being incredibly trustworthy, trouble-free, and easy to use. We want to provide this experience not only to our users and partners but also to our team members.</p><p><br>We believe that people drive our business forward and we strive daily to build a powerful team with people that share the same passion and enthusiasm for eCommerce and technology.</p><p><strong>What We Are Looking For</strong></p><p>We’re looking for a motivated <strong>Graphic Designer</strong> to work alongside our <strong>Advertising </strong>team!<br></p> <p>As a vital part of this team, you will be responsible for adapting our partners' advertising campaigns into promotional banners, displayed within our platform. Alongside our Advertising team, you will be responsible for assessing client briefs, pinpointing their integral parts in order to recompose their visuals, delivering an end result that matches clients' needs, and respects the platform's UX principles and advertising goals.</p><p><br></p><strong>Examples of Tasks you might handle</strong><ul> <li>Translate visually heavy, print-oriented campaigns into their web-oriented equivalent</li> <li>Adapt visuals for optimal performance in multiple viewports</li> <li>Review the performance of a release, identify learnings and find ways to enhance it. We believe in constant improvement</li> <li>Work hand in hand with front end developers to ensure the optimal implementation of your designs</li> <li>Stay on top of new technology and trends in Graphic design</li> </ul>",
    "requirements": "<p><strong>Your Skills and Experience</strong></p><ul> <li>2+ years experience working in a similar role</li> <li>Mastery of design tools, such as Illustrator, Photoshop</li> <li>Self-motivated to prioritise and manage workload and meet project deadlines</li> <li>Clearly articulating your design decisions and embracing feedback</li> <li>Positive attitude with a creative, solution-driven mindset</li> <li>Ability to manage multiple projects at the same time in a fast-paced environment</li> <li>Team Player</li> </ul><p><strong>We would appreciate if you have</strong></p> <ul> <li>Experience in a Digital Agency </li> <li>Experience in motion graphics and animation </li> </ul><p><em>*Please make sure that you have included in your application a sample link of your Portfolio. Applications with no portfolio will not be assessed further.</em></p><p><em>**Please note that this opening concerns an onsite job, located in Athens, Attica, Greece.</em></p>",
    "link": "https://apply.workable.com/skroutz/j/2213B01D6D"
},
{
    "id": 1579797,
    "title": "Graphic Designer - Merchandising (GDM 0121)",
    "company": "skroutz",
    "department": "Design",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by building the most trustworthy, trouble-free, and easy to use online discovery and shopping experience. We want to provide this experience not only to our users and partners but also to our team members.<br>We believe that people drive our business forward and we strive daily to build a powerful team that shares the same passion and enthusiasm for eCommerce and technology.</p><p><strong>What We Are Looking For</strong></p><p>We’re looking for a passionate, innovative <strong>Graphic Designer</strong> with brilliant creative ideas and amazing attention to detail to bring additional creative thinking and design ideas to our Skroutz Graphic Design team. </p><p>You’ll be responsible for managing multiple creative projects. You will be working closely with our <strong>Merchandising</strong> team, conceptualizing, designing, and producing a range of high-performing projects, covering the full spectrum of in-house merchandising streams, ranging from in-house promo campaigns (Home &amp; category banners) to dedicated landing pages, newsletters, and social media posts.</p><p>Overall you’ll be responsible for maintaining, creating, and constantly improving, the aesthetics and visual identity of our merchandising efforts.</p><p><strong>Examples of Tasks you might handle</strong></p><ul> <li>Conceptualize and design challenging marketing campaigns</li> <li>Adapt concepts for maximized performance in multiple streams and mediums.</li> <li>Create, maintain and evolve asset libraries and guidelines.</li> <li>Deliver solutions that support the desired business outcomes with minimal guidance</li> <li>Clearly articulating your design decisions and embracing feedback</li> </ul>",
    "requirements": "<p><strong>Your Skills and Experience</strong><br></p><ul> <li>3+ years experience working as a Graphic Designer</li> <li>Mastery of design tools, such as Illustrator, Photoshop, InDesign, Sketch</li> <li>Experience in brand, and digital marketing production</li> </ul><ul> <li>Highly detail-oriented with a drive for perfection down to the last pixel</li> <li>Self-motivated to prioritise and manage workload and meet critical project deadlines</li> <li>Positive attitude with a creative, solution-driven mindset</li> <li>Team player</li> </ul><p><strong>We would appreciate if you have</strong></p><ul> <li>Experience in a Digital Agency </li> <li>Experience in motion graphics and animation </li> <li>Excellent problem-solving skills and familiarity with technical constraints and limitations as they apply to design for platforms such as Social Media, Newsletters, and Display Banners</li> </ul><p><em>*Please make sure that you have included in your application a sample link of your Portfolio. Applications with no portfolio will not be assessed further.</em></p><p><em><em>**Please note that this opening concerns an onsite job, located in Athens, Attica, Greece.</em><br></em></p>",
    "link": "https://apply.workable.com/skroutz/j/20F3799D60"
},
{
    "id": 1568369,
    "title": "Customer Support Agent - Marketplace (CS 0121)",
    "company": "skroutz",
    "department": "Marketplace",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by being incredibly trustworthy, trouble-free, and easy to use. We want to provide this experience not only to our users and partners, but also to our team members.</p><p>We believe that people drive our business forward and we strive daily to build a powerful team with people that share the same passion and enthusiasm for eCommerce and technology.</p><p><strong>What We Are Looking For:</strong></p><p>We are looking for a Customer Support Agent to join our <a href=\"https://www.skroutz.gr/careers#Marketplace\" rel=\"nofollow noreferrer noopener\" class=\"external\">Marketplace</a> team. Our Marketplace Support team operates 7/7 (8 hours/shift on rotation, night shifts excluded), in order to timely handle incoming operational issues that our customers might face while using Skroutz Cart.</p><p>Here at Skroutz, our customers are at the heart of everything we do, which means that we try to get things right for them first time, every time. Our Marketplace team strives to make our customer's journey with us something we're proud of.</p><p><strong>What We Want You To Do:</strong><br></p><ul> <li>Ensure high levels of customer satisfaction through excellent after sales service.</li> <li>Assess customers needs and provide assistance and information on delivery orders, or returns and refunds.</li> <li>Create positive rapport and working relationships with merchants by providing daily support and guidance.</li> <li>Manage relevant web content by enriching product descriptions, characteristics and specifications.</li> <li>Maintain business relations with partners.</li> </ul>",
    "requirements": "<h3>What skills and experience you will need:</h3><p><strong>Experience</strong><br></p><ul><li>Bachelor’s degree</li></ul><ul> <li>Proven work experience in a customer support role in eCommerce environment</li> <li>Excellent PC and typing skills</li> <li>Familiarity with CRM systems, helpdesks and practices</li> </ul><p><strong>Skills</strong></p><ul> <li>Customer orientation and ability to adapt/respond to different types of characters</li> <li>Solid communication and interpersonal skills</li> <li>Ability to multi-task, prioritize, and manage time effectively</li> <li>Basic understanding of sales principles and customer service practices</li> <li>Working knowledge of customer and market dynamics and requirements</li> <li>A friendly and energetic personality with customer service focus</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/4BA8C8BEC8"
},
{
    "id": 1595679,
    "title": "Commercial Operations Analyst (CA 0221)",
    "company": "skroutz",
    "department": "Commercial",
    "location": "Athens",
    "description": "<p>At Skroutz, we have a vision to make everyone's life better by building the most trustworthy, trouble-free, and easy to use online discovery and shopping experience. We want to provide this experience not only to our users and partners, but also to our team members.<br>We believe that people drive our business forward and we strive daily to build a powerful team that shares the same passion and enthusiasm for eCommerce and technology.</p><p><strong>What We Are Looking For</strong></p><p>We are looking for an experienced Commercial Operations Analyst to join our newly-formed Commercial Operations team and help us execute high-impact projects that will enable us to scale and ensure the Commercial unit's successful operation. You'll contribute in designing the right strategy and optimising our processes but also monitoring the execution.</p><p><strong>Examples of work you might undertake</strong></p><ul> <li>Develop and monitor strategic initiatives using a variety of data sources and analytical techniques</li> </ul><ul> <li>Own the end-to-end process of analysing and tracking the sales / account management funnel &amp; operational metrics</li> <li>Work directly with Commercial Management to help:</li> </ul><ol> <ol> <li>drive efficiency through lead enrichment, funnel analysis and other timely commercial analytics </li> <li>assess risks and contingencies, together with creating plans to mitigate risks and drive performance</li> </ol> </ol><ul> <li>Collaborate with key stakeholders (incl. BI &amp; Product) and continuously identify opportunities for process improvement, data quality, and system serviceability</li> <li>Build dashboards and reports to track key metrics and KPIs (incl. individual and team performance), ensuring that relevant actions are taken</li> </ul><ul> <li>Lead operating plans for sales teams, including account segmentation and capacity modelling</li> <li>Conduct frequent reporting for business reviews</li> </ul>",
    "requirements": "<p><strong>Your knowledge and experience</strong><br></p><ul> <li>3 - 5 years of commercial / sales operations experience in a similar role within a fast-paced environment is essential</li> <li>Degree in Business, Statistics, Data Analysis or equivalent</li> <li>Advanced Excel capabilities </li> <li>Knowledge of SQL and Tableau</li> <li>Experience using R, Matlab, Python will be considered a plus</li> </ul><p><strong>Your skills</strong></p><ul> <li>Ability to deep-dive into complex problems and come back with clear actions</li> </ul><ul> <li>Strong communication, alignment, and collaboration skills</li> <li>Highly analytical and structured in your decision making process</li> <li>Comfortable tackling multiple things at once while prioritising high-impact tasks</li> <li>Passion for technology and for disrupting consumer/merchant experiences</li> <li>Humble, eager to learn, willing to roll-up sleeves when necessary</li> <li>Excellent organisational skills &amp; attention to detail</li> </ul>",
    "link": "https://apply.workable.com/skroutz/j/3862AF4EC1"
}
]